{"University Requirements": {"Completion of Minimum University Requirements for an Undergraduate Baccalaureate Degree.": ["Minimum 120 credits and minimum GPA of 2.0", "Completion of 45 upper-level credits, residence requirement, Writing Intensive requirement, and General Education requirement"]}, "Major Requirements": ["Minimum 36 credits", "Minimum grade of 'C' in courses applied to the major, except where otherwise indicated", "Maximum of 6 credits of independent study"], "American Studies Foundational Core (15 credits)": {"The American Studies Core provides a foundation in the key research and writing practices of the discipline. Two lower-level courses introduce students to fundamental American Studies concepts. Students build knowledge and engage in professional writing and research practices in an upper-level gateway course, two advanced seminars, and a capstone research seminar.": ["AMST 100 - Introduction to American Studies (3)", "AMST 200 - What is an American? (3)", "AMST 300 - Approaches in American Studies (3)", "AMST 400-level seminar (3)", "AMST 490 - Senior Seminar (3)"]}, "Core Themes (18 credits)": "Complete two courses from each of the following three core themes for a total of 18 credits. One 200 level course may be applied to the core themes.", "U.S. Social Structures: American Regions, Institutions, and Communities": {"Courses in this category focus on particular institutional structures and practices that shape and are shaped by the experiences of individuals and social groups in American society. Complete 6 credits from the following:": ["AMST 210 - Introduction to Critical Sexuality Studies (3)", "AMST 310 - Gender and Inequality in America (3)", "AMST 317 - Nonviolence and American Social Movements (3)", "AMST 320 - Television in American Culture (3)", "AMST 321 - Radio in American Culture (3)", "AMST 327 - Sports and Media in American Society (3)", "AMST 350 - Critical Decades (3)", "AMST 356 - Special Topics in U.S. Social Structures (3)", "AMST 380 - Community in America (3)", "AMST 382 - Perspectives on the Family (3)", "AMST 384 - Perspectives on Childhood and Adolescence (3)", "AMST 388 - American Environments: Landscape and Culture (3)", "AMST 410 - Seminar in U.S. Social Structures (3)", "AMST 422 - Preserving Places, Making Spaces in Baltimore (3)", "AMST 480 - Community in America Research Seminar (3)"]}, "Global America: The U.S. in the World, The World in the U.S.": {"Courses in this category explore the relationships of America with other countries and cultures, including globalization, migrations, immigration, diasporic experiences in America, and transnational cultures. Complete 6 credits from the following:": ["AMST 324 - The Road Movie in America and Abroad (3)", "AMST 345 - Indigenous Heritage: Issues of Representation and Ownership (3)", "AMST 352 - American Culture in Global Perspective (3)", "AMST 357 - Special Topics in Global America (3)", "AMST 372 - American Food (3)", "AMST 375 - Studies in Asian American Culture (3)", "AMST 403 - Ethnography in America (3)", "AMST 420 - Seminar in Global America (3)"]}, "American Signs: U.S. Literary, Visual, and Material Culture": {"Courses in this category provide interdisciplinary analysis of oral, written, visual, and material representations of American life and culture and the historical and social contexts in which they are produced and consumed. Complete 6 credits from the following:": ["AMST 322 - American Society and Culture in Film (3)", "AMST 323 - Baltimore in Film (3)", "AMST 325 - Studies in Popular Culture (3)", "AMST 344 - Made in America: Material Culture in the United States (3)", "AMST 358 - Special Topics in American Signs (3)", "AMST 365 - Asian American Fictions (3)", "AMST 376 - The American Dream (3)", "AMST 385 - Teachers in American Culture (3)", "AMST 395 - American Music and Culture (3)", "AMST 430 - Seminar in American Signs (3)", "AMST 464 - Narratives of Contemporary U.S. Immigration (3)"]}, "Applied Experience (3 credits)": "Includes internships, service learning, undergraduate research, student teacher praxis, and AMST courses designed as applied research. Students in dual programs may fulfill this requirement by taking an approved applied experience course in the second department. AMST 205 may be counted toward the applied experience requirement. Coursework applied to this requirement may use pass/fail or regular grading.", "American Studies Major/Education Certification": "There is a dual major/certificate program for students seeking teaching certification in Early Childhood Education, Elementary Education, or Secondary Education. Students in these programs whose certification requirements include supplementary courses in social sciences or history may substitute 9 credits of those courses for 9 credits of the core themes. Students making this substitution select one course exploring each theme from the lists above for the remaining 9 credits in the core themes. Students seeking education certification may count student teaching as their applied experience.", "Accelerated Bachelor's/Master's Programs": "Qualified students may apply to an accelerated program, which allows them to share courses between a bachelor's degree and a master's degree. Students take graduate courses as undergraduate students and later apply those courses to master's degrees. An undergraduate may apply to participate in an accelerated program even if the desired graduate program is in a department other than the one in which the student is majoring. More information is available from the Graduate School website: https://gradschool.umbc.edu/admissions/nontraditional/accelerated/"}