{"University Requirements": {"Completion of Minimum University Requirements for an Undergraduate Baccalaureate Degree.": ["Minimum 120 credits and minimum GPA of 2.0", "Completion of 45 upper-level credits, residence requirement, Writing Intensive requirement, and General Education requirement"]}, "Major Requirements": ["Minimum 39 credits", "Minimum grade of 'C' in courses applied to the major"], "Ancient Society (3 credits)": {"Complete one of the following:": ["ANCS 201 - The Ancient Greeks (3)", "ANCS 202 - The Roman World (3)", "ANCS 203 - Earliest Christianity (3)"]}, "Archaeology (3 credits)": {"Complete one of the following:": ["ARCH 200 - Greek Archaeology and Art (3)", "ARCH 201 - Roman Archaeology and Art (3)"]}, "Ancient History (3 credits)": {"Complete one of the following:": ["HIST 453 - Ancient Greece (3)", "HIST 455 - The Roman Republic (3)", "HIST 456 - The Roman Empire (3)"]}, "Ancient Studies (9 credits)": "Nine credits at the 300 level or above in ancient studies, Latin, Greek, archaeology, ancient history, or other approved subject areas", "Additional Courses (9 credits)": "Nine credits in any of the above or in related subject areas, e.g., philosophy or anthropology, as approved by the department", "Classical Language (12-15 credits)": "Complete at least one classical language to the intermediate level or higher.", "Option I": "Complete one three-credit, 300- or 400-level course in Latin or Greek. Students complete 15 credits in a classical language.", "Option II": {"Complete a classical language to the Intermediate I level and complete any combination of two additional General Education Language or Culture courses, including Culture courses taught by a member of the ancient studies faculty. Students complete 12 credits in a classical language and 6 credits from additional courses.": ["GREK 201 - Intermediate Greek (4)", "or LATN 201 - Intermediate Latin (4) ", "Two additional General Education Language or Culture courses"]}, "Preparing for Graduate Study": "Students planning to enter graduate school are advised to study a classical language to the advanced level and to complete additional language courses beyond those required for the major. Students planning to teach Latin are advised to complete five courses of Latin at the 300 level or above with a minimum grade of 'B.' Students are advised to consult a member of the Ancient Studies faculty for guidance."}