{"Teacher Certification and Licensure": "Education offers initial teacher certification programs that meet the standards set by the Maryland State Department of Education (MSDE) and the Council for the Accreditation of Educator Preparation (CAEP). Teacher certification programs are completed in conjunction with undergraduate majors and may require coursework in the major field beyond the major requirements. Teacher candidates at UMBC who complete a certification program and pass the tests and performance assessments outlined by MSDE are recommended to Maryland State Department of Education for licensure by the UMBC Education Department.  More information about MDSE testing requirements can be found here:", "University Requirements": {"Completion of Minimum University Requirements for an Undergraduate Baccalaureate Degree.": ["Minimum 120 credits and minimum GPA of 2.0", "Completion of 45 upper-level credits, residence requirement, Writing Intensive requirement, and General Education requirement"]}, "Program Requirements": ["Minimum 65 credits", "Minimum grade of 'C' in courses applied to the program", "Completion of a UMBC major"], "Professional Courses (33 credits)": {"Complete the following:": ["EDUC 419 - Assessment for Reading Instruction (3)", "EDUC 439 - Observation and Assessment in Early Childhood (3)", "EDUC 440 - Field Experience in Early Childhood Education (Level I) (2)", "EDUC 441 - Children's Literature and Other Materials for Early Literacy (3)", "EDUC 442 - Process Seminar in Early Childhood Education- Creative Media Level I (1)", "EDUC 445 - Field Experience in Early Childhood Education, Level II (1)", "EDUC 446 - Language, Literacy, and Intellectual Development of Young Children (3)", "EDUC 447 - Teaching of Reading and Writing in Early Childhood Education (3)", "EDUC 448 - Phase I Internship (1)", "EDUC 451 - Internship Seminar in Early Childhood Education (3)", "EDUC 450 - Internship in Student Teaching in Early Childhood Education (10)"]}, "General Education Courses (32 credits)": "Complete the following General Education courses. These courses may fulfill the GEP requirements for the student's bachelor's degree.", "Fine Arts/Literature": "Complete two courses in art, dance, music, film/video, theatre or literature, including a maximum of 3 credits in literature.", "Social Studies": "Complete two courses in the general areas of contemporary world culture and American culture. Advisors in the education department recommend courses.", "Psychology": {"Complete the following:": ["PSYC 100 - Introduction to Psychology (4)", "PSYC 200 - Child Developmental Psychology (3)", "or a course in child psychology, or child development, or developmental psychology"]}, "Mathematics": {"Complete the following or other approved courses:": ["MATH 131 - Mathematics for Elementary and Middle Grades Teachers I (4)", "MATH 132 - Mathematics for Elementary and Middle Grades Teachers II (4)"]}, "Science": "Complete two science courses with labs."}