{"University Requirements": {"Completion of Minimum University Requirements for an Undergraduate Baccalaureate Degree.": ["Minimum 120 credits and minimum GPA of 2.0", "Completion of 45 upper-level credits, residence requirement, Writing Intensive requirement, and General Education requirement"]}, "Major Requirements": ["Minimum 39 credits", "Minimum grade of 'C' in courses applied to the major", "Completion of one of the following tracks: English, B.A., Communication and Technology Track, English, B.A., Literature Track, English, B.A., Secondary Education Track "], "Core Courses (6 credits)": {"Complete the following:": ["ENGL 300 - Texts and Contexts (3)", "ENGL 301 - Analysis of Literary Language (3)"]}, "Diversity (3 credits)": {"Complete 3 credits from the following or other approved courses:": ["ENGL 364 - Perspectives on Women in Literature (3)", "ENGL 369 - Race and Ethnicity in U.S. Literature (3)"]}, "Electives (9-12 credits)": "Complete 9 credits from upper-level English courses, including creative writing courses. Students pursuing English, B.A., Secondary Education Track complete 12 credits from courses specified by the department.", "Advanced Courses (6 credits)": "Complete two 400-level Literature courses, including one seminar.", "Track (15 credits)": "Complete one of the following tracks: English, B.A., Communication and Technology Track, English, B.A., Literature Track, English, B.A., Secondary Education Track ", "Accelerated Bachelor's/Master's Programs": "Qualified students may apply to an accelerated program, which allows them to share courses between a bachelor's degree and a master's degree. Students take graduate courses as undergraduate students and later apply those courses to master's degrees. An undergraduate may apply to participate in an accelerated program even if the desired graduate program is in a department other than the one in which the student is majoring. More information is available from the Graduate School website: https://gradschool.umbc.edu/admissions/nontraditional/accelerated/"}