{"Total Credits": "Students complete the pre-nursing curriculum in 63-64 credits.", "English (6 credits)": ["ENGL 100 - Composition (3)", "One literature course selected in consultation with an advisor (3)"], "Biology (19 credits)": ["BIOL 101 - Concepts Of Biology (3)", "BIOL 233 - Nutrition and Health (3)", "BIOL 251 - Human Anatomy and Physiology I (3)", "BIOL 251L - Human Anatomy and Physiology I Laboratory (1)", "BIOL 252 - Human Anatomy and Physiology II (3)", "BIOL 252L - Human Anatomy and Physiology II Laboratory. (1)", "BIOL 273 - Microbiology for Allied Health (3)", "BIOL 273L - Microbiology Laboratory (2)"], "Chemistry (9 credits)": ["CHEM 123 - Introduction to General Organic and Biochemistry I (4)", "CHEM 124 - Introduction to General Organic and Biochemistry II (3)", "CHEM 124L - General Organic and Biochemistry Lab (2)"], "Mathematics/Statistics (7-8 credits)": {"or MATH 150 - Precalculus Mathematics (4)": ["MATH 106 - Algebra and Elementary Functions (3)", "or MATH 150 - Precalculus Mathematics (4)", "STAT 121 - Introduction to Statistics for the Social Sciences (4)"]}, "Psychology (7 credits)": ["PSYC 100 - Introduction to Psychology (4)", "PSYC 306 - Lifespan Human Development (3)"], "Sociology (3 credits)": ["SOCY 101 - Basic Concepts in Sociology (3)"], "Social Sciences Elective (3 credits)": ["Choose among anthropology, economics, geography, history, political science, psychology, social work, and sociology."], "Arts and Humanities Electives (9 credits)": ["Choose electives from at least two of the following academic areas: art, foreign language, history, literature, mathematics, music, philosophy, speech"], "UMBC/University of Maryland School of Nursing Pathway": "For incoming first-year students who are interested in nursing, UMBC offers a collaborative partnership with the University of Maryland School of Nursing (UMSON), a premiere school of nursing. This partnership focuses on enhanced advising, programming and preparation for nursing school while at UMBC. Students are paired with pre-nursing advisors who mentor them through their academic career and foster a connection between UMBC and the UMSON. While at UMBC, students also have the added benefit of collective programmatic opportunities, including site visits to UMSON to see classrooms, labs and clinical sites. Eligible students must indicate their intended program of study as pre-nursing prior to matriculation at UMBC. As part of this collaboration, each year UMBC secures as many as thirty seats in the UMSON class, offered to those who have met certain academic requirements. More information on this exclusive partnership is available from the Office for Academic and Pre-Professional Advising."}