{"Support": "Dr. Jeffrey Davis, davisj@umbc.edu\nPUP 316\nphone: 410-455-2181\non-campus: 5-2181", "Experience": "The political science program offers students from any major the opportunity to take an internship with courts, law enforcement agencies, private law firms, and other legal institutions. These internships provide students with a realistic view of legal professions and often lead to summer jobs and law school recommendations. Interested students apply in the fall semester for spring internship placement. Students who have a cumulative GPA of 3.0 or above and have completed at least 60 credits are eligible to apply. Selected students will be given permission to enroll in POLI 438, the 4-credit legal intenrship course. Applications are availalbe through the Political Science Department.  ", "Academics": {"The department offers the Law and Justice minor to undergraduates of all majors. The Law and Justice minor allows students to develop an expertise in the law, and in how lawyers, courts and judges influence the world.  We offer a wide variety of classes in American, comparative, and international law.  In addition, the minor features classes that examine the struggle for justice as well as the theoretical foundations of law and justice.  The minor is excellent training for students who plan to attend law school, or to work in the many fields where knowledge of the law is a powerful asset.  An understanding of law and justice is valuable for students working in politics, business, the arts, science, technology, and engineering.  The minor offers students hands-on practical opportunities through legal internships, mock trial, moot court, and legal advocacy.  ": ["POLI 220 - The Constitution and American Democracy (3)", "POLI 230 - Introduction to Constitutional Law (3)", "POLI 233 - Common Law and Legal Analysis (3)", "POLI 334 - Judicial Process (3)", "POLI 338 - Women, Gender, and Law (3)", "POLI 352 - Administrative Law (3)", "POLI 435 - Legal Reasoning (3)", "POLI 438 - Legal Internship (4)"]}}