[{"Course": "MUSC 252", "Name": "Music in Wartime", "Credits": "3", "Description": "This course explores the emotional, practical, and political uses of music during specific times of violent conflict worldwide. Topics may include the Bosnian War, the American Civil War, WWII, the Vietnam War, the recent wars in Iraq and Afghanistan, the Dutch colonization of Bali, and South African apartheid. Students will examine how soldiers, prisoners, civilians, and nations used music during these times for such disparate purposes as entertainment, propaganda, protest, torture, grieving, and community healing.", "Grading": "Graded", "Course ID": "102335", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "MUSC 261", "Name": "Teaching Choral Singing", "Credits": "3", "Description": "Teaching Choral Singing provides an introduction to choral pedagogy for music educators. Fundamentals of vocal technique are combined with methodologies for teaching beginning and intermediate choruses how to read choral music and how to create a good choral sound. Class involves opportunities for teacher observation and practicum experiences.", "Grading": "Graded", "Course ID": "55611", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 175 with a grade of ‘C’ or better"}, {"Course": "MUSC 300", "Name": "Performance Studies Workshop", "Credits": "1", "Description": "Designed for students with performance abilities in various areas of music. Topics will vary to include opera, musical theatre, mixed-media, etc. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55614", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "MUSC 301", "Name": "UMBC Chamber Players", "Credits": "1", "Description": "The UMBC Chamber Players is a small, select ensemble of instrumentalists and singers coming from all academic areas. A diverse program of chamber music from all historical periods is performed on and off campus throughout the year.  An audition with the ensemble director is required. MUSC 301 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190  or MUSC 193 or MUSC 194 or prior experience playing in an ensemble", "Grading": "Graded", "Course ID": "055615", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 303", "Name": "UMBC Camerata–Chamber Choir", "Credits": "1", "Description": "The UMBC Camerata is a small, select ensemble of singers coming from all academic areas. A diverse program of vocal literature is performed throughout the year including madrigals and works for small choruses. An audition with the ensemble director is required. MUSC 303 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 of MUSC 194 or prior experience singing in an ensemble", "Grading": "Graded", "Course ID": "55617", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 303H", "Name": "UMBC Camerata–Chamber Choir", "Credits": "3", "Description": "The UMBC Camerata is a small, select ensemble of singers coming from all academic areas. A diverse program of vocal literature is performed throughout the year including madrigals and works for small choruses. An audition with the ensemble director is required. MUSC 303H cannot be taken concurrently with MUSC 358.  Recommended Preparation:  MUSC 190  or MUSC 193  or MUSC 194  or prior experience in an ensemble.", "Grading": "Graded", "Course ID": "101966", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 304", "Name": "UMBC Jubilee Singers", "Credits": "1", "Description": "This class affords students instruction in sacred music, predominantly from the African- American heritage. The course will provide an introduction to and study of a variety of musical styles, including spirituals, hymns and anthems. Vocal technique is also part of the class structure. An audition with the ensemble director is required. MUSC 304 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 170  or MUSC 171 or prior experience singing in an ensemble.", "Grading": "Graded", "Course ID": "55618", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 305", "Name": "UMBC Symphony Orchestra", "Credits": "1", "Description": "The UMBC Symphony is a full-size symphonic ensemble consisting of students, faculty and community members. The orchestra meets once a week in the evening and performs regularly in public throughout the year. An audition with the ensemble director is required. MUSC 305 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55619", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 305H", "Name": "UMBC Symphony Orchestra", "Credits": "3", "Description": "The UMBC Symphony is a full-size symphonic ensemble consisting of students, faculty and a few community members. The orchestra meets once a week in the evening and performs regularly in public throughout the year. An audition with the ensemble director is required. MUSC 305H cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 20 credits. Recommended Preparation: MUSC 190  or MUSC 193  or MUSC 194  or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "101967", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 306", "Name": "Improvisation Ensemble", "Credits": "1", "Description": "The study of recent improvisation practices from graphic scores, to group composition, to coexisting hybrid strategies to free improvisation to intuitive music. Attention also will be given to experimental jazz as a model for further improvisational exploration. Students in the class will be strongly encouraged to develop their own musical voices and invent new ways to improvise. This course is a laboratory for the exploration of the individual musical soul. An audition with the ensemble director is required. MUSC 306 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55620", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 307", "Name": "Small Ensemble", "Credits": "1", "Description": "This course introduces students to the literature composed for small ensembles. Students will perform with their small ensemble at the end of the semester. An audition with the ensemble director is required. MUSC 307 cannot be taken concurrently with MUSC 358. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55621", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 308", "Name": "UMBC Wind Ensemble", "Credits": "1", "Description": "The UMBC Wind Ensemble is an instrumental ensemble consisting of students, faculty and community members. The group meets once a week in the evening. A diverse program of wind ensemble literature is performed through the year. An audition with the ensemble director is required. MUSC 308 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55623", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 309", "Name": "UMBC New Music Ensemble", "Credits": "1", "Description": "The repertory of the UMBC New Music Ensemble centers around the latest developments in the sonic art. The ensemble explores, performs, and studies new concepts in notation, extended performing techniques, group improvisation and group composition. An audition with the ensemble director is required. MUSC 309 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55624", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 310", "Name": "Beginning Gamelan", "Credits": "1", "Description": "This course offers an introduction to the repertory of the gamelan, a traditional ceremonial ensemble of Indonesia.  MUSC 310 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 2 credits. Recommended Preparation: MUSC 230 or prior experience playing in an ensemble", "Grading": "Graded", "Course ID": "55625", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 311", "Name": "Free Composition", "Credits": "3", "Description": "This course is an introduction to music composition.  Students are encouraged to develop music in their own styles while exploring a variety of compositional techniques.  Students study the works of a variety of composers throughout the semester and hear readings of their compositions by the faculty ensemble Ruckus. Recommended Preparation: MUSC 224 ", "Grading": "Graded", "Course ID": "55626", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 312", "Name": "Composition", "Credits": "3", "Description": "A continuation of MUSC 311 , this course offers advanced studies in musical composition.", "Grading": "Graded", "Course ID": "55627", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 311  with a grade of ‘C’ or higher."}, {"Course": "MUSC 313", "Name": "Advanced Gamelan", "Credits": "1", "Description": "An advanced performance course designed to develop students’ knowledge of the music and performance techniques of the gamelan, a traditional ceremonial  ensemble from Indonesia. Ensemble performs regularly. An audition with the ensemble director is required. MUSC 313 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 310 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55628", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 318", "Name": "Digital Audio Processing", "Credits": "3", "Description": "A continuation of MUSC 219, this course will guide students in exploring advanced applications of audio plug-ins for mixing and mastering through work on various projects.", "Grading": "Graded", "Course ID": "55633", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Recording Practicum I", "Prerequisite/Corequisite": "You must have completed MUSC 219 with a grade of ‘C’ or better."}, {"Course": "MUSC 319", "Name": "Advanced Topics in Music Technology", "Credits": "3", "Description": "An exploration of advanced topics in music technology. The subject matter varies from semester to semester but may include surround recording techniques, sound design, audio electronics, sound for video, and multimedia.  Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55634", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Recording Practicum II", "Prerequisite/Corequisite": "You must have completed MUSC 318 with a grade of ‘C’ or higher. "}, {"Course": "MUSC 320", "Name": "UMBC Jazz Ensemble", "Credits": "1", "Description": "This course introduces students to literature composed for jazz ensemble. Students will perform with the UMBC Jazz Ensemble at the end of the semester.  An audition with the ensemble director is required. MUSC 320 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55635", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 321", "Name": "Music History I", "Credits": "3", "Description": "This course offers an analytic study of Western music history and literature from Medieval, Renaissance and Baroque periods, with an emphasis on styles, genres and significant composers.", "Grading": "Graded", "Course ID": "55636", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed MUSC 126 with a ‘C’ or better."}, {"Course": "MUSC 322", "Name": "Music History II", "Credits": "3", "Description": "A continuation of MUSC 321 , this course offers an analytic study of Western music history and literature from the Classic and Romantic eras and the early 20th century, with an emphasis on styles, genres and significant composers. An analytic study of Western music history and literature from the Classic and Romantic eras and the early 20th century, with an emphasis on styles, genres and significant composers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55637", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed  MUSC 321 and ENGL 100  or equivalent with a C or better."}, {"Course": "MUSC 323", "Name": "Career Development for Musicians", "Credits": "3", "Description": "This practicum class examines the components of creating a successful career in the music field.  Beginning by exploring traditional careers as well as the many creative, entrepreneurial paths musicians have taken, areas to be studied include self-presentation (writing and speaking), the components of a successful press package, websites, recorded material, and resumes.  Financial support options and research methods, legal issues, and contracts will also be discussed.", "Grading": "Graded", "Course ID": "55638", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 126 with a ‘C’ or better."}, {"Course": "MUSC 324", "Name": "Small Ensemble Jazz Group", "Credits": "1", "Description": "The course introduces students to the literature composed for small jazz ensemble groups. Student will perform with their small jazz ensemble group at the end of the semester. An audition with the ensemble director is required. MUSC 324 cannot be taken concurrently with MUSC 358. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194  or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55639", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 325", "Name": "Jazz Composition", "Credits": "3", "Description": "This course covers the techniques and materials of jazz composition through the study of its masters. The course progresses from basic lead sheet composition, through extended forms to ensemble writing.  Composers studied include Thelonious Monk, Bill Evans, Kenny Wheeler, Bud Powell, Wayne Shorter, and Clare Fischer. The course culminates in performance and recording of compositions.", "Grading": "Graded", "Course ID": "55603", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 222 with a grade of ‘C’ or better."}, {"Course": "MUSC 326", "Name": "Theory V: Post-Tonal Analysis", "Credits": "3", "Description": "This course offers an analytical study of post-tonal musical styles and techniques. Some of the topics covered include pantonality, serial technique, intermedia forms, and chance music.", "Grading": "Graded", "Course ID": "055607", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 222 or MUSC 325  or MUSC 226 with a grade of ‘C’ or higher  "}, {"Course": "MUSC 328", "Name": "Music and the Mind", "Credits": "3", "Description": "In this course, we will explore major topics in the interdisciplinary field of music cognition and perception, with a focus on how people perceive, remember, enjoy, and interact with music. This course will present topics on the primary aspects of the musical experience (pitch, rhythm, meter, and timbre), the mental synthesis of these elements into meaningful musical sound, aspects of musical development in children, music and language, individual differences between musicians and nonmusicians, and studies on musical memory, expectation, and emotion. Recommended Preparation: MUSC 101  or MUSC 102 or MUSC 125 ", "Grading": "Graded", "Course ID": "102779", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "MUSC 333", "Name": "Race and Jazz", "Credits": "3", "Description": "The music known as jazz has been celebrated throughout the world. This course will examine the music itself as well as the role that race has played throughout jazz history. We will examine the music from a historical perspective through the study of the music and lives of its creators and practitioners. Students will learn to make aesthetic judgments, identify various jazz styles and discuss their relevance to their time and to the present. Recommended Preparation: MUSC 100 or MUSC 214 ", "Grading": "Graded", "Course ID": "102207", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 334", "Name": "Women in Music", "Credits": "3", "Description": "Women have been musical composers, performers, teachers, and patrons since antiquity, but their contributions are often overlooked. This course explores musical traditions from around the world and across history from the perspectives of women. We will consider women’s musical accomplishments, how they have been depicted in media, and how gender intersects with social position. The course includes cisgender and trans women from Western and non-Western musical cultures. Prior musical knowledge is not required. (Winter)", "Grading": "Graded", "Course ID": "102912", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete ENGL 100 with a grade of ‘C’ or better."}, {"Course": "MUSC 336", "Name": "The Beatles: Career, Music, Culture, Innovation, Impact", "Credits": "3", "Description": "This course offers an exploration of the music and career of the Beatles with respect to innovation in pop music and its impact on Western culture.  For students with little or no musical training in music, the Beatles’ music will be discussed in a nontechnical way that centers on music fundamentals - e.g., melody, harmony, texture, rhythm, form and instrumentation.  The course also positions the Beatles’ music and influence within the context of cultural, social, and political developments. Recommended Preparation: MUSC 100  or MUSC 101 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55645", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 338", "Name": "Survey of Jazz", "Credits": "3", "Description": "MUSC 338 Survey of Jazz provides an overview of one of the first truly American musical genres. The course traces the stylistic evolution of jazz through the study of its most influential figures. We will examine a variety of different vantage points from which to listen to, and critique, jazz. Note: Open to jazz studies majors only.", "Grading": "Graded", "Course ID": "055647", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "MUSC_JAZZ Milestone."}, {"Course": "MUSC 339", "Name": "Black American Music", "Credits": "3", "Description": "An in-depth study of the development of the music of blacks in the United States from early colonial period to the present. Particular attention will be devoted to slave songs, the evolution of the blues and jazz, and the Africanisms evident in these idioms. Recommended Preparation: AFST 245 or MUSC 215 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50028", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 345 "}, {"Course": "MUSC 358", "Name": "Music in Performance", "Credits": "3", "Description": "This course is designed for students who have been active musicians in high school.  This course couples rehearsal and performance with the study of the compositions and styles being performed, and related issues of music performance.  Each week, students rehearse with their preferred ensemble, and meet for a one-hour discussion that involves all students in the course.  An audition with the ensemble director is required.  MUSC 358 cannot be taken concurrently with MUSC 301,  MUSC 303, MUSC 304, MUSC 305, MUSC 306, MUSC 307, MUSC 308, MUSC 309, MUSC 310, MUSC 313, MUSC 320 and MUSC 324. Topics will be published in the Schedule of Classes. Recommended Preparation: MUSC 190 or MUSC 193 or MUSC 194 or prior experience playing in an ensemble.", "Grading": "Graded", "Course ID": "55651", "Consent": "Department Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a ‘C’ or better."}, {"Course": "MUSC 360", "Name": "Seminar in K-12 Choral Methods", "Credits": "3", "Description": "Seminar involves a survey of methods and repertoire for K-12 choral education.  Class involves ready, performance, discussion and analysis, as well as practicum experiences in the the schools.  Those enrolled in this course must have been accepted by the Education Department to enter Phase I of Student Teaching (20 days internship in assigned school), which must be completed concurrently with this course.", "Grading": "Graded", "Course ID": "55652", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 261 and MUSC 385 with a grade of ‘C’ or better."}, {"Course": "MUSC 361", "Name": "Seminar in K-12 Instrumental Methods", "Credits": "3", "Description": "The seminar course involves a survey of methods and repertoire for K-12 instrumental education. Class activities include reading, performance, discussion and analysis, as well as practicum experiences in the schools. Those enrolled in this course must have been accepted by the Education Department to enter Phase 1 of Student teaching (20 days internship in assigned school), which must be completed concurrently with this course.  Recommended Preparation: MUSC 182, MUSC 183, MUSC 184, MUSC 185, MUSC 186, MUSC 187, MUSC 188, MUSC 189 ", "Grading": "Graded", "Course ID": "55653", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 385 with a grade of ‘C’ or better."}, {"Course": "MUSC 362", "Name": "Arts in Education", "Credits": "3", "Description": "For advanced music majors, the course offers an introduction to theories of aesthetic education as they relate to all the arts and an in-depth exploration of those theories as they relate to music. Within the context of this practicum based course, students will learn to teach general music in an experiential manner to prepare both K-12 students and adult audience members for a deeper appreciation of the performance of music. Topics include writing effective lesson plans and planning and presenting interactive concerts as teaching artists. The course requires regular observations and presentations at a local elementary school.", "Grading": "Graded", "Course ID": "55654", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed four semesters of MUSC 190 , MUSC 193 or MUSC 194  with a grade of ‘C’ or better."}, {"Course": "MUSC 366", "Name": "Vocal Pedagogy", "Credits": "3", "Description": "Vocal Pedagogy prepares advanced vocal performance students to teach private lessons to beginning vocal students of all age ranges and abilities. Topics include: the basic physiology of the vocal mechanism, teaching strategies to guide performers to healthy and expressive singing, professional networking, observing professional instructors in video masterclasses and reflecting on best practices in the teaching of singing, and establishing and maintaining a successful private studio.", "Grading": "Graded", "Course ID": "102788", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 367", "Name": "Instrumental Pedagogy", "Credits": "3", "Description": "Instrumental Pedagogy prepares advanced instrumental performance students to teach private lessons to all age ranges and abilities. Topics include: musical development, movement, aural skills, creative musicianship, musical sensitivity, teaching differently abled students, and the pedagogy of music fundamentals. Students will learn to prepare their own students for both solo and ensemble work. The logistics of setting up and running a private studio are also covered.", "Grading": "Graded", "Course ID": "102789", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 380", "Name": "Introduction to Conducting", "Credits": "3", "Description": "Introductory course to the art of conducting. Students will learn fundamental principles of conducting and develop technical skills, including basic baton techniques, score reading and analytical skills that are essential for a conductor of any medium.", "Grading": "Graded", "Course ID": "55658", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 211 with a grade of ‘C’ or better."}, {"Course": "MUSC 385", "Name": "Intermediate Conducting", "Credits": "3", "Description": "A continuation of MUSC 380 , this course is designed to prepare students for actual ensemble conducting.  Students will study more advanced baton techniques, develop knowledge of various instruments and voices, learn to develop effective rehearsal techniques, and further their study of stylistic interpretation and voices, learn to develop effective rehearsal techniques and further their study of stylistic interpretation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55659", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 380 with a grade of ‘C’ or better."}, {"Course": "MUSC 390", "Name": "Advanced Private Lessons for Music Majors", "Credits": "3", "Description": "This is a course for advanced performance majors to take weekly private music lessons. Instruction is offered in most Western instruments and voice. The lessons direct students toward refining technique, broadening performing repertoire, and stylistic interpretive sensitivity. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 30 credits.", "Grading": "Graded", "Course ID": "55660", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Adv Perf Studies-Voice, Adv Perf Studies-Bass, Adv Perf Studies-Oboe, Adv Perf Stds - Guitar, Adv Perf Stds - Koto, Guitar, Trombone, Upright Bass, Adv Perf Stds:Westrn Art, Adv Perf Stds - Violin, Adv Perf Stds - Cello, Adv Perf Stds - Oboe, Adv Perf Stds-Saxophone, Adv Pref Stds - Sitar, Adv Perf Stds-Accordion, Bassoon, Trumpet, Percussion, Senior Project, Adv Perf Studies-Viola, Adv Perf Studies-Trumpet, Adv Perf Studies-Accordn, Adv Perf Stds - Voice, Adv Perf Stds - Flute, Flute, French Horn, Adv Perf Studies-Trombne, Adv Perf Studies-Harp, Adv Perf Studies-Sitar, Adv Perf Studies-Tabla, Adv Perf Studies-Fr Horn, Adv Perf Stds - Bassoon, Adv Perf Stds - Trumpet, Adv Perf Stds-Trombone, Adv Perf Stds - Fr Horn, Clarinet, Organ, Electric Bass, Accordian, Adv Perf Stds - Piano, Adv Perf Stds - Viola, Adv Perf Stds - Tabla, Voice, Bass, Adv Perf Stud:Westrn Art, Adv Perf Studies-Cello, Adv Perf Studies-Bassoon, Adv Perf Studies-Koto, Adv Perf Stds-Percussion, Piano, Violin, Saxophone, Harp, Accordion, Adv Perf Stud:Estrn Art, Adv Perf Studies-Piano, Adv Perf Studies-Tuba, Adv Perf Studies-Percusn, Adv Perf Stds - Bass, Adv Perf Stds - Clarinet, Adv Perf Stds - Tuba, Adv Perf Stds - Harp, Oboe, Adv.Perf.Stud:Westrn Art, Adv Perf Studies-Violin, Adv Perf Studies-Guitar, Adv Perf Studies-Flute, Adv Perf Studies-Clarint, Adv Perf Studies-Sax, Adv Perf Studies-Organ, Adv Perf Stds - Organ, Viola, Cello, Tuba, Electric Guitar, Classical Guitar, Sax Improv, Senior Recital, Jazz Trumpet, Jazz Vibraphone, Alexander Technique, Adv Perf Studies - Improvisation, Adv Perf Studies - Harpsichord", "Attributes": "Course Fee = $425.00"}, {"Course": "MUSC 391", "Name": "Advanced Private Lessons for Music Majors - Junior Recital", "Credits": "3", "Description": "This is a course for advanced performance majors to take weekly private music lessons and to prepare for their Junior Recital. Instruction is offered in most Western instruments and voice. The lessons direct students toward refining technique, broadening performing repertoire, and stylistic interpretive sensitivity.", "Grading": "Graded", "Course ID": "55661", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $425.00", "Prerequisite/Corequisite": "You must have completed MUSC 390  with a grade of ‘C’ or higher."}, {"Course": "MUSC 392", "Name": "Advanced Private Lessons for Music Majors - Senior Recital", "Credits": "3", "Description": "This is a course for advanced performance majors to take weekly private music lessons and to prepare for their Senior Recital. Instruction is offered in most Western instruments and voice. The lessons direct students toward refining technique, broadening performing repertoire, and stylistic interpretive sensitivity.", "Grading": "Graded", "Course ID": "100278", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $425.00", "Prerequisite/Corequisite": "You must have completed MUSC 391  with a grade of ‘C’ or better."}, {"Course": "MUSC 400", "Name": "Special Projects", "Credits": "1", "Description": "This is a course for students to study with a particular faculty member on a topic not covered in the regular curriculum.  The project proposal must be approved by the supervising faculty member before the student can register for the course. This course is repeatable for credit. Students may complete a maximum of 12 credits. Recommended Preparation: MUSC 191.", "Grading": "Graded", "Course ID": "55667", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "MUSC 401", "Name": "Special Projects in Composition", "Credits": "3", "Description": "For music composition majors, this course provides individual instruction in composition in preparation for the Senior Project. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "55668", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 312 with a grade of ‘C’ or higher."}, {"Course": "MUSC 416", "Name": "Analog Recording Perspectives", "Credits": "3", "Description": "This course offers instruction in the principles of analog audio production techniques for music, including the history, theory and operation of classic recording studio equipment. Basic electronic circuit theory will be discussed, and historical recordings spanning the last 100 years will be examined. Music majors only.", "Grading": "Graded", "Course ID": "100321", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 319 with a grade of ‘C’ or better."}, {"Course": "MUSC 417", "Name": "Surround Sound and Video Concepts", "Credits": "3", "Description": "This course offers advanced instruction in the principles of surround sound and video production techniques for music using Digidesign’s Pro Tools HD and Apple’s Final Cut Studio workstations. Hands-on instruction will include multiple-camera video recording of musical performances with full multi-channel audio support. Postproduction synchronization and editing of audio and video elements will be taught, and the sharing of project elements between Pro Tools and Final Cut Studio will be stressed. The history of surround sound for music will also be discussed using commercially recorded examples. ", "Grading": "Graded", "Course ID": "55671", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Surround Sound & Video Concepts", "Prerequisite/Corequisite": "You must have completed MUSC 319  with a ‘C’ or better."}, {"Course": "MUSC 418", "Name": "Music Technology Internship", "Credits": "3", "Description": "This course will acquaint students with the processes of audio production in a professional work environment. Students will work under the guidance of music technology faculty on client-based and/or research projects. The focus of the internship is on the development of ideas, working collaboratively in teams and utilizing evolving technologies. Productions vary each semester and demand different skills from interns. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "55672", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have completed MUSC 319 with a grade of ‘C’ or better."}, {"Course": "MUSC 419", "Name": "MIDI Technology in the Recording Studio", "Credits": "3", "Description": "This course explores the history and evolution of Musical Instrument Digital Interface (MIDI) systems and their applications in the professional recording studio. The history of electronic music production and various types of synthesis including FM, LA, additive, and subtractive will also be studied. Students will produce multiple MIDI projects throughout the semester, and will gain experience using various MIDI controllers, including the Avid S6.", "Grading": "Graded", "Course ID": "102660", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 318 with a grade of ‘C’ or higher."}, {"Course": "MUSC 427", "Name": "Electronic Music I", "Credits": "3", "Description": "This course offers a detailed study of the many aspects of electronic music composition.  Areas covered include MIDI applications, sampling, hard-disk recording, digital mixing, and signal processing.", "Grading": "Graded", "Course ID": "55675", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 312  or MUSC 401  both with a grade of ‘C’ or higher"}, {"Course": "MUSC 431", "Name": "Planning and Instruction in the Choral Music Classroom", "Credits": "2", "Description": "Students in this course will learn approaches to curriculum writing and unit planning in the choral classroom.Topics covered include principles of Understanding by Design-student learning outcomes (SLOs), backward planning, assessment models, and Universal Design for Learning (UDL) principles. Students will explore connecting music learning outcomes drawn from the national standards with interdisciplinary, social justice, and civic learning outcomes.", "Grading": "Graded", "Course ID": "102913", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 432", "Name": "Music Education Program Design and Management", "Credits": "1", "Description": "In this course, students will gain understanding and develop key skills needed to design and manage a music education program. Students will gain insights into administration, logistics, financial management, fundraising, advocacy, and working with different constituencies. They will learn how to design music programs in the context of the students, schools, and communities in which they work.", "Grading": "Graded", "Course ID": "102907", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 433", "Name": "Beginning Instrumental Music Methods", "Credits": "1", "Description": "In this lab-based class, students will gain a foundational understanding of teaching beginning instrumental music students. Strategies for successfully engaging instrumental students in singing, chanting, moving, creating, improvising, reading, and writing will be explored through a range of teaching and learning activities and assignments. Students will learn how to apply key principles in diverse instrumental teaching contexts while also improving their own musicianship.", "Grading": "Graded", "Course ID": "102915", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 434", "Name": "Secondary Instrumental Music Methods", "Credits": "2", "Description": "Students in this course will learn approaches to successful teaching in the secondary instrumental classroom, including connecting music learning outcomes drawn from the national standards with interdisciplinary, social justice, and civic learning outcomes. Students will gain skills in curriculum writing and unit planning in the secondary instrumental classroom using methods that reflect culturally responsive pedagogical approaches. Topics covered include principles of Understanding by Design-student learning outcomes (SLOs), backward planning, assessment models, and Universal Design for Learning (UDL) principles.", "Grading": "Graded", "Course ID": "102916", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 435", "Name": "Applications of K-12 Music Methods", "Credits": "3", "Description": "This course prepares students for a teaching career by helping them expand, synthesize, and apply their knowledge and skills within a K-12 school music program internship. This course will enable student teaching interns to: successfully plan, facilitate/instruct, and assess learning; improve their ability to reflect on and evaluate each aspect of the teaching process; articulate their teaching philosophy; and, complete a contextual analysis of a school and community.", "Grading": "Graded", "Course ID": "102917", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete MUSC 385, MUSC 432, and MUSC 431 or both MUSC 433 and MUSC 434 with a grade of ‘C’ or better."}, {"Course": "MUSC 480", "Name": "Topics in Music, Art and Society", "Credits": "3", "Description": "This course offers an intensive study and discussion of the history, theory, and social function of the various musical traditions of a particular culture and their relationship to other forms of art. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "100025", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENGL 100   or equivalent, MUSC 326 , and MUSC 322  all with a grade of ‘C’ or better."}, {"Course": "MUSC 492", "Name": "Senior Project", "Credits": "2", "Description": "This is a capstone experience course for music composition and music technology majors. These senior projects involve independent work that reflects both an integration of materials of materials studied at a lower level, and a creative application of those materials. This course is repeatable for credit. Students may complete a maximum of 4 credits or 2 attempts.", "Grading": "Graded", "Course ID": "055699", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 416 or MUSC 417 or three semesters of MUSC 401 with a grade of ‘C’ or higher."}, {"Course": "NSCI 395", "Name": "Communication for Emerging Scientists I", "Credits": "1", "Description": "This course is required for STEM BUILD Trainees. In preparation for applying to summer internships and beyond, students will perfect their personal statements developed in the Summer Bridge program, practice cover letter-writing, and improve their resumes/CVs. Students will also develop their presentation skills and be introduced to science communication platforms and techniques for connecting with the general public. This course is the first in a two-course sequence. (Fall)", "Grading": "Pass/Fail", "Course ID": "102824", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete ENGL 100 or ENGL 100Y or ENGL 100H with a grade of ‘D’ or better."}, {"Course": "NSCI 396", "Name": "Communication for Emerging Scientists II", "Credits": "1", "Description": "This course is required for STEM BUILD trainees. The first part of the course will build on content from NSCI 395, by guiding students through the application process for particular research and/or conference opportunities. This includes writing and revising short answer essay questions, tailoring the resume and personal statement for particular opportunities, requesting recommendation letters, and writing thank you notes. This course will also further develop students’ ability to share scientific research with a broad audience on a range of platforms, grow their e-portfolios, and enhance their presentation skills. (Spring)", "Grading": "Pass/Fail", "Course ID": "102880", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete NSCI 395 with a grade of ‘D’ or better."}, {"Course": "NAVY 100", "Name": "Introduction to Naval Science", "Credits": "3", "Description": "This course introduces the naval profession and concepts of sea power. Major topics explored are the mission, strategy, organization, and descriptions of the U.S. Navy and Marine Corps. Students will gain a basic understanding of warfighting capabilities, required leadership skills, training and education, and the duties and responsibilities of a Junior Officer. The student will learn Naval courtesy and customs, military justice, and nomenclature as well as the professional competencies required to become a naval officer. (Fall)", "Grading": "Graded", "Course ID": "102368", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "NAVY 101", "Name": "Sea Power and Maritime Affairs", "Credits": "3", "Description": "This course introduces the student to the key themes of naval and maritime history. Curriculum presents an analysis through lectures, reading, and student discussion of the relationship of sea power to American history. Classical concepts and contemporary employment of sea power are examined by viewing historic and current naval and maritime developments. (Spring)", "Grading": "Graded", "Course ID": "102369", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "NAVY 105", "Name": "Naval Science Leadership Lab", "Credits": "1", "Description": "This laboratory introduces the student to a variety of instructional sessions and/or activities that will develop the leadership component of the Naval ROTC program. The Naval Science leadership lab may include, but not be limited to, close-order drill, physical fitness training, ceremonial functions, Department of the Navy policy, guest lecturers, general military training (GMT), Anti-Terrorism Force Protection (ATFP), traffic safety, nutrition, stress management, prevention of sexual harassment, and operations security. This course is repeatable for credit. Students may complete a maximum of 8 credits or 8 attempts.", "Grading": "Graded", "Course ID": "102370", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "NAVY 200", "Name": "Leadership and Management", "Credits": "3", "Description": "This class is an introductory course designed to familiarize students with the theories, processes, and behaviors that enable effective leadership and managerial competence. Students will engage in analytical discussions, review leadership development and education, and Navy/Marine Corps-based case study discussions in order to develop their understanding of personal strengths, values and growth opportunities in the context of team, group and organizational leadership. Recommended Preparation: NAVY 100 and NAVY 101. (Fall)", "Grading": "Graded", "Course ID": "102371", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "NAVY 201", "Name": "Navigation", "Credits": "3", "Description": "This course introduces the student to a broad yet thorough education in basic surface ship navigation. Curriculum presents an overview of tools of the modern naval watch officer, and topics include celestial navigation, rules of the nautical road, piloting, practical chartwork, tides, instruments, publications, records, and electronic navigation systems. Instructional sessions and/or activities develop the maritime proficiency core competency of the Naval Reserve Officer Training Corps (NROTC) program. Recommended Preparation: NAVY 100 and NAVY 101. (Spring)", "Grading": "Graded", "Course ID": "102372", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "NAVY 300", "Name": "Naval Ship Systems I (Engineering)", "Credits": "3", "Description": "This course introduces the student to a comprehensive fundamental understanding of United States naval engineering principles and systems.  Topics include thermodynamics, incompressible fluid flow, electrical theory, hydraulics and pneumatics, power train components, fluid/lube oil systems, desalination, fundamentals of nuclear power, propulsion systems (internal combustion, gas turbines, and steam), electrical distribution, ship stability and control and damage control. Students will also examine case studies to apply and analyze course topics within naval ships systems contexts. (Fall)", "Grading": "Graded", "Course ID": "102373", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 151 and MATH 152 and PHYS 121 all with a C or better. You can be concurrently enrolled in PHYS 121 ."}, {"Course": "NAVY 301", "Name": "Naval Ship Systems II (Weapons)", "Credits": "3", "Description": "This course introduces the student to a comprehensive fundamental understanding of United States naval weaponry.  Includes theory and employment of weapons systems, including the processes of detection, evaluation, threat  analysis, weapon selection, delivery, guidance, and explosives. Radar and sonar systems and major weapon types, including capabilities and limitations. Facets of command, control, and communications as means of weapons system integration. Curriculum presents an in-depth review of surface, sub-surface, aviation, and Marine Corps weapons and platforms. (Spring)", "Grading": "Graded", "Course ID": "102374", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 151 and MATH 152 and  PHYS 121 all with a C or better. You can be concurrently enrolled in PHYS 121 ."}, {"Course": "NAVY 302", "Name": "Evolution of Warfare", "Credits": "3", "Description": "This course traces the development of warfare, from earliest recorded history to the present, with focus on the impact of major military theorists, strategists, tacticians, and technological developments. The student acquires an intermediate sense of strategy and develops an understanding of military alternatives and the impact of historical precedent on military thought and actions. Recommended Preparation: NAVY 100 and NAVY 101 .", "Grading": "Graded", "Course ID": "102375", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "NAVY 400", "Name": "Naval Operations and Seamanship", "Credits": "3", "Description": "NAVY 400 is a capstone course for senior Navy-option midshipmen in advanced navigation, communications, naval operations, and naval warfare. Students learn through simulation in a computer classroom known as the Maritime Skills Simulator (MSS), in addition to lectures, discussions, and qualitative and quantitative tests/examinations. Students will engage in discussions regarding the moral and ethical responsibilities or military leaders, as well as the essential attributes of character required for effective leadership. (Fall)", "Grading": "Graded", "Course ID": "102376", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete NAVY 201 with a C or better."}, {"Course": "NAVY 401", "Name": "Leadership and Ethics", "Credits": "3", "Description": "The course integrates an intellectual exploration of Western moral traditions and ethical philosophy with military leadership, core values, the Uniform Code of Military Justice, and Navy regulations. The course provides students with a basic understanding of major moral traditions - including Relativism, Utilitarianism, Kantian Ethics, Natural Law Theory, Divine Command Theory, and Virtue Ethics. (Spring)", "Grading": "Graded", "Course ID": "102377", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete NAVY 200 with a ‘C’ or better."}, {"Course": "NAVY 402", "Name": "Fundamentals of Maneuver Warfare", "Credits": "3", "Description": "Introduction to the foundational doctrinal concepts and history of the United States Marine Corps as a premier Maneuver Warfighting Organization. the class covers historical examples from the military operations as well as current doctrine, developing students’ understanding of the profession of arms and critical thinking abilities. Students will trace the evolution of maneuver warfare through analysis of case studies using maneuver doctrine as a framework. Upon completion, students will comprehend modern Maneuver Warfare employment concepts and challenges.", "Grading": "Graded", "Course ID": "102378", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete NAVY 200 or NAVY 302 with a ‘C’ or better."}, {"Course": "PHIL 100", "Name": "Introduction to Philosophy", "Credits": "3", "Description": "An introduction to fundamental philosophical concepts and methods, through the consideration of issues such as the existence and nature of God, the relationship between mind and body, personal identity, the relationship between free will and determinism, moral responsibility, the nature and possibility of knowledge, causality and the nature of reality. The course emphasizes the formulation and evaluation of philosophical arguments and may draw upon historical as well as contemporary readings.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56006", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 100H, PHIL 100Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 100H", "Name": "Introduction to Philosophy - Honors", "Credits": "3", "Description": "An introduction to fundamental philosophical concepts and methods, through the consideration of issues such as the existence and nature of God, the relationship between mind and body, personal identity, the relationship between free will and determinism, moral responsibility, the nature and possibility of knowledge, causality and the nature of reality. The course emphasizes the formulation and evaluation of philosophical arguments and may draw upon historical as well as contemporary readings.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56007", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 100, PHIL 100Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "PHIL 100Y", "Name": "Introduction to Philosophy", "Credits": "4", "Description": "An introduction to fundamental philosophical concepts and methods, through the consideration of issues such as existence and nature of God, the relationship between mind and body, personal identity, the relationship between free will and determinism, moral responsibility, the nature and possibility of knowledge, causality and the nature of reality. The course emphasizes the formulation and evaluation pf philosophical arguments and may draw upon historical as well as contemporary readings.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56008", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHIL 100, PHIL 100H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 146", "Name": "Critical Thinking", "Credits": "3", "Description": "An introduction to the basic concepts and principles of reasoning. Topics include the analysis and evaluation of the logical structure of arguments, the meaning and functions of words in arguments, and the detection of fallacious or deceptive patterns of thinking. The course is intended to develop skill in responding critically to incorrect reasoning in everyday discourse.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56010", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 150", "Name": "Contemporary Moral Issues", "Credits": "3", "Description": "An introduction to the problems and concepts of moral philosophy that focuses on current moral issues. This course introduces students to moral theories and their implications, the nature of moral reasoning and argument, and the meaning and justification of moral concepts such as obligation and rights. Topics may include free speech, abortion and euthanasia, environmental ethics, the rights of animals, and distributive and compensatory justice.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56012", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHIL 150Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 150Y", "Name": "Contemporary Moral Issues", "Credits": "4", "Description": "An introduction to the problems and concepts of moral philosophy that focuses on current moral issues. This course introduces students to moral theories and their implications, the nature of moral reasoning and argument, and the meaning and justification of moral concepts such as obligation and rights. Topics may include free speech, abortion and euthanasia, environmental ethics, the rights of animals and distributive and compensatory justice.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56014", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHIL 150 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 152", "Name": "Introduction to Ethics", "Credits": "3", "Description": "An introduction to fundamental issues in ethics, looking at classic and more recent responses to questions such as: Are there objectively right or wrong actions and better or worse ways of living? What makes them right/wrong or better/worse? How, more generally, can we justify ethical beliefs? Various responses to these questions, emphasizing personal motivations, personal character, consequences of actions, social contracts, or inviolable rules, will be explored. Criticisms and skeptical responses to traditional moral theory will also be considered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56015", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 152H, PHIL 152Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 152H", "Name": "Introduction to Ethics", "Credits": "3", "Description": "An introduction to fundamental issues in ethics, looking at classic and more recent responses to questions such as: Are there objectively right or wrong actions and better or worse ways of living? What makes them right/wrong or better/worse? How, more generally, can we justify ethical beliefs? Various responses to these questions, emphasizing personal motivations, personal character, consequences of actions, social contracts, or inviolable rules, will be explored. Criticisms and skeptical responses to traditional moral theory will also be considered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100126", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 152, PHIL 152Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "PHIL 152Y", "Name": "Introduction to Ethics", "Credits": "4", "Description": "An introduction to fundamental issues in ethics, looking at classic and more recent responses to questions such as: Are there objectively right or wrong actions and better or worse ways of living? What makes them right/wrong or better/worse? How, more generally, can we justify ethical beliefs? Various responses to these questions, emphasizing personal motivations, personal character, consequences of actions, social contracts, or inviolable rules, will be explored. Criticisms and skeptical responses to traditional moral theory will also be considered. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56016", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHIL 152, PHIL 152H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 210", "Name": "Philosophy of Religion", "Credits": "3", "Description": "A critical examination of the nature and justification of religious belief. Topics to be discussed include the existence of God, the nature of religious belief, the problem of evil, the possibility of life after death, and the relation between religion and morality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50222", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 248", "Name": "Introduction to Scientific Reasoning", "Credits": "3", "Description": "The study of scientific reasoning. Among the central issues are: deductive reasoning; inductive reasoning; the justification of inductive inferences; examples of inductive reasoning, such as statistical inferences with respect to both correlation and causal hypotheses; the nature of science and its evolution; analysis of the roles that models, predictions and evidence play in justifying scientific theories.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56019", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 251", "Name": "Ethical Issues in Science and Engineering", "Credits": "3", "Description": "This course focuses on the ethical responsibilities of engineers and information technologists. Students will analyze case studies and the content of professional codes of ethics using the tools of moral philosophy, with the goal of helping them to better understand and address morally significant problems that will arise in their careers, including: resolving tensions between competing values, taking responsibility for failure, communicating risk, and fulfilling duties to various stakeholders concerning safety and environmental impact. Note: Philosophy students may not count PHIL 251 and PHIL 252 towards the major. Credit will not be given for both PHIL 251 and ENES 251.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56021", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "PHIL 252", "Name": "Ethical Responsibility in Computer and Information Science", "Credits": "3", "Description": "The primary focus of this course will be an inquiry into the ethical responsibilities of information technologists in today’s high-tech, information-oriented society. Students will be introduced to historical and contemporary issues involving ethical and professional responsibility through extensive discussion and analysis of case studies in computer science and information systems. The key outcome of the course involves learning how to conduct an ethical analysis and then apply this analysis to a real case. Note: Credit will not be given to both PHIL 252 and either CMSC 304 or IS 304.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56023", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "PHIL 253", "Name": "Business Ethics", "Credits": "3", "Description": "This course looks closely at ethical issues that arise in the context of business practice and design. Topics to be considered include appropriate workplace conduct, pay equity, just employment practices, models of business management, and sustainable development. Analysis of cases exemplifying such issues will be conducted through the use of ethical theories built around different key aspects in our ordinary moral thinking and assessments, such as happiness, utility, duty, and virtuous character.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102619", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "PHIL 258", "Name": "Introduction to Feminist Philosophy", "Credits": "3", "Description": "Drawing on historical and contemporary sources, this course critically examines the ways in which women and women’s experiences have been ignored and explicitly and implicitly devalued in Western philosophy. It also seeks to uncover what, if anything, about the methods and central concepts of Western philosophy account for such exclusion and (apparent) contempt. More positively, we will evaluate new feminist approaches to old philosophical questions, such as: What is knowledge? What is justice?", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50133", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 258"}, {"Course": "PHIL 320", "Name": "Topics in the History of Philosophy", "Credits": "3", "Description": "A study of a major movement, theme, or figure in the history of philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56030", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Indian Philosophy, Topics In Hist Of Phil, Existentialism, Medieval Philosophy, Hist Of Ethical Theo, Medieval Philosophy, British Empiricism, Jewish Philosophy", "Prerequisite/Corequisite": "One course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 321", "Name": "History of Philosophy: Ancient", "Credits": "3", "Description": "The history of major philosophical views from the pre-Socratics through Hellenistic philosophy, with special emphasis on the early and middle dialogues of Plato and the physical, ethical and metaphysical works of Aristotle.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56032", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 321H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "One course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 321H", "Name": "History of Philosophy: Ancient", "Credits": "3", "Description": "The history of major philosophical views from the pre-Socratics through Hellenistic philosophy, with special emphasis on the early and middle dialogues of Plato and the physical, ethical and metaphysical works of Aristotle.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100018", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 321 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better before taking any 300-level PHIL course. You must also be admitted to the Honors College ."}, {"Course": "PHIL 322", "Name": "History of Philosophy: Modern", "Credits": "3", "Description": "An examination of major philosophical positions in the 17th and 18th centuries. Philosophers studied typically include Descartes, Spinoza, Locke, Leibniz, Berkeley, Hume and Kant.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56033", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 322H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "One course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 322H", "Name": "History of Philosophy: Modern (Honors)", "Credits": "3", "Description": "An examination of major philosophical positions in the 17th and 18th centuries. Philosophers studied typically include Descartes, Spinoza, Locke, Leibniz, Berkeley, Hume and Kant.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56034", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 322 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better before taking any 300-level PHIL course. You must also be admitted to the Honors College."}, {"Course": "PHIL 327", "Name": "American Pragmatism", "Credits": "3", "Description": "An examination of the origin and development of the American pragmatist movements, from their beginnings with Pierce, James and Dewey, to contemporary pragmatists such as Quine. The course compares the merits of the pragmatic method with those of rationalist and empiricist methodologies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56035", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 328", "Name": "History of Analytic Philosophy", "Credits": "3", "Description": "A study of central texts and themes in the history of analytic philosophy. Readings will be drawn from figures such as Green, McTaggert, Bradley, Frege, Russell, Wittgenstein, Austin, Ayer, Carnap, Dewey, Quine, Davidson and Rorty.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56036", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 332", "Name": "Philosophy of the Asian Martial Arts", "Credits": "3", "Description": "A critical survey of the classical philosophical literature of the Asian martial arts. The original writings of some pre-eminent Asian philosophers, sages and martial artists will be examined and discussed. Topics include the nature of philosophy in Asian culture; the conceptual relations between Confucianism, Taoism, Zen Buddhism and the philosophy of the Asian martial arts; the values and ethics of warriorship and the role the philosophy of the martial arts has played in shaping some Asian cultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56037", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 334", "Name": "Asian Philosophy", "Credits": "3", "Description": "This course will consist of a critical survey of the major philosophical and spiritual traditions of India, China and Japan. The key concepts and principles of Hinduism, Jainism, Sikhism, Confucianism, Taoism, Buddhism, Zen Buddhism and Shintoism will be examined and discussed. Topics will include the difference in emphasis and approach between the philosophical thought of East and West, the conceptual relations between the various Asian traditions and the importance of the concept of enlightenment in Asian thought. Special attention will be given to the role that Asian philosophy has played in shaping Asian culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56038", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 345", "Name": "Philosophy of Language", "Credits": "3", "Description": "A survey of philosophical issues concerning the nature of meaning, understanding, communication and language. Topics to be discussed may include the relations between meaning, intention and belief; the relationship between mental content and linguistic meaning; interpretation; the possibility of thought without language; the factual status of meaning and understanding; the nature of naming and referring; the relation between individual understanding and the physical and social environment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56067", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 346", "Name": "Deductive Logic", "Credits": "3", "Description": "An introduction to symbolized deductive logic, including the construction of formalized systems for traditional logic, the sentential calculus and first-order predicate calculus. These systems will be constructed semantically (as formalizations of deductive reasoning in natural languages) and syntactically (as uninterpreted systems).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56040", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 350", "Name": "Ethical Theory", "Credits": "3", "Description": "A critical examination of a range of major ethical theories, chosen from among virtue theories, divine command theories, utilitarian theories, contractualist theories, existentialism and Kantianism. Readings may be drawn from both historical and contemporary texts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56042", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 350H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 350H", "Name": "Ethical Theory", "Credits": "3", "Description": "A critical examination of a range of major ethical theories, chosen from among virtue theories, divine command theories, utilitarian theories, contractualist theories, existentialism and Kantianism. Readings may be drawn from both historical and contemporary texts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100353", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 350 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 353", "Name": "Morality and Psychology", "Credits": "3", "Description": "An examination of some of the central issues connecting psychological research to ethical inquiry. Topics to be covered may include: psychological egoism; the nature of moral judgment and moral motivation and their relations; the role of reasoning vs. emotional processes in moral judgments; the social and evolutionary functions of moral sentiments and concepts; how psychological research might shape our understanding of and responses to the questions about whether morality is objective and whether we can be morally responsible for our actions. Recommended Preparation: PHIL 150 or PHIL 152 or PHIL 350 or PSYC 100.", "Grading": "Graded", "Course ID": "102398", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PSYC 353 ", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 354", "Name": "Ethics, Animals, and the Environment", "Credits": "3", "Description": "A survey of central issues concerning the moral status of non-human animals and the natural world, focusing on questions concerning the obligations, if any, that humans owe to them. Topics to be discussed include: the existence and nature of animal rights; ethical issues concerning animal experimentation, zoos, and owning pets; vegetarianism; whether the environment has intrinsic or derived value; obligations concerning development of sustainable resources; climate change and obligations to future generations. Readings will be drawn from classical and contemporary sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56069", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}]