[{"Course": "THTR 223", "Name": "Vocal Training for the Actor II", "Credits": "3", "Description": "This course is restricted to BFA Acting Majors. Vocal II furthers the techniques learned in THTR 222 , with emphasis on exercises that focus on breath management, resonance, articulation and vocal dynamics. Storytelling and texts that are rich in imagery are used to increase the actor’s vocal range and responsiveness.", "Grading": "Graded", "Course ID": "57139", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " Student must complete THTR 221 and THTR 222 with a grade of ‘B’ or higher, and acceptance into BFA Acting major."}, {"Course": "THTR 229", "Name": "Movement for the Actor", "Credits": "3", "Description": "A survey of techniques and methodologies exploring the physical life of the actor. These include a broad selection of traditional and new approaches to physical training designed to promote the creativity, presence, energy and technique of the actor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57144", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 230", "Name": "Drawing for the Theatre", "Credits": "3", "Description": "This course is for students interested in learning about the basic elements of drawing as they apply to theatre design. Students will explore problems in rendering three-dimensional objects, tonal and textural values and simple perspective with emphasis on visual analysis of the relationship between form and volume.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57145", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 231", "Name": "Drafting for the Theatre", "Credits": "3", "Description": "Graphic techniques with major emphasis on theatrical drafting standards. Included are designers’ drawings, ground plans, working drawings, elevations and sections. Importance of precise communication of designers’ concepts to those constructing scenery and properties stressed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57146", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 232", "Name": "Scene Design", "Credits": "3", "Description": "Problems of design and technical theatre are studied, and the use of imagination and research are developed for various periods and styles. Techniques of rendering are discussed and applied. Students begin to design for specific plays.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57147", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 233", "Name": "Costume Design", "Credits": "3", "Description": "This course analyzes the conceptualization of character through choices in clothing. Emphasis will be placed on the costume designer’s process through organizational paperwork and creative exercises in script analysis, historical and artistic research, and drawing the human figure.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57148", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 234", "Name": "Make-up for the Stage", "Credits": "2", "Description": "The student develops techniques for creating realistic, stylized and character makeup for the stage. There is an emphasis on practical application and research. Specific projects are assigned.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57149", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 235", "Name": "Lighting Design", "Credits": "3", "Description": "A study of the aesthetics and mechanics of lighting design. An examination of the fundamental concepts involved in formulating the lighting design for a theatrical performance. Experiences in basic electricity, the instrumentation and control equipment of lighting, use of color media and the mechanical development of lighting plots required for production.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57150", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 237", "Name": "Sound Design", "Credits": "3", "Description": "A study of the aesthetics and mechanics of sound design. Experience, through lectures and projects, in using the equipment available to the sound designer/technician. Besides familiarization with the manual skills required,the projects are geared to develop an understanding of the conceptual processes of design as they apply to sound.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57151", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 239", "Name": "Movement II: Alexander Technique", "Credits": "3", "Description": "Through practical exercises and related reading, the course introduces students to the basic skills of communicating through movement, including: relaxation, coordination and alignment, and spatial relationships. All exercises are based on the principles of the Alexander Technique of movement re-education, which leads to greater poise and physical expression.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57152", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 242", "Name": "Presentations Skills for Non-Actors", "Credits": "3", "Description": "An introduction to theatre performance skills that can be applied to public presentations. Emphasis is placed on developing greater expressiveness through the study of a range of acting, voice and movement techniques. Students will make presentations in class as they explore the relationship of the speaker/performer to the listener/audience.", "Grading": "Graded", "Course ID": "57154", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 250", "Name": "Introduction to Production Techniques", "Credits": "1", "Description": "An introductory and practical study of the design, technical, or management aspects of theatre through departmental crew assignments. The course is intended to teach students the step-by-step process of how a theatre production is mounted from start to finish and to prepare them for further advanced study.", "Grading": "Graded", "Course ID": "57156", "Consent": "Department Consent Required", "Components": "Laboratory"}, {"Course": "THTR 252", "Name": "Theatre Lab", "Credits": "1", "Description": "An elective laboratory course designed to provide students with the opportunity to apply their practical crafts through contracted departmental production projects. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57157", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 254", "Name": "Technical Production", "Credits": "3", "Description": "An introduction to the basics of theatre technology and production management, including the role and responsibilities of the technical director. Topics will include the application of computer programs such as Microsoft Word, Microsoft Excel and CAD. Hands-on experience with welding and advanced carpentry also will be covered. Recommended Preparation: : THTR 100, THTR 250 and THTR 231.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57159", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 261", "Name": "Theatre Production: Running Crew", "Credits": "1", "Description": "A practical study of the backstage support needed to present a departmental production. Through various crew assignments, students will learn the step-by-step process of how a theatre production is presented.", "Grading": "Graded", "Course ID": "100557", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 100 or THTR 104 with a grade of “C” or better. May be taken concurrently with THTR 100  or THTR 104 ."}, {"Course": "THTR 262", "Name": "Theatre Production: Lighting and Sound", "Credits": "1", "Description": "A practical study of the technical aspects of lighting through departmental production crew assignments. Students will learn how a production is lit, beginning with a lighting plot and ending with the fully realized lighting design as seen on stage. ", "Grading": "Graded", "Course ID": "100558", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete THTR 100 with a “C” or better. May be taken concurrently with THTR 100. "}, {"Course": "THTR 263", "Name": "Theatre Production: Costumes", "Credits": "1", "Description": "A practical study of the technical aspects of costumes through departmental production crew assignments. Students will learn how costumes are constructed and will develop skills needed to assist those constructions. Students will learn the process of costume construction from design to finished costume worn on stage. ", "Grading": "Graded", "Course ID": "100559", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete THTR 104 with a “C” or better."}, {"Course": "THTR 264", "Name": "Theatre Production: Scenery", "Credits": "1", "Description": "A practical study of the technical aspects of stage scenery through departmental production crew assignments. Students will learn the step-by-step process of mounting a theatre production from blueprints to completed structures on stage.", "Grading": "Graded", "Course ID": "100560", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete THTR 100 with a “C” or better. May be taken concurrently with THTR 100 ."}, {"Course": "THTR 305", "Name": "Theatre Ensemble I", "Credits": "3", "Description": "Students will participate in a collaborative and creative process to devise short theater pieces inspired by a chosen theme or topic. Sources can include literature, visual art, music, current or historical events, or student biographies. Using research assignments, in-class exercise, and improvisation, students will transform source material into original performances.", "Grading": "Graded", "Course ID": "100549", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete THTR 110 or THTR 220 with a ‘C”or better."}, {"Course": "THTR 306", "Name": "Fashion, Costume, and Society", "Credits": "3", "Description": "A theoretical introduction to the artistic and aesthetic aspects of fashion. Students will examine the psychology of clothing and how styles developed through different historical periods. Fashion, mirroring societal changes, will be studied as an outcome of class struggle, politics, economics and attitudes toward the human body. Recommended Preparation: THTR 120 ", "Grading": "Graded", "Course ID": "57133", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "Student must complete ENGL 100 "}, {"Course": "THTR 310", "Name": "History of the Theatre", "Credits": "3", "Description": "Through interactive and collaborative learning, students will examine theatre’s foundational theories and practices. Historical sites from ancient theatre and ritual drama to the 19th Century box set are explored. Emphasis is placed on theatre’s physical presence, linking evolving concepts of performance space, performance practices (including performer-audience relationships), and the performance text. Recommended Preparation:  THTR 120, and THTR 344  Note: Required of all theater majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57134", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 315", "Name": "Alexander Technique for Musicians", "Credits": "3", "Description": "This course is offered to singers and instrumentalists who are interested in learning how the Alexander technique can enhance performance skills and reduce performance anxiety and tension while playing or singing. Through group activities, observation and individual work, students will learn about Alexander technique principles and how they apply to various aspects of practicing and performing. Students will gain a basic understanding of the fundamentals of anatomy and body mapping and how this information can impact their performance. Recommended Preparation: Four semesters of individual performance studies of primary instrument.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50215", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 321", "Name": "Char & Scene Study II", "Credits": "4", "Description": "", "Grading": "Graded", "Course ID": "100545", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 324", "Name": "Craft of Acting III", "Credits": "3", "Description": "For BFA Acting majors. This course focuses primarily on text through scene work. Emphasis will be given to creating believable behavior onstage, personalization, defining and playing strong, sustainable acting choices, developing a repeatable rehearsal process, and integrating skills learned in voice and movement classes. Course culminates in an end-of-semester scene presentation.", "Grading": "Graded", "Course ID": "57165", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Student must complete THTR 221 and THTR 222 with a grade of ‘B’ or higher, and acceptance into BFA Acting Major."}, {"Course": "THTR 325", "Name": "Vocal Training for the Actor III", "Credits": "3", "Description": "Emphasis is placed on the integration of the actor’s voice and body with those images, feelings and thoughts that are triggered by complex texts. Introduction to concepts and uses of the International Phonetic Alphabet (IPA). Explorations will focus on classics and non-realistic writings of modern and contemporary playwrights. Recommended Preparation:  THTR 222 and THTR 223.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57166", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 329", "Name": "Movement for the Actor III", "Credits": "3", "Description": "Development of movement skills related to the creation of specific characters, the parameters of specific genres and the demands of specific performance styles.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57167", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 330", "Name": "Scene Painting", "Credits": "3", "Description": "Various techniques for painting scenery are explored, as well as methods of transposing rendering concepts. Studies of the use of different materials to create various visual effects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57168", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 331", "Name": "Pattern Drafting", "Credits": "3", "Description": "Topics covered include creation of patterns from original garments, period pattern research and individual interpretation of source materials. Assignments develop practice in drafting, draping, fitting and altering both men’s and women’s period garments.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57169", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 332", "Name": "Advanced Scene Design", "Credits": "3", "Description": "This advanced course further studies problems of design and technical theatre through choices in environment. Student will engage in rigorous theoretical design projects in order to advance skills in script analysis, research, drawing, and design presentation. Texts studies will vary each semester but may include a combination of straight plays, musicals, and operas. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: THTR 231", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57170", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 232 with a grade of “C” or better."}, {"Course": "THTR 333", "Name": "Drawing for the Theatre II", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57171", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 335", "Name": "Advanced Lighting Design", "Credits": "3", "Description": "This advanced course further develops the aesthetic and technical skills of lighting design. Projects involve working from a script through the conceptual process to complete lighting designs for production. Students will complete complex design assignments involving work in special effects, timing, and executing lighting movement sequences. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: THTR 231", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57173", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 235  with a C or better."}, {"Course": "THTR 336", "Name": "Advanced Costume Design", "Credits": "3", "Description": "This advanced course further analyzes the conceptualization of character through choices in clothing.  Students will engage in rigorous theoretical design projects in order to advance skills in character analysis, historical research, figure drawing, and design presentation.   Texts studied will vary each semester but may include a combination of  straight plays, musicals, and operas.", "Grading": "Graded", "Course ID": "102516", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 233  with a “C” or better."}, {"Course": "THTR 337", "Name": "Advanced Sound Design", "Credits": "3", "Description": "This advanced course further develops the aesthetic and technical skills of sound design. Projects begin with text and work to completed sound designs creating mood, locational stimuli, and sound as texture. Students will study in the area of synthesized non-realistic aural stimuli, acoustics, and systems for performance. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57174", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 237  with a C or better."}, {"Course": "THTR 339", "Name": "Advanced Production Techniques", "Credits": "1", "Description": "A laboratory course designed to give advanced theatre students an opportunity to apply their studies in the design and technical aspects of theatre production. Students enrolled are expected to contribute significantly to actual productions as assistant designers, crew heads and in the coordination of major elements of the production process. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded", "Course ID": "57175", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Students must complete THTR 261 , and one of THTR 262 , THTR 263 , THTR 264 , or concurrent. Courses must be passed with a grade of ‘C’ or better."}, {"Course": "THTR 344", "Name": "Script Analysis", "Credits": "3", "Description": "The analysis of major theatrical works from various theoretical perspectives. The skills acquired build on earlier coursework and provide the analytic tools necessary to decode dramatic texts and to apply that knowledge to production. Coursework will range from literary and structural analysis to acted excerpts, design renderings and production concepts. This core course is required of all theatre majors.", "Grading": "Graded", "Course ID": "57164", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed THTR 120 with a ‘C’ or better."}, {"Course": "THTR 345", "Name": "Auditioning and the Business of Acting", "Credits": "3", "Description": "This course is intended for all those who wish to prepare themselves for careers as professional actors. The ability to audition well is a critically important skill for the performer. Students will explore and rehearse audition material; acquire the skills for cold readings; and investigate the business side of the actor’s life, including writing resumes, acquiring an agent, etc. When available, visiting professionals will contribute to course instruction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57179", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 324 with a grade of “C” or higher."}, {"Course": "THTR 346", "Name": "Theatre and Social Development", "Credits": "3", "Description": "This course will teach theatre students how to apply their artistic knowledge toward creating and developing skills in P-12 students. Course work will be at UMBC and in selected P-12 schools in the Baltimore area. UMBC students will study practices and theories incorporating theatre and social development, as they learn how to create theatrical productions in P-12 classrooms. UMBC students will then craft theatrical productions with P-12 students and evaluate their social growth. The course will also examine career options in theatre and social development.", "Grading": "Graded", "Course ID": "57180", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 347", "Name": "Character and Scene Study I", "Credits": "4", "Description": "Building a character and playing the scene. Exercises in observation, behavior patterns, diction, the psychology of character, problems of motivation, the division of action into units and objectives. Gradually, the student learns to define an action through given circumstances and develop the arc of performance in a particular setting. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57181", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 324 with a grade of C or higher."}, {"Course": "THTR 349", "Name": "Gender, Sex and Theatre Performance", "Credits": "3", "Description": "The course explores representations of both gender and sexual identity in contemporary Western theatre and performance art. Specifically, we will study how representations of gender and sexuality in performance both replicate and resist normative roles and stereotypes. The course investigates feminist and queer critiques of theatrical performance, as well as the meaning of female and queer characters in dramatic literature and their embodiment on the stage.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50110", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "GWST 349"}, {"Course": "THTR 350", "Name": "Directing I", "Credits": "4", "Description": "In this course, we examine the basic skills and techniques involved in directing for performance, including the reading and selection of scripts, casting, blocking, and working with the actors and designers. The student also is given the opportunity to select a short script and to direct it for presentation at the end of the semester. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57183", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 353", "Name": "Stage Management", "Credits": "3", "Description": "An examination of the varied responsibilities and practical techniques of the theatre stage manager. Students will learn the skills for managing a group communication dynamic, constructing a prompt book, rehearsal schedule, and the different techniques needed for pre-production, rehearsals, technical rehearsals and performances. Also included will be an exploration of the organizational structures of a theatrical production. Recommended Preparation:  THTR 100, and THTR 120, and THTR 261, and THTR 262, and THTR 263, and THTR 264 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57158", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 354", "Name": "Advanced Technical Production", "Credits": "3", "Description": "An advanced study of theatre technology and production management, including the role and responsibilities of the technical director. Topics may include theatre rigging, structural design, CAD, special effects, and advanced welding and carpentry. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "57186", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Student must complete THTR 264 with a grade of ‘C’ or higher."}, {"Course": "THTR 364", "Name": "History of American Theatre", "Credits": "3", "Description": "A history of American theatre and its drama from 1700 to the present. Writers such as O’Neill, Hellman, Williams, Miller and August Wilson will be discussed. Recommended Preparation: Three-credit theatre course, a 200-level literature course, or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57191", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 371", "Name": "Playwriting", "Credits": "3", "Description": "A creative writing course where students develop the skills essential to the discipline of dramatic writing. Special attention is given to understanding dramatic form and structure. Students learn the process of playwriting while completing several short plays and learning to effectively critique dramatic texts. This course is repeatable for credit. Students may complete a maximum of 9 credits. Recommended Preparation: Any 200-level literature course and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57195", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 380", "Name": "Performance Laboratory", "Credits": "3", "Description": "This course is designed for small-scale investigations into the nature of performance in which students uses their specific skills to act and design. Faculty will direct the formation of the projects and participate in the critical viewings of the work. This course is repeatable for credit. Students may complete a maximum of 15 credits. Recommended Preparation: All 200-level core work and permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57196", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 390", "Name": "Theatre in Production", "Credits": "3", "Description": "An advanced practical course designed to develop skills in the preparation and performance of production materials. The course will culminate with a series of public performances. This course is repeatable for credit. Students may complete a maximum of 18 credits or 6 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57198", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 400", "Name": "Theatre Studies", "Credits": "1", "Description": "Individual projects designed to suit particular interests and abilities of the student. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57199", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "THTR 405", "Name": "Theatre Ensemble II", "Credits": "3", "Description": "An advanced course in the creative and collaborative process of theatre-making. Students participate as directors, designers, writers, adapter and performers to create works in a process that allows for a deeper investigation of performance style, genres or methods. Students, in consultation with the instructor, design appropriate research activities and develop ensemble methods to create their performance pieces. This is a non-production focused course; the semester culminates in a presentation of works-in-progress. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "101874", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 305 ith a ‘C’ or better."}, {"Course": "THTR 407", "Name": "Methods of Teaching Theatre in the Secondary School", "Credits": "3", "Description": "Through a combination of research, application, and design, the course addresses the tools needed to build curricular units of study, aligned with the Maryland State Fine Arts Standards, for creating and implementing engaging theatre courses for secondary education classrooms.  The course will include experiential learning and real-world observations and will result in lesson plan and assessment development.", "Grading": "Graded", "Course ID": "102556", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EDUC 412 with a ‘C’ or better"}, {"Course": "THTR 410", "Name": "Contemporary Political Theatre", "Credits": "3", "Description": "An exploration of contemporary political theatre and drama will be considered in the context of historical events, artistic movements, and relevant philosophical and social thought - including issues of race, class and gender and post-colonialism. Special emphasis is given to Brecht and his influences of contemporary drama and theatrical performance. Recommended Preparation: THTR 202, and THTR 344 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57187", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)"}, {"Course": "THTR 411", "Name": "Modern Theatre: History and Practice", "Credits": "3", "Description": "A study of the history, theories and practices of Western theatre from the mid 19th century stage to post-Modern performance. Emphasis is placed on active learning where students practice the interpretation of dramatic literature and theatrical performance in historical context. The course explores the major writers and artistic movements of the Modern period and their influence on post-Modern performance. Recommended Preparation:  THTR 120, and THTR 344 , and THTR 310  Note: Required of all theater majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57188", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)"}, {"Course": "THTR 420", "Name": "Styles of Acting", "Credits": "3", "Description": "A consideration of the problems particular to specific styles of acting or modes of performing. The possible areas of exploration are as various as the theatre itself, but in general, the class concentrates on specific genres of theatre or on individual writers with distinct stylistic identities. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: All 300-level core acting/voice/movement courses and permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57201", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 421", "Name": "Acting Shakespeare", "Credits": "3", "Description": "A consideration of the problems and challenges inherent in acting Shakespeare’s plays. Concentration on scene study. Recommended Preparation: All 300-level core acting/voice/movement courses or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57202", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 430", "Name": "Theatre Internship", "Credits": "1", "Description": "The Theatre Department Internship provides junior and senior Theatre majors with the opportunity to apply their theatre skills in a professional theatre or arts organization. Internships are acceptable in all areas of theatre study, including dramaturgy, acting, design, stage and production management, technical theatre, directing, and arts administration. Instructor consent required. Recommended Preparation: Junior or Senior standing.", "Grading": "Pass/Fail", "Course ID": "102111", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "THTR 432", "Name": "Design Seminar", "Credits": "1", "Description": "This class is for advanced scenic, costume, lighting and sound design majors. Students develop their design skills through a series of assignments. Class discussion, critique and practical expertise are emphasized. Students may be assigned to design or assist departmental productions. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57205", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Advanced Scenic Design, Projection Design and Technology"}, {"Course": "THTR 434", "Name": "Patterning and Draping", "Credits": "3", "Description": "This course teaches students how to make patterns for theatrical costumes. Students will learn how to manipulate fabric on a three dimensional form, appreciate the importance of the grain of fabric in relation to the design, develop a sense of proportion and the placement of style lines, create basic patterns from foundation shapes, and learn the basics of fitting garments to the human form. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "100505", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 263 with a C or better."}, {"Course": "THTR 439", "Name": "Advanced Design Techniques", "Credits": "1", "Description": "A laboratory course designed to give advanced scene, costume, lighting, and sound design students an opportunity to apply their studies on departmental productions. Students enrolled are expected to contribute significantly to both the design and play production processes starting with initial concept meetings through opening night. Recommended Preparation: Completion of an Advanced Design course with a grade of “B” or better.", "Grading": "Graded", "Course ID": "102520", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 339 "}, {"Course": "THTR 452", "Name": "Theatre Lab", "Credits": "3", "Description": "A preparatory course for the Department’s Studio 3 program. This course mentors student directors, designers, and dramaturges in the academic and professional practices necessary for collaborative theatre making. At the end of the course, the production team will have a conceptual plan ready for actualization in the next semester. Recommended Preparation: Students must apply and be selected for the Studio 3 production process.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "057157", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "THTR 453", "Name": "Advanced Stage Management", "Credits": "3", "Description": "This course will be a further examination of the role of the stage manager in a variety of live performance events including but not limited to theatre, musical theatre, opera, circus, concert, etc. Special focus will be given to interacting with professional theatres and guest artists, as well as exploring the state of the industry including union rules and accessibility among various professional associations. Recommended Preparation:  THTR 353 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57185", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 460", "Name": "Theatre Capstone", "Credits": "3", "Description": "This is an advanced level course for theatre students close to graduation. The course will help students to articulate their artistic values, to recognize the range and kinds of skills they have acquired in their theatrical training, and to plan a career path in theatre or a related field. The course has two major components: (1) reading, discussing and writing about the artistic visions formulated by recognized theatre artists, and (2) a series of guest lectures by theatre professionals and by others theatrically trained, but with careers in other professions. Students will be required to write papers and make oral presentations as they define their own artistic aesthetic and plan for the future. Students will be required to compile a final presentation project based on their ideas and goals. Recommended Preparation:  At least junior status, THTR 202, and THTR 344, and THTR 310, or permission of instructor.", "Grading": "Graded", "Course ID": "100303", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 470", "Name": "Drama Seminar", "Credits": "1", "Description": "A seminar on a special topic. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57211", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 471", "Name": "Advanced Playwriting", "Credits": "3", "Description": "An advanced creative writing course where students practice dramatic structure and the process of playwriting. Students learn the craft and discipline of developing a dramatic text through the revision and completion of a full-length play. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: THTR 371 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57212", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 490", "Name": "Production Workshop", "Credits": "3", "Description": "The workshop is intended for advanced actors. Beginning with a play, participants spend the term exploring a social and historical context for the script, as well as studying the writer’s background. The research is incorporated into the rehearsal process, which culminates in a fully staged production. This course is repeatable for credit. Students may complete a maximum of 18 credits or 6 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57214", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "WOL 101", "Name": "Elementary Wolof I", "Credits": "4", "Description": "An introduction to Wolof, a major lingua franca of West Africa, through a communicative approach. Listening comprehension and basic speaking skills are emphasized, but reading and composition also will be introduced.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57332", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "WOL 102", "Name": "Elementary Wolof II", "Credits": "4", "Description": "Continuation of WOL 101. Emphasis is on extending skills in spoken Wolof within the context of real-life situations. A greater amount of reading and writing is included in this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57334", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": " You must complete WOL 101 with C or better before taking this class."}, {"Course": "WOL 201", "Name": "Intermediate Wolof I", "Credits": "4", "Description": "Further development of listening comprehension and speaking skills and increased emphasis on reading, writing and cultural knowledge. Focus on everyday life in Senegalese society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57336", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": " You must complete WOL 102 with C or better before taking this class."}, {"Course": "WOL 202", "Name": "Intermediate Wolof II", "Credits": "4", "Description": "Reading, writing and oral use of Wolof, with an emphasis on contemporary Senegalese society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57338", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": " You must complete WOL 201 with a C or better before taking this class."}]