[{"Course": "MLL 301", "Name": "Textual Analysis: Words, Images, Music", "Credits": "3", "Description": "This course introduces techniques of analytical reading and reader response that apply to a broad range of texts, including verbal, visual, musical and multi-media, such as cinematic and electronic discourse. Students interact with various forms of communication from popular and high culture by examining their structural and stylistic/aesthetic properties; the cultural assumptions and values that they convey; and the texts’ performative effects on emotions, action and thought. Emphasized are the properties of texts that make them effective, pleasing or dangerous and the social context of communication. Recommended Preparation: MLL 190, MLL 191 or another linguistics course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55447", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must completeENGL 100 or equivalent with a C or better."}, {"Course": "MLL 305", "Name": "Introduction to Intercultural Communication", "Credits": "3", "Description": "This interdisciplinary course introduces students to the basic issues of intercultural communication and acquaints them with the fundamentals of intercultural training. Drawing on linguistic theory, anthropological definitions of culture and ethnicity, and extensive case studies, the course begins with a discussion of the nature and function of verbal and nonverbal communication in multicultural settings. The second part of the course examines the ways in which conflicts may arise between cultures and explores the development of intercultural competence and the resolution of cultural conflicts via intercultural training. Recommended Preparation: Junior standing or prior study in anthropology, linguistics or a related discipline", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55449", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MLL 305H ", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 306", "Name": "Intercultural Communication: Issues Confronting Immigrant and Heritage Communities", "Credits": "4", "Description": "Immigration and social adjustment to a new environment could be analyzed from different theoretical perspectives. By doing service learning, students will learn to combine the analysis of immigration and the perspective of intercultural communication. Difficulties in the process of adjustment faced by new immigrants and other members of local heritage communities in the Maryland/D.C. region will allow students to explore ways in which the development of intercultural competence can help resolve cultural conflicts in a multicultural society. Guest speakers from local immigrant/heritage communities will be invited to participate in the seminars. The course will entail spending three hours per week in immigrant/heritage communities doing service learning related to intercultural communication. Recommended Preparation: A language course above the 201 level, or MLL 305, or permission", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55451", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 310", "Name": "Intercultural Studies of International Film", "Credits": "3", "Description": "Major international cinematic trends from the earliest periods to the contemporary era. Emphasis on the feature film in the context of national cinemas and intercultural communication. Taught in English. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55452", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 311", "Name": "Introduction to Korean Culture", "Credits": "3", "Description": "This course introduces students to Korean culture. It will help students understand the values, attitudes and norms that constitute Korean culture and lead students to get the feel of the dynamic vitality of Korean culture. The course will broaden their understanding of culture in general, and Korean culture in particular. Taught in English. Knowledge of Korean is not required. Recommended Preparation: MLL 190, MLL 191, MLL 230, or MLL 301 .", "Grading": "Graded", "Course ID": "100432", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "MLL 313", "Name": "Images of Society in Contemporary Spanish Films", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55455", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 315", "Name": "Images of Society in Contemporary Korean Films", "Credits": "3", "Description": "Study of major works of Korean cinema, encompassing a range of genres and styles. Emphasis on the film as an art form and a mirror of society. Taught in English. No knowledge of Korean required. Recommended Preparation: MLL 190, MLL 191, MLL 230, or MLL 301.", "Grading": "Graded", "Course ID": "100433", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "MLL 316", "Name": "Japanese Language in Society", "Credits": "3", "Description": "In this course, students learn how the Japanese language is used and how it relates to the culture in society by analyzing characteristics of the language, its use in society, and similarities and differences in usage between English and Japanese. Course topics include language and its reflection in culture, nonverbal communication/gesture, the Japanese writing system, discriminatory language, onomatopoeia, language and technology, and intercultural communication. Because this course is based on class/small group discussions, students are required to prepare the reading materials for each class. Knowledge of Japanese is not required.   Recommended Preparation: ASIA 100  or any 100- or 200-level GEP Culture course.", "Grading": "Graded", "Course ID": "102672", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 317", "Name": "Images of Society in Contemporary Japanese Films", "Credits": "3", "Description": "This course examines various contemporary Japanese films by focusing on the relationship between the films and Japanese culture and society. It includes diverse genres and styles to enhance students’ critical thinking skills. Taught in English. No Knowledge of Japanese required. Recommended Preparation: MLL 190 ,MLL 191 , MLL 230 , or MLL 301 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55434", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 319", "Name": "Images of Society in Contemporary French Films", "Credits": "3", "Description": "An examination of outstanding films from the Francophone world, encompassing a range of genres and styles and reflecting the diversity of French film production. Emphasis on the film as an art form and a mirror of society. Taught in English. No knowledge of French required. Recommended Preparation: Junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55457", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 320", "Name": "International Feminist Filmmakers", "Credits": "3", "Description": "This course uses a feminist film studies lens to analyze transnational documentary and feature films. Drawing on feminist, documentary, and postcolonial film theory, students will gain the necessary skills to critically analyze representations of gender, race, class, nationality, and sexuality in transnational film. We will examine the politics of gender in films produced in the West and the Global South and we will assess the flows between “first world” and “third world” cinematic traditions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50105", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Same as Offered": "GWST 320 "}, {"Course": "MLL 321", "Name": "Jewish Writing in World Literature", "Credits": "3", "Description": "This course will study the development of modern Jewish writing from its beginnings in the Yiddish works of Eastern Europe through its diasporic extension into Western Europe, North Africa, Latin America, North America and Israel. Special attention will be given to the analysis of Jewish humor, in literature as well as other cultural forms, from the novels of Sholom Aleichem to the films of Woody Allen. Jewish literary responses to the Holocaust also will be discussed. The course will emphasize the cross-cultural nature of Jewish diasporic writing in its attachment both to common Jewish traditions and to diverse national, historical, geographical and linguistic contexts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50179", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "JDST 321"}, {"Course": "MLL 322", "Name": "Gender, Race, and Media", "Credits": "3", "Description": "In this course, we define media and analyze intersecting formations of gender, race, class, and sexuality, as produced through a range of media genres and forms. These include, but are not limited to, advertisements and commercials, television and film, music and music videos, visual arts, and digital visual cultures. We interrogate media as powerful, pervasive sites where dynamic relations between dominant representations and resistant subject formations are staged. As consumers and producers of media, we learn to articulate the entanglement of social justice concerns, politics, and cultural and economic resources. We practice tools of critical reading and thinking, such as textual analysis, visual discourse analysis, and the basics of media literacy. Recommended Preparation: GWST 100 and (GWST 200 or GWST 210).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50004", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 347, GWST 322 "}, {"Course": "MLL 323", "Name": "Modern Hebrew Literature", "Credits": "3", "Description": "A survey of various forms of Hebrew literature in English translation from throughout the world since the 19th century. In addition, modern Hebrew literature is compared to, and contrasted with, pre-modern Hebrew literature and Yiddish literature. Recommended Preparation: An English or world literature course in any language at the 200 level or above or permission from the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50178", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "JDST 323 "}, {"Course": "MLL 324", "Name": "World Language Issues", "Credits": "3", "Description": "The course examines the consequences of socio-linguistic heterogeneity in multi-cultural societies through an examination of topics such as the parameters of language variation; the relationship between indigenous, colonial and immigrant languages; language attitudes; and language planning. Students will use these concepts to work toward the resolution of language-based conflicts in a required written research project. Students may register for either MLL 230 or MLL 324. Recommended Preparation: Junior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55459", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 325", "Name": "Ethnic Minorities", "Credits": "3", "Description": "An introduction to language minority groups in the United States and the factors that have helped shape our linguistic environment. The class studies many related issues, such as ethnicity, immigration, settlement patterns, language maintenance efforts and language policies in government and education.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55460", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 326", "Name": "Literature and Social Change", "Credits": "3", "Description": "A study of social problems and different visions of social change reflected in the literature of various nationalities and groups. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55461", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "MLL 327", "Name": "Modern Japanese Culture", "Credits": "3", "Description": "This course examines modern Japanese culture, including family structure, daily life, regional variations, interpersonal and intercultural communication, education from nursery school to college, the traditional arts still practiced in modern Japan and the development of popular youth culture. Students will deepen their understanding through cross-cultural role playing, hands-on experience with the arts and field trips. The course is taught in English. Recommended Preparation: Junior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55462", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 328", "Name": "Traditional Chinese Fiction and Drama", "Credits": "3", "Description": "A survey of representative Chinese short stories, novels and plays from the third to the 19th centuries. Focus is placed on the study of T’ang, Sung, Ming dynasty novels and Yuan dynasty drama. The course is taught in English. No knowledge of Chinese required. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55463", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "MLL 329", "Name": "Early and Medieval Chinese Literature", "Credits": "3", "Description": "This course is an introduction to important works of the classical literary tradition of China from the Zhou Dynasty (1045-221 BCE) through the Northern Song dynasty (976-1127 CE). In a chronological survey of the important writers of the early and medieval periods, the course tackles some fundamental questions of the Chinese literary tradition, including the meanings of the word that came to mean literary writing, wen, and the place of wen in traditional Chinese culture; which genres of writing became the most prominent in the early tradition, and why; and the ways in which the scope of Chinese literature broaden and changed. The course is taught in English, with no knowledge of Chinese language required. Recommended Preparation: MLL 301  or ASIA 100 or HIST 103 (any one of these three)", "Grading": "Graded", "Course ID": "101848", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MLL 301 or ASIA 100 or HIST 103 "}, {"Course": "MLL 330", "Name": "Theatre in Modern Languages", "Credits": "3", "Description": "The rehearsal and performance in modern languages of a full-length play (or several shorter works). Students participate as actors and/or assist in tasks of production. They also investigate areas pertinent to the play, such as the life and work of the playwright, historical and cultural milieu depicted, and theories and techniques of staging. This course is repeatable for credit. Recommended Preparation: A language course at the 202-level or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55464", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 332", "Name": "Topics in German Culture", "Credits": "3", "Description": "This course will focus on a broad spectrum of topics (events, movements, and individual thinkers) that have shaped German intellectual thought throughout Germany’s history. Students will be introduced to concepts that have had a lasting impact and are essential for a true understanding of German culture. Readings and discussion in English. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "55465", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Topics In German Culture, Frankfurt School, Heimat In Germ Culture, Cult Thought 18Th/19Th, Contemporary Film and Society in Germany, Multicultural Germany, German Culture through Film", "Attributes": "Culture (GFR)", "Prerequisite/Corequisite": "Your academic level must be junior to enroll."}, {"Course": "MLL 333", "Name": "Japanese Food Culture", "Credits": "3", "Description": "This course examines many aspects of Japanese food culture, including history, cultural rules, special/religious events, environment, globalization, etc. The students will investigate how Japanese food illustrates the society and culture by critically analyzing various forms of food related texts. Throughout the semester the students will explore their own food cultures then compare and contrast them to Japanese food culture to hypothesize reasons for the similarities/differences among them. Recommended Preparation: ASIA 100 or any 100, 200 level culture course.", "Grading": "Graded/Pass Fail", "Course ID": "102068", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 334", "Name": "Modern Chinese Poetry and Lyric Culture", "Credits": "3", "Description": "From the New Culture Movement to WWII, from literary journals to rock concerts, from self-expression to social engagement, poetry has played an integral role in remaking modern Chinese life. In this course, you will analyze the works of poets, musicians, and revolutionaries who shaped modern Chinese culture and history. You will also learn about modern Chinese lyric culture as it evolved in China, Taiwan, and Hong Kong and its relationship with national and regional identities. Recommended Preparation: MLL 190 or MLL 191 or MLL 230 or MLL 301 ", "Grading": "Graded", "Course ID": "102478", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "MLL 335", "Name": "Modern China: Culture, Society, and Environment", "Credits": "3", "Description": "In this course, you will learn about how modernization and industrialization transformed the Chinese civilization in the 20th and 21st centuries. Through a variety of materials such as literary and historical narratives, films, newspaper articles, and scholarly essays, you will study the interplay between modern Chinese culture, society, and environment. This course is designed for students with little or no background in Chinese language and culture. Recommended Preparation: MLL 190, MLL 191, MLL 230, or MLL 301 ", "Grading": "Graded", "Course ID": "102869", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "MLL 340", "Name": "Interconnections: Social and Historical Confluences", "Credits": "3", "Description": "This course treats key historical events and social movements in France and French-speaking lands and their connections with the rest of the world. These include: exploration in the New World, the Great Revolution of 1789, nationalism, the Napoleonic legacy, socialism and communism, the World Wars, imperialism and decolonization. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50099", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "MLL 341", "Name": "Studies in World Literature", "Credits": "3", "Description": "A study of selected literary works from a single nation or from several nations, with the focus on a century, movement, genre, theme or individual writer. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50043", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 341, ENGL 315 "}, {"Course": "MLL 342", "Name": "Myth and Literature", "Credits": "3", "Description": "Studies in the mythologies of various cultures and in the relationship between myth and literature. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50058", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Myth And Literature, Honors Myth & Literature", "Same as Offered": "CPLT 342, ENGL 318 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better"}, {"Course": "MLL 344", "Name": "Literature and the Other Arts", "Credits": "3", "Description": "A study of the relationship between literature and music, film and the fine arts, with an emphasis on common concerns, solutions and terminology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50052", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Languages Of Film, Life And Films Of Welles, Attack Of The B-Movies, Women In Media, Amer Film In The 1970’s, Culture And Values, Film Noir, Film Adaptation, Fiction And Film, Cult Films, Mediated Movies, Films:Hitchcock & Lang, Nvls & Plitcs/Vctrn Engl, Introduction To Film, Banned Films, The Avant-Garde at the Movies, Biblical Art and Literature in the English Renaiss, Horror Film and Fiction", "Same as Offered": "CPLT 344, ENGL 316 "}, {"Course": "MLL 360", "Name": "Topics in Russian Culture", "Credits": "3", "Description": "This course will focus on a broad range of topics (events, movements, literary and cultural achievements) that have helped shape Russian intellectual thought throughout the country’s history. Students will be introduced to concepts that have had a lasting impact and are essential for a proper understanding of Russian culture. Readings and discussion in English. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits. Recommended Preparation: MLL 301 and/or a Russian language course", "Grading": "Graded", "Course ID": "102871", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 370", "Name": "19th Century Russian Literature and Society", "Credits": "3", "Description": "A study of Russian literature of the 19th century in relation to the intellectual, political and social concerns of the time. Authors include Pushkin, Gogol, Dostoevsky, Tolstoy, Turgenev and Chekhov. Topics for discussion include class and rank, the role of women, the intelligentsia, socialism and religion, as well as the evolution of literary style. Readings and discussion in English, although students may choose to read works in the original Russian. Recommended Preparation: ENGL 100  and either a 200-level literature course or a Russian language course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50187", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Writing Intensive (WI), Culture (GFR)"}, {"Course": "MLL 371", "Name": "20th Century Russian Literature and Politics", "Credits": "3", "Description": "A study of the interaction of literature and politics in the Soviet Union, from the October revolution through Socialist realism, to dissident literature and glasnost. Authors include Blok, Zamiatin, Babel, Sholokhov, Bulgakov, Pasternak, Solzhenitsyn and Brodsky. Subjects for discussion include the place of the individual in a collective society, the role of the artist in a totalitarian state, propaganda, the manipulation of art for social control, and the power of literature to effect social and political change. Readings and discussion in English, although students may choose to read works in the original Russian.  Recommended Preparation: ENGL 100 and either a 200-level literature course or a Russian language course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50203", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Writing Intensive (WI), Culture (GFR)"}, {"Course": "MLL 399H", "Name": "Introduction to Honors Project", "Credits": "1", "Description": "An independent study course focused on the systematic development of a topic and methodology for the honors thesis. Open to students who have been admitted to the MLL Honors Program.", "Grading": "Pass/Fail", "Course ID": "55469", "Consent": "Department Consent Required", "Components": "Independent Study", "Topics": "Intro To Honors"}, {"Course": "MLL 400", "Name": "Special Projects in Modern Languages and Linguistics", "Credits": "1", "Description": "Open to students with special projects on application to the instructor who will supervise the particular project. Request for permission to register must be in writing and must specify the number of credits sought. This course is repeatable for credit. Note: Credits earned in MLL 400 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of language studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLL.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55470", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "MLL 406", "Name": "Theory and History of Intercultural Media", "Credits": "3", "Description": "This course traces the historical and stylistic evolution of documentary and other film genres, including ethnographic and feature films, while exploring the use of these as a conduit for intercultural communication. Students will view intercultural film and video projects of the invited filmmakers. Reading selected texts will help inform the discussion and analysis of what constitutes the genre “intercultural film”.  Recommended Preparation: MCS 334  or MCS 390 ", "Grading": "Graded", "Course ID": "55473", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MCS 406 "}, {"Course": "MLL 410", "Name": "I’m a Cyborg But That’s OK", "Credits": "3", "Description": "This class uses the figure of the cyborg to interrogate the ways in which cultured identity is constructed through media the role of technology in defining humanness in an increasingly digital world. It focuses on the processes of globalization and the connections between local and global contexts of struggle inform lived experiences of identity, including race, gender, sexuality, class and ability. Recommended Preparation: GLBL 100  or MLL 230 ", "Grading": "Graded", "Course ID": "102804", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GLBL 410 "}, {"Course": "MLL 413", "Name": "Language, Gender & Culture", "Credits": "3", "Description": "In Language, Gender and Sexuality, students gain an in-depth understanding of how language, gender, and sexuality are integrated into the fabric of cultures and societies and how sociocultural contexts give meaning to linguistic practices, to categories of gender and sexuality, and to the construction of gendered, sexual, and other identities. Students will examine and evaluate a diverse body of scholarship from linguistics, anthropology, gender and sexuality studies, and sociology. Critical attention will be paid to understanding the roles of language, gender and sexuality in the U.S. context, especially with regard to education and the media; we will also explore relationships between language, gender, and sexuality in the range of other Western and non-Western cultures. Students will apply what they have learned in the course to final research projects.", "Grading": "Graded", "Course ID": "100279", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 413 , GWST 613, LLC 613, MLL 613"}, {"Course": "MLL 424", "Name": "Introduction to Cross Cultural Competency in the Middle East & North Africa (MENA)", "Credits": "3", "Description": "This course examines main concepts in cross-cultural studies in the Middle East and North Africa (MENA) regions. The course aims to develop students’ critical thinking and promote their cross-cultural competency and awareness. Students will explore the concept of culture and common approaches from the field of cross-cultural communication. The course highlights the key concepts of language (verbal / nonverbal) and culture, social and cultural identity. It also addresses various topics such as barriers in intercultural communication, dimensions of culture, multiculturalism, and culture’s influence on perception. This course places heavy emphasis on case studies and experiential learning. Recommended Preparation: MLL 191 or MLL 305.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102728", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 425", "Name": "Intercultural and Cross-Cultural Communication", "Credits": "3", "Description": "The purpose of this course is to study communication within the context of the cultural setting. Three main goals are: to provide students with material, both cognitive and experiential, with which they can develop an awareness of their own cultural identity; to increase their knowledge of the special communication problems to be expected in a cross-cultural situation; and to offer students the opportunity to apply new insights to cross-cultural encounters.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55474", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MLL 190 or MLL 191 or MLL 230 with a grade of C or better."}, {"Course": "MLL 430", "Name": "Internship in Modern Languages and Linguistics", "Credits": "1", "Description": "An internship is a defined project using the target language in work involving governmental or non-governmental agencies, social service organizations, hospitals, schools, businesses or other community institutions. This course is repeatable for credit. Students may complete a maximum of 3 credits. Note: Request for permission to register must be in writing and must specify the number of credits sought.", "Grading": "Pass/Fail", "Course ID": "55475", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 460", "Name": "Global Stories", "Credits": "3", "Description": "This is an interdisciplinary course that provides an introduction to community-engaged research through digital storytelling.  It explores the main concepts and methods of creating and analyzing global stories, mainly through audiovisual production. Students work on the connections between local and global contexts of production and consumption of ethnographies. Recommended Preparation: GLBL 100, GLBL 300, MLL 305", "Grading": "Graded", "Course ID": "102865", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GLBL 460 "}, {"Course": "MLL 470", "Name": "L2 Acquisition and Learning: Theory to Practice", "Credits": "3", "Description": "This course examines issues in second-language acquisition and learning from the perspective of teaching and learning in ESOL and foreign-language classrooms. Topics covered include a review of past and current learning theories, an exploration of the range of factors (physiological, cognitive, affective, environmental) affecting first and second-language acquisition, the role of input and output in second-language development, the role of learning styles and strategies in language learning, and language processing in reading and listening. These topics will be explored through readings, class discussions, and various individual and collaborative projects and assignments.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55476", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MLL 480", "Name": "Transcultural Studies in Global Television", "Credits": "3", "Description": "This course will study the concepts, institutions, distribution channels, production and marketing practices, products and audience reception of globally distributed television programming. Special emphasis will be placed on localization strategies, aesthetic conventions and genre traditions, notions of cultural proximity, and debates around hybridity and transculturality. Students enrolled in MLL 480 will be expected to have advanced foreign language proficiency and will be expected to examine foreign language television productions and discuss issues in the secondary literature in that language. Recommended Preparation:  MCS 333 ", "Grading": "Graded", "Course ID": "100677", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "MCS 390 ", "Prerequisite/Corequisite": "You must have completed MCS 222 with a C or better."}, {"Course": "MLL 490", "Name": "Seminar in Modern Languages and Linguistics", "Credits": "3", "Description": "A study of a specific topic involving language, literature or culture, and/or their interrelations. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55477", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 495", "Name": "Video Ethnography", "Credits": "3", "Description": "This course uses video production as a method of exploring the social world. Students will work closely with community members in Baltimore as collaborators in telling their stories as they create short documentaries that amplify community voices. Emphasis is placed on reflective and participatory documentary methods and the use of video as a qualitative research tool. Students will gain experience in video field production techniques including video cameras and DSLR operation, lighting, sound and post-production.  ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55478", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MCS 495 "}, {"Course": "MLL 498H", "Name": "Senior Honors Seminar", "Credits": "3", "Description": "An interdisciplinary seminar that allows Honor Program students to work together at a high level on a topic that they have helped to define. Open to students who have been admitted to the MLL Honors Program.", "Grading": "Graded", "Course ID": "55479", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MLL 499H", "Name": "Senior Honors Project", "Credits": "3", "Description": "An independent study course that involves the production of an honors thesis. Enables honors students to pursue work that has a special meaning for them and provides them with valuable experience in planning and executing a large-scale research project.", "Grading": "Graded", "Course ID": "55480", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "MUSC 100", "Name": "Introduction to Music", "Credits": "3", "Description": "A study of what music is, with special reference to the relationship between music and listener. For students with little or no formal training in music, this course explores, in a nontechnical way, the elements of music (e.g., rhythm, melody, harmony, texture and form) and discusses the various cultural contexts in which music is found and how these affect the nature of the music and the listener’s perception.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55548", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 101", "Name": "Fundamentals of Music Theory", "Credits": "3", "Description": "A study of the fundamentals of music theory, including notation, scale construction, intervals, chords, meter, etc., with emphasis on learning and developing music reading skills. Note: Students planning to continue with more advanced musical studies or students who have some prior studies on music fundamentals should enroll in MUSC 102 Advanced Music Fundamentals instead.", "Grading": "Graded", "Course ID": "55550", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 102", "Name": "Advanced Music Fundamentals", "Credits": "3", "Description": "This course provides an intensive review on music fundamentals, including scales, intervals, chords, meters, cadences, and melody harmonization. Students enrolling in this course should have some prior studies on music fundamentals and be able to read basic music notations. In this course, students will acquire the music fundamentals fluency required for more advanced musical studies.", "Grading": "Graded", "Course ID": "102778", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "MUSC 110", "Name": "Musicianship Laboratory I", "Credits": "1", "Description": "This course is designed to develop elementary musical skills for music majors.  Topics include sight-singing, notation, and dictation. ", "Grading": "Graded", "Course ID": "55552", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 111", "Name": "Musicianship Laboratory II", "Credits": "1", "Description": "A continuation of MUSC 110 , this course is designed to develop intermediate musical skills for music majors.  Topics include sight-singing, notation, dictation, and transposition.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55553", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 110 with a grade of ‘C’ or better."}, {"Course": "MUSC 112", "Name": "Music Repertoire", "Credits": "1", "Description": "This is a class for music majors to explore repertoire for their specific instrument or voice.  Class involves regular performance opportunities and discussions about repertoire, techniques and stylistic issues. This course is repeatable for credit. Students may complete a maximum of 10 credits.", "Grading": "Graded", "Course ID": "55554", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 115", "Name": "Jazz Improvisation and Theory Workshop I", "Credits": "3", "Description": "A course to help the student develop jazz improvisational skills in a performance/workshop setting. The course also provides the student with the theoretical underpinnings of jazz. Some of the topics and styles covered: chord scales, blues, bebop, swing, modal improvisation, The New Thing, block chord harmonization, song forms and reharmonization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55556", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 116", "Name": "Jazz Improvisation and Theory Workshop II", "Credits": "3", "Description": "A continuation of MUSC 115. A course to help the student develop jazz improvisational skills in a performance/workshop setting. The course also provides the student with the theoretical underpinnings of jazz. Some of the topics and styles covered: chord scales, blues, bebop, swing, modal improvisation, The New Thing, block chord harmonization, song forms, and reharmonization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55557", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 115  with a grade of ‘C’ or better."}, {"Course": "MUSC 122", "Name": "Gospel Choir", "Credits": "1", "Description": "This class affords students instruction in sacred music from the African American heritage. The course will provide an introduction to and study of a variety of musical styles including traditional and contemporary gospel, spirituals, and hymns. Vocal technique is part of the class structure and some vocal instruction will be given. Basic music reading will be taught as well. The ability to read music is not required but is highly recommended. This course is repeatable for credit. Students may complete a maximum of 10 credits. Recommended Preparation: MUSC 170, MUSC 171, and/or MUSC 173.", "Grading": "Graded", "Course ID": "102816", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 125", "Name": "Theory I: Basics of Music", "Credits": "3", "Description": "This course is designed to introduce the fundamentals of music, with intensive consideration of underlying principles of music such as melodic design, tonality, harmonic organization, and elements of formal design.", "Grading": "Graded", "Course ID": "55559", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 126", "Name": "Theory II: Form and Analysis", "Credits": "3", "Description": "A continuation of MUSC 125 , this course is designed to introduce the fundamentals of music, with intensive consideration of underlying principles of music such as melodic design, tonality, harmonic organization, and elements of formal design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55560", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed MUSC 125 with a grade of ‘C’ or better."}, {"Course": "MUSC 140", "Name": "Teaching Elementary School Choral Singing", "Credits": "1", "Description": "This course provides an introduction to choral teaching for elementary school aged children. Students will learn culturally relevant approaches to building music literacy skills through performing, responding, creating, and connecting in the choral classroom. Students gain foundational skills in integrating musical, social-emotional, and social justice learning goals in developmentally appropriate choral lessons for elementary school students. Students will enroll in PRAC 096 and participate in a school-based service learning practicum.", "Grading": "Graded", "Course ID": "102908", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 141", "Name": "Teaching Middle School Choral Singing", "Credits": "1", "Description": "This course provides an introduction to choral teaching for middle school aged youth. Students will learn culturally relevant approaches to building music literacy skills through performing, responding, creating, and connecting in the choral classroom. Students gain foundational skills in integrating musical, social-emotional, and social justice learning goals in developmentally appropriate choral lessons for middle school students. Students will enroll in PRAC 096 and participate in a school-based service learning practicum.", "Grading": "Graded", "Course ID": "102909", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 142", "Name": "Teaching High School Choral Singing", "Credits": "1", "Description": "This course provides an introduction to choral teaching for high school aged youth. Students will learn culturally relevant approaches to building music literacy skills through performing, responding, creating, and connecting in the choral classroom. Students gain foundational skills in integrating musical, social-emotional, and social justice learning goals in developmentally appropriate choral lessons for high school students. Students will enroll in PRAC 096 and participate in a school-based service learning practicum.", "Grading": "Graded", "Course ID": "102910", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 143", "Name": "Popular Music Pedagogy", "Credits": "1", "Description": "This course introduces the methods of popular music pedagogy through experiential learning with modern band instruments, including guitar, electric bass, keyboard, drums, and vocals. Students explore learner-centered approaches in which the teacher works as facilitator to support K-12 students’ agency and autonomy in shaping their own learning. Students learn how to integrate culturally relevant pedagogical approaches with social-emotional learning goals. Recommended Preparation: MUSC 125 ", "Grading": "Graded", "Course ID": "102911", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 161", "Name": "Diction: International phonetic alphabet/English/Italian", "Credits": "1", "Description": "A course designed to introduce singers to pronunciation and use of the languages most often encountered in vocal repertoire, while providing an overview of representative repertoire and its development. ", "Grading": "Graded", "Course ID": "100310", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 162", "Name": "Diction: French", "Credits": "1", "Description": "A course designed to introduce singers to pronunciation and use of the languages most often encountered in vocal repertoire, while providing an overview of representative repertoire and its development. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100311", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 161  with a grade of ‘C’ or higher."}, {"Course": "MUSC 163", "Name": "Diction: German", "Credits": "1", "Description": "A course designed to introduce singers to pronunciation and use of the languages most often encountered in vocal repertoire, while providing an overview of representative repertoire and its development. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100277", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 161  with a grade of ‘C’ or higher."}, {"Course": "MUSC 170", "Name": "Beginning Voice Class", "Credits": "1", "Description": "Beginning instruction in vocal techniques.", "Grading": "Graded", "Course ID": "55562", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 171", "Name": "Intermediate Voice Class", "Credits": "1", "Description": "A continuation of MUSC 170 , this course offers intermediate instruction in vocal techniques.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55563", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 170  with a grade of ‘C’ or higher."}, {"Course": "MUSC 173", "Name": "Introduction to Choral Singing", "Credits": "2", "Description": "This course offers an introduction to basic sight-singing skills.  Students will develop an understanding of how to read choral music and they will learn rudimentary musicianship skills, including melodic notation and its application to the keyboard.  Traditional hymns will be used to develop this skill.  The skills developed in this course will enhance the opportunity to participate in the UMBC choral ensembles in the music department. to participate in the UMBC choral ensembles in the music department.", "Grading": "Graded", "Course ID": "55565", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 174", "Name": "Beginning Vocal Methods", "Credits": "1", "Description": "This course provides an inquiry into effective vocal pedagogy for intended music educators when teaching beginning singers.  It also provides opportunities for observing beginning voice classes, instruction in appropriate teaching methodologies for this population, and practicum experiences.", "Grading": "Graded", "Course ID": "55566", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 175", "Name": "Intermediate Vocal Methods", "Credits": "1", "Description": "This course provides an inquiry into effective vocal pedagogy when teaching intermediate singers. Designed for intended music educators, the course provides opportunities for observing intermediate voice classes, instruction in appropriate teaching methodologies for this population, and practicum experiences.", "Grading": "Graded", "Course ID": "55567", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 174 with a grade of ‘C’ or better."}, {"Course": "MUSC 176", "Name": "Keyboard Skills I", "Credits": "1", "Description": "This course is designed to enable students to achieve the level of proficiency in keyboard skills required for the major and to complement their studies in music theory.  Topics covered include harmonization, sightreading, technique, and functional keyboard harmony.", "Grading": "Graded", "Course ID": "100308", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "MUSC 177", "Name": "Keyboard Skills II", "Credits": "1", "Description": "A continuation of MUSC 176 , this course is designed to enable students to achieve the level of proficiency in keyboard skills required for the major and to complement their studies in music theory.  Topics covered include harmonization, sightreading, techniques, and functional keyboard harmony.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100309", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 176 with a grade of ‘C’ or better."}, {"Course": "MUSC 178", "Name": "Keyboard Skills III", "Credits": "1", "Description": "A continuation of MUSC 177 , this course is designed to enable students to achieve the level of proficiency in keyboard skills and to complement the student’s studies in music theory. Topics covered include harmonization, sightreading technique, solo performing, transposition, improvisation and functional keyboard harmony.  Good knowledge of music theory needed. ", "Grading": "Graded", "Course ID": "55568", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Level 1, Level 2", "Prerequisite/Corequisite": "You must have completed MUSC 177 with a grade of ‘C’ or better."}, {"Course": "MUSC 179", "Name": "Keyboard Skills IV", "Credits": "1", "Description": "A continuation of MUSC 178, this course is designed to enable students to achieve the level of proficiency in keyboard skills required for the major and to complement their studies in music theory.  Topics covered include harmonization, sightreading, technique, solo performing, transposition, improvisation, and functional keyboard harmony.  Good knowledge of music theory needed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100357", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 178 with a grade of ‘C’ or better."}, {"Course": "MUSC 182", "Name": "Beginning String Methods", "Credits": "1", "Description": "This course introduces the methods of teaching basic string techniques.  This class is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55572", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 183", "Name": "Intermediate String Methods", "Credits": "1", "Description": "This course introduces the methods of teaching intermediate string techniques.  This class is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55573", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 182  with a grade of ‘C’ or higher."}, {"Course": "MUSC 184", "Name": "Woodwind Methods: Clarinet & Saxophone", "Credits": "1", "Description": "This course introduces the methods of teaching basic and intermediate woodwind techniques.  This class is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.  Students enrolled in this course will also need to enroll in the correlating section of PRAC 096 on the first day of class. ", "Grading": "Graded", "Course ID": "55574", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Clarinet and Saxophone"}, {"Course": "MUSC 185", "Name": "Woodwind Methods: Flute and Oboe", "Credits": "1", "Description": "A continuation of MUSC 184, this course introduces the methods of teaching basic and intermediate woodwind techniques.  This course is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.  Students enrolled in this course will also need to enroll in the correlating section of PRAC 096 on the first day of class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55575", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Flute and Oboe", "Prerequisite/Corequisite": "You must have completed MUSC 184  with a grade of ‘C’ or better."}, {"Course": "MUSC 186", "Name": "Beginning Brass Methods", "Credits": "1", "Description": "This course introduces the methods of teaching basic brass techniques.  This course is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.  Students enrolled in this course will also need to enroll in the correlating section of PRAC 096 on the first day of class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55576", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 187", "Name": "Intermediate Brass Methods", "Credits": "1", "Description": "A continuation of MUSC 186, this course introduces the methods of teaching intermediate brass techniques. This course is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.  Students enrolled in this course will also need to enroll in the correlating section of PRAC 096 on the first day of class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55577", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 186  with a grade of ‘C’ or better."}, {"Course": "MUSC 188", "Name": "Percussion Methods", "Credits": "1", "Description": "This course introduces the methods of teaching basic percussion techniques.  This course is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.", "Grading": "Graded", "Course ID": "55578", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 189", "Name": "Guitar Methods", "Credits": "1", "Description": "This course introduces the methods of teaching basic guitar techniques.  This course is designed specifically to help music education majors build skills and gain understanding for teaching in K-12 contexts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55579", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 190", "Name": "Private Lessons for Non-Music Majors", "Credits": "2", "Description": "This is a course for non-music majors to take weekly private music lessons. Instruction is offered in most Western instruments and voice. The lessons direct students toward attaining a competent technique, a diverse performing repetoire, and stylistic interpretive sensitivity. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 30 credits.", "Grading": "Graded", "Course ID": "55581", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $150.00 per credit"}, {"Course": "MUSC 191", "Name": "Recital Preparation", "Credits": "1", "Description": "The course is designed to prepare students for public performance by requiring attendance at weekly music forums and attendance at 10 concerts (at least seven on campus) each semester. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded", "Course ID": "55582", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 193", "Name": "Private Lessons for Music Majors", "Credits": "3", "Description": "This is a 3-credit course for music majors to take weekly private music lessons. Instruction is offered in most Western instruments and voice. The lessons direct students toward attaining a competent technique, a diverse performing repertoire, and stylistic interpretive sensitivity. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 30 credits.", "Grading": "Graded", "Course ID": "55583", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Guitar, Trombone, Upright Bass, Bassoon, Trumpet, Percussion, Flute, French Horn, Improv, Clarinet, Organ, Electric Bass, Voice, Tabla, Piano, Violin, Bagpipe, Saxophone, Harp, Sax Improv, Recorder, Oboe, Perf.Studies Musc Majors, Viola, Cello, Classical Guitar, Tuba, Electric Guitar, Harpsichord, Jazz Trumpet, Jazz Vibraphone, Alexander Technique", "Attributes": "Course Fee = $425.00"}, {"Course": "MUSC 194", "Name": "Private Lessons for Music Majors", "Credits": "2", "Description": "This is a 2-credit course for music majors to take weekly private music lessons, restricted to students in the music technology major or those music majors studying a second instrument. Instruction is offered in most Western instruments and voice. The lessons direct students toward attaining a competent technique, a diverse performing repertoire, and stylistic interpretive sensitivity. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 20 credits.", "Grading": "Graded", "Course ID": "55584", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Guitar, Trombone, Upright Bass, Bassoon, Trumpet, Percussion, Flute, French Horn, Improv, Clarinet, Organ, Electric Bass, Voice, Piano, Violin, Saxophone, Harp, Sax Improv, Oboe, Viola, Cello, Classical Guitar, Tuba, Recorder, Tabla, Electric Guitar, Harpsichord, Jazz Trumpet, Jazz Vibraphone, Alexander Technique", "Attributes": "Course Fee = $284.00"}, {"Course": "MUSC 210", "Name": "Musicianship Laboratory III", "Credits": "1", "Description": "A continuation of MUSC 111 , this course is designed to develop advanced musical skills for music majors. Topics include sight-singing, notation, dictation and transposition.", "Grading": "Graded", "Course ID": "55590", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed  MUSC 111 with a C or better."}, {"Course": "MUSC 211", "Name": "Musicianship Laboratory IV", "Credits": "1", "Description": "A continuation of MUSC 210 , this course is designed to develop advanced musical skills for music majors.  Topics include sight-singing, notation, dictation, and transposition.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55591", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 210 with a grade of ‘C’ or better "}, {"Course": "MUSC 214", "Name": "The History of Jazz: Origins-Present", "Credits": "3", "Description": "This course explores the evolution of jazz from its origins to the present day, focusing in particular on principal genres and representative musicians/ ensembles: blues, ragtime, early New Orleans and Chicago schools, swing, big band, bop, cool jazz, hard bop, avantgarde and “free” jazz, and jazzrock fusion within the context of musical, cultural, social and political developments. For students with little or no formal training in music, this course explores jazz in a non-technical way.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55594", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 215", "Name": "Introduction to Black Music", "Credits": "3", "Description": "A survey of the form and function of music in African and diasporan cultures. General areas to be explored will be music in ritual and ceremony, as transmitter of history and culture, and as a social and political tool.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50014", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "AFST 245"}, {"Course": "MUSC 217", "Name": "Rock and Related Music: 1950-Present", "Credits": "3", "Description": "This course explores the evolution of rock ‘n’ roll from its origins to the present day, focusing on soul, folk rock, British rock, psychedelic, heavy metal, disco, punk and rap styles within the context of cultural, social and political developments. For students with little or no formal training in music, this course’s emphasis will be on the styles and evolution of the music, which will be discussed in a non-technical way that centers on music fundamentals -i.e., melody, harmony, texture, rhythm and form.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55597", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MUSC 218", "Name": "Recording Techniques", "Credits": "3", "Description": "This course takes the student through the basics of acoustics and psycho-acoustics, microphone design and placement techniques, consoles, and stereo recording principles.  Students will also conduct hands-on recording sessions of various different musical instruments, ensembles, and genres. ", "Grading": "Graded", "Course ID": "55598", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 219", "Name": "Introduction to Digital Audio Workstations", "Credits": "3", "Description": "A continuation of MUSC 218 , this course introduces students to the use of digital audio work stations for music production.  Recording, editing, and mixing techniques will be explored, and students will work with various musical ensembles.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55599", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 218 with a grade of ‘C’ or better."}, {"Course": "MUSC 221", "Name": "Jazz Theory and Aural Skills", "Credits": "3", "Description": "This course introduces the following jazz theory topics:  jazz harmony and materials, basic musical forms, composition, techniques of harmonization and reharmonization, and substitution,.  Students will also develop their aural recognition of basic jazz materials throughout the course, including modes of the major and melodic minor scale, chords including extensions and alterations, and pentatonic, diminished, and whole tone scales.  Basic musical forms are learned through composition projects.", "Grading": "Graded", "Course ID": "55601", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 126 with a ‘C’ or better."}, {"Course": "MUSC 222", "Name": "Jazz Arranging", "Credits": "3", "Description": "This course covers the techniques of scoring and arranging jazz music, including orchestration, transposition, melodic and rhythmic embellishment, and techniques of harmonization essential to jazz arranging.  Harmonic techniques covered include tonicization through dominant and diminished sevenths, chromatic and diatonic planning, and the linear approach.  Composition projects progress to five-part writing, culminating in arranging for nonet. Course covers the techniques of scoring and arranging jazz music, including orchestration, transposition, melodic and rhythmic embellishment and techniques of harmonization essential to jazz arranging. Techniques covered include tonicization through dominant and diminished sevenths, chromatic and diatonic planing and the linear approach. Composition projects progress to five-part writing, culminating in arranging for nonet.", "Grading": "Graded", "Course ID": "55602", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 221 with a grade of ‘C’ or better."}, {"Course": "MUSC 224", "Name": "Instrumentation", "Credits": "3", "Description": "This course provides an introduction to arranging and composing for specific instruments and instrumental ensembles. Basics of transposition and standard instrumentations are covered, as well as issues of idiomatic voicing and other timbral and textural considerations when arranging for traditional and nontraditional instrumental ensembles.", "Grading": "Graded", "Course ID": "55604", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 125 with a grade of ‘C’ or better."}, {"Course": "MUSC 225", "Name": "Theory III: Counterpoint", "Credits": "3", "Description": "A continuation of MUSC 126 , this course covers the study and application of the various technical aspects of music writing/composition as expressed through tonal and expanded harmonic idioms, contrapuntal procedures, and various formal constructions.", "Grading": "Graded", "Course ID": "55605", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 126 with a ‘C’ or better."}, {"Course": "MUSC 226", "Name": "Theory IV: Music Writing", "Credits": "3", "Description": "A continuation of MUSC 225 , this course offers an analytical study of musical styles and structure, with emphasis on chromatic harmony and 19th-century technique.  The course is designed to develop the student’s analytical abilities by examining scores.  Some of the topics covered include rhythmic, textural and thematic analysis, and the expansion of the orchestra.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55606", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MUSC 225  with a grade of ‘C’ or higher."}, {"Course": "MUSC 228", "Name": "Choral Writing and Arranging for the Classroom", "Credits": "2", "Description": "Students in this course will learn strategies to musically transform pre-existing vocal material into useful choral scores to accommodate the instructional and performing needs of children in the classroom. Choral writing and arranging skills will be developed through topics such as creating a two-part vocal score from a solo song for elementary choirs, editing existing published scores for enhanced use in the middle school rehearsal, and expanding a given single melody into a 4-part, acappella arrangement for the high school choir. A working knowledge of Sibelius, Finale, or another music writing program is needed for this course.", "Grading": "Graded", "Course ID": "102906", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MUSC 230", "Name": "Musics of the World", "Credits": "3", "Description": "A survey of selected musical cultures of the world, with emphasis on the musical forms, instruments, tonal material, the role of music in society and its relationship to other arts.", "Grading": "Graded", "Course ID": "55608", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}]