[{"Course": "AGNG 358", "Name": "Advanced Study in Management of Aging Services", "Credits": "3", "Description": "Provides students with the opportunity for advanced study of topics such as the promotion of healthy physical, psychological, and social aging in health and human services. Focuses on how health and human services can promote developmental potential in older adults. Encourages students to delve into a study of the role that aging persons will play in their selected field of health and human services. Also, students will conduct research on topics in aging and examine how this research relates to their major and future career goals. Recommended Preparation: Introductory social or behavioral science course", "Grading": "Graded", "Course ID": "101844", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AGNG 100 or AGNG 200 or ANTH 211 or PSYC 100 or SOCY 101 or POLI 200 "}, {"Course": "AGNG 361", "Name": "Technology for Management of Aging Services", "Credits": "3", "Description": "This course will introduce students to the history of technology, both as a social/cultural phenomenon that has shaped the lives of those entering their later years as well as an enabler to improve and enhance quality of life for aging Americans. Students will be introduced to various types of technology and to how they can be used to improve the care and quality of life for aging Americans. Recent advances in technology such as electronic health records, home monitoring devices, software and tools that enhance seniors’ connections with the outside world and turn therapy into recreation, and electronic tools that can be used to manage and enhance an organization’s approach to improving its culture and care practices will be examined. Guest speakers and opportunities to see some of these technologies either in use or through live demonstrations or video will be featured.", "Grading": "Graded", "Course ID": "100021", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "IS 361 ", "Prerequisite/Corequisite": " You must complete any AGNG course and any IS course or any CMSC course or COMP 101 all with a ‘C’ or better."}, {"Course": "AGNG 369", "Name": "Contemporary Issues, Cultures, and Social Work Practices in Aging", "Credits": "3", "Description": "This course uses a cultural framework to explore social issues, trends, policies, and services affecting older people and their families focusing on diversity of the aging experience. Students who complete this course will be able to create and evaluate culturally sensitive services for older adultsthat consider the intersectionality of membership in varying groups. Topics include: physical and mental aging, aging theory, social work practice with older adults, cultural approaches to aging, and special populations.  Recommended Preparation: Six social science credits, at least one course in Social Work or Aging", "Grading": "Graded", "Course ID": "102265", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR), Social Sciences (GFR)", "Same as Offered": "SOWK 369 "}, {"Course": "AGNG 389", "Name": "Integrative Approaches to Promoting Wellness in Aging", "Credits": "3", "Description": "This course will introduce students to fundamental concepts of integrative approaches to healthy aging. Differences between conventional western and integrative approaches to health are presented. Patterns of and motivations for the use of integrative approaches among older adults is covered. Also discussed are the safety and efficacy of major integrative health modalities such as functional medicine, nutrition, supplements and herbs, homeopathy, acupuncture, yoga, qi gong and Tai Chi, mindfulness meditation, and spiritual well-being for older adults. ", "Grading": "Graded", "Course ID": "102689", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AGNG 100 or AGNG 200  or HAPP 100  or HAPP 200  or SOCY 101  or PSYC 100 or SOWK 200  with a grade or ‘D’ or better"}, {"Course": "AGNG 399", "Name": "Independent Study in the Management of Aging Services", "Credits": "1", "Description": "Directed independent study, completed under the direction and review of a faculty member affiliated with the program. Credit is variable, reflecting varied scope of student projects. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "57343", "Consent": "Instructor Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete 9 credits in AGNG"}, {"Course": "AGNG 401", "Name": "Critical Issues in Management of Aging Services", "Credits": "3", "Description": "This course applies basic organizational management techniques to the unique demands of aging services in the public and private sectors. The course deals with the unique customer, regulatory, ethical, quality and delivery issues of providing services to individuals living in various settings and ranging from older adults who are fully active and productive to those facing limited health, incomes, cognitive function or social support. Financing of services, including public resources, private payment and insurance (health, long-term care) is a key topic of concern in providing and coordinating care for older adults. Management issues of on-site and remote staff are also addressed.", "Grading": "Graded", "Course ID": "57344", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Completion of AGNG 300 "}, {"Course": "AGNG 415", "Name": "The Art of Aging", "Credits": "3", "Description": "This course introduces students to the ways in which film, art, and literature has portrayed the experience of aging and attitudes towards aging and older adults. The central concepts to be explored are how film, art, and literature depict self/identity, family, friendship, intimacy, resilience, creativity, intellectual capacity, community, and productivity in later life. The goal of the course curriculum is to encourage students to critically think about ways the aging experience is depicted in the arts and how the arts can be used to portray developmental potential in later life. Recommended Preparation: AGNG 100 or AGNG 200 ", "Grading": "Graded", "Course ID": "101845", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 with a grade of ‘C’ or better"}, {"Course": "AGNG 422", "Name": "Research Applications in Aging Services", "Credits": "3", "Description": "Businesses, agencies and organizations are required to evaluate and assess the quality of the services they provide. This course reviews a variety of techniques, including business-based techniques, quality assessment tools, program evaluation and customer satisfaction approaches. Students will learn three basic approaches to outcomes research and statistics applicable across a wide range of aging services settings from government to for- and nonprofit agency settings.", "Grading": "Graded", "Course ID": "52106", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "STAT 121 or STAT 351 "}, {"Course": "AGNG 430", "Name": "Legal and Ethical Issues in Aging Services", "Credits": "3", "Description": "This course introduces the substance, processes and context of law and lawyering as they impinge on administration, service, and planning of programs for and with an aging population, and is intended to provide basic tools which can be applied to a range of substantive issues in Aging. Students will be presented with materials commonly encountered in the worlds of planning and practice (e.g. mini-case problems, proposed statutes and regulations, materials used in resolving legal conflicts and/or ethical dilemmas). Ethical theory and practice, problem analysis, remedy choice-making, and appreciation of styles and processes of various forums (legislative, judicial, executive, etc.) are features of the course.", "Grading": "Graded", "Course ID": "100020", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " AGNG 100 and PHIL 358 or MGMT 385 or IS 304; Junior Standing"}, {"Course": "AGNG 440", "Name": "Diversity in Aging Services", "Credits": "3", "Description": "Providing services to older people involves the diversity of the clients and, increasingly frequently, the diversity of the service provision staff. Including aspects of cultural diversity, socioeconomic diversity, gender diversity and age diversity, this course provides students with information regarding aspects of diversity that may influence the expectations and satisfaction of both groups in the service delivery system. Examples include variations in family systems, expectations about later life and illness, issues related to eligibility for services, and problems of communication and comfort in cross-age, intercultural or interclass interactions.", "Grading": "Graded", "Course ID": "57345", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  AGNG 200  with a grade of ‘C’ or better."}, {"Course": "AGNG 454", "Name": "Global Aging and the Future of Social Insurance", "Credits": "3", "Description": "This course examines the demographic causes for and the multiple social and economic effects of the unprecedented demographic trend of aging in the population of the U.S. and of countries throughout the world. This course prepares students to understand and to join the debates about social insurance programs (e.g. Social Security and Medicare) into the 21st century in the U.S., the developed countries and third world nations. Specific topics include a visualization of the planet at mid-century and beyond, challenges from the unfunded liability of these programs, and the technique of generational accounting. Policy options to address the multifaceted dilemmas will be explored, including an overview of policies being implemented in other developed nations. Finally, personal strategies to address the expected trends are explored.", "Grading": "Graded", "Course ID": "52107", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "ECON 466 "}, {"Course": "AGNG 460", "Name": "Management of Aging Services Internship", "Credits": "3", "Description": "This course is part of the internship requirement in the Management of Aging Services major. Students are placed at established agencies that provide services to older adults. Students will either undertake a new project directly related to the management of aging services or participate in an ongoing project designed to improve and/or evaluate services for older adults. Students work under the direction of an immediate supervisor at the agency and are overseen by the Internship Director at the Erickson School. Student internship placements will reflect the student’s career interests and career plans in government/policy, human services/aging network, or business/forprofit services. Students attend a one-hour internship seminar twice monthly during the semester.", "Grading": "Pass/Fail", "Course ID": "57346", "Consent": "Department Consent Required", "Components": "Field Studies, Lecture", "Prerequisite/Corequisite": "Junior standing; 9-15 credits in AGNG."}, {"Course": "AGNG 462", "Name": "Internship - Aging Services II", "Credits": "3", "Description": "This course is available to students who are interested in continuing the placement they complete in AGNG 460 or undertaking a new placement for additional elective credit. Students are placed at established agencies and that provide services to older adults. The student will either undertake a new project directly related to the management of aging services or participate in an ongoing project designed to improve and/or evaluate services for older adults. Students work under the supervision of an immediate supervisor at the agency and are overseen by faculty at the Erickson School. Student internship placements will reflect the student’s career interests and career plans in government/policy, human services/aging network, or business/for-profit services. Students attend a one-hour internship seminar twice monthly during the semester. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Pass/Fail", "Course ID": "100004", "Consent": "No Special Consent Required", "Components": "Field Studies, Lecture", "Prerequisite/Corequisite": " Junior standing; 15 credits in AGNG"}, {"Course": "AGNG 463", "Name": "Internship in Aging Services II", "Credits": "3", "Description": "This is the second of a two semester internship. Students are placed at the same agencies at which they were interns during the first semester of the internship. The student will either undertake a new project directly related to the management of aging services or participate in an ongoing project designed to improve and/or evaluate services for older adults. Students work under the supervision of an immediate supervisor at the agency and are overseen by faculty at the Erickson School. Student internship placements will reflect the student’s career interests and career plans in government/policy, human services/aging network, or business/for-profit services. Students attend a one hour internship seminar twice monthly during the semester.", "Grading": "Pass/Fail", "Course ID": "100005", "Consent": "No Special Consent Required", "Components": "Field Studies, Lecture", "Prerequisite/Corequisite": "Successful completion of AGNG 462 "}, {"Course": "AGNG 470", "Name": "Aging Service Management: Capstone Seminar", "Credits": "3", "Description": "This course requires that students bring together various skills, knowledge and experience in a capstone experience where they will be expected to a) demonstrate understanding of the content of the major, b) show evidence of ability to apply it in innovative ways, and c) develop materials and demonstrate readiness for job search. Given the wide range of information presented in the major, this course provides a structured opportunity to pull together the varied pieces into a working whole. Problem solving, critical thinking and mutual learning/teaching in the seminar format are also a feature of the course.", "Grading": "Graded", "Course ID": "57348", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Senior status and completed or concurrently enrolled in AGNG 460  or AGNG 462 or AGNG 463."}, {"Course": "AGNG 497", "Name": "Supplemental Practicum in Aging Services", "Credits": "1", "Description": "This course is intended for students desiring an additional practice experience beyond the internship required for the major. Students must 1) identify and arrange their own practicum host; 2) submit for approval the site and a plan of work reflecting the number of credits; and 3) gain agreement of a faculty member to supervise this work which will operate under the format of an independent study. Students are expected to undertake meaningful activity in connection with this experience, and must complete written assignments for the supervising faculty member agreed upon prior to the practicum. This course is repeatable for credit. Students may complete a maximum of 3 credits.", "Grading": "Graded", "Course ID": "52108", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "AGNG 460 or AGNG 462 and AGNG 463 with a C or better"}, {"Course": "AGNG 498", "Name": "Advanced Special Topics in Management of Aging Services", "Credits": "3", "Description": "This course provides the opportunity to present specialized or emergent topical material to advanced students with interests in management of aging services. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Audit", "Course ID": "52109", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 12 credits in AGNG"}, {"Course": "AGNG 499", "Name": "Independent Study in Aging Services Management", "Credits": "1", "Description": "Directed independent study, completed under the direction and review of a faculty member affiliated with the program. Credit is variable, reflecting varied scope of student projects. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "57349", "Consent": "Instructor Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete 12 credits in AGNG"}, {"Course": "MBIO 361L", "Name": "Sustainable Aquaculture Laboratory", "Credits": "2", "Description": "Students will be exposed to the theory and practice of aquaculture as well as concepts associated with the development of biotechnology supporting sustainable aquaculture. This course offers hands-on experience in fish/shellfish biology, aquaculture microbiology, and marine biotechnology at a state-of-art aquatic animal holding and production facility, the Aquaculture Research Center (ARC) at the Columbus Center.", "Grading": "Graded", "Course ID": "102700", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must have completed BIOL 141, BIOL 142, CHEM 101, CHEM 102, CHEM 102L, BIOL 300L, and BIOL 302 all with a grade of ‘C’ or higher."}, {"Course": "MBIO 478", "Name": "Marine and Environmental Biotechnology", "Credits": "3", "Description": "This course covers the use of molecular techniques to address questions in marine and environmental sciences, toxicology and sustainability, as well as their use in discovering and developing useful products from marine systems. students will discuss current environmental challenges and will address these issues using molecular tools and management and policy. Representative topics include: bioremediation, discovery of bioproducts from marine organisms, sustainable aquaculture, development of biofuels, and the role of marine microbes in global carbon cycling.", "Grading": "Graded", "Course ID": "102734", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 141, BIOL 142, CHEM 101, CHEM 102, CHEM 102L, BIOL 300L, and BIOL 302 all with a grade of ‘C’ or better."}, {"Course": "MATH 099", "Name": "Introductory Algebra", "Credits": "0", "Description": "Designed for the student with little or no knowledge of algebra. Topics include properties of integers and real numbers, linear equations and inequalities, operations on monomials and simple polynomials, factoring second-degree polynomials, rational expressions, properties of exponents and square roots, and graphing inequalities. Three institutional credits (not applicable to the degree) are given.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55190", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have scored a 1 on the LRC MATH placement test to enroll in MATH 99."}, {"Course": "MATH 104", "Name": "Quantitative Literacy", "Credits": "3", "Description": "Math 104 focuses on algebraic and numeric skills in a context of applications and problem-solving to prepare students for Introduction to Statistics (STAT 121) or Contemporary Mathematics (MATH 120). Topics include quantitative relationships, algebraic reasoning, functional reasoning, probabilistic and statistical reasoning, Quantitative communication skills are incorporated.", "Grading": "Graded", "Course ID": "102412", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 104Y "}, {"Course": "MATH 104Y", "Name": "Quantitative Literacy", "Credits": "4", "Description": "Math 104 focuses on algebraic and numeric skills in a context of applications and problem-solving to prepare students for Introduction to Statistics (STAT 121) or Contemporary Mathematics (MATH 120). Topics include quantitative relationships, algebraic reasoning, functional reasoning, probabilistic and statistical reasoning, Quantitative communication skills are incorporated.", "Grading": "Graded", "Course ID": "102458", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 104 "}, {"Course": "MATH 106", "Name": "Algebra and Elementary Functions", "Credits": "3", "Description": "An introduction to the basic techniques and functions of mathematics. This course is especially recommended for those students who need to brush up due to a shaky high school preparation or for those who haven’t had a mathematics course in several years. Topics include linear equations and inequalities; quadratic equations; polynomials; and rational functions and their inverses, including the exponential and the logarithm. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55194", "Consent": "No Special Consent Required", "Components": "Lecture, Seminar", "Course Equivalents": "MATH 106Y ", "Prerequisite/Corequisite": "You must score a 2 or 3 on the LRC placement exam or have completed LRC 99 with a grade of ‘C’ or better to enroll in this course."}, {"Course": "MATH 106Y", "Name": "Algebra and Elementary Functions", "Credits": "4", "Description": "An introduction to the basic techniques and functions of mathematics. This course is especially recommended for those students who need to brush up due to a shaky high school preparation or for those who haven’t had a mathematics course in several years. Topics include linear equations and inequalities; quadratic equations; polynomials; and rational functions and their inverses, including the exponential and the logarithm. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55195", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "MATH 106 ", "Prerequisite/Corequisite": "You must score a 2 or 3 on the LRC placement exam or have completed LRC 99 with a grade of ‘C’ or better to enroll in this course."}, {"Course": "MATH 115", "Name": "Finite Mathematics", "Credits": "3", "Description": "An introduction to linear algebra, matrices, set theory, combinatorial analysis and probability theory. Appropriate for students desiring a knowledge of elementary linear algebra and probability theory. Note: Not open to students who have passed any of MATH 221, STAT 350, STAT 351, STAT 355, STAT 356 or STAT 451.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55196", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 106 or MATH 106Y with a grade of “C” or better or scored a 3, 4 or 5 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 120", "Name": "Introduction to Contemporary Mathematics", "Credits": "3", "Description": "Students will be introduced to many topics from contemporary mathematics. These are especially of interest to students in the social and information sciences. Topics include networks and graphs, the traveling salesman problem, scheduling linear programming, social choice, voting systems game theory, fair division, patterns, tilings form, similarity and symmetry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "055191", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have scored a 3, 4 or 5 on the LRC MATH placement exam or passed MATH 106 or MATH 104 with a grade of ‘C’ or better to enroll in this course."}, {"Course": "MATH 131", "Name": "Mathematics for Elementary and Middle Grades Teachers I", "Credits": "4", "Description": "This course is intended primarily for prospective elementary and middle grades teachers. It focuses on the structural aspects of mathematics and the ‘why’ of arithmetical computations. Topics include numbers and number system structures, fundamental ideas of number theory, properties of mathematical operations, techniques for computation, rational and real number properties, vector and matrix properties and operations, algebraic notation, functions, functional representations, and patterns of change in proportional and inversely proportional relationships. Note: Enrollment is intended primarily for students pursuing teacher certification.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55198", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 106 or MATH 106Y with a grade of “C” or better or scored a 3 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 132", "Name": "Mathematics for Elementary and Middle Grades Teachers II", "Credits": "4", "Description": "This course is intended primarily for prospective elementary and middle grades teachers. Topics include core concepts of Euclidean and non-Euclidean geometry, transformations, congruence, similarity, scaling, right triangles, trigonometry, geometric formula rationale, geometric constructions, axiomatic reasoning and proof, statistical variability, randomness, creation and implementation of surveys and statistical designs, data distributions, empirical and theoretical probability, and probability distributions. Note: Enrollment is intended primarily for students pursuing teacher certification.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55199", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 106 or MATH 106Y with a grade of “C” or better or scored a 3 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 140", "Name": "Differential Calculus", "Credits": "3", "Description": "This course covers the fundamentals of the differential calculus with review of notions of analytic geometry and trigonometry as needed. Content includes limits; rate of change and velocity; derivatives and rules of differentiation; differentiation of polynomial, algebraic and trigonometric functions; curve sketching and optimization problems; and differentiation of inverse functions, anti-derivatives and indefinite integrals. Note: Math 140 does not cover all the material of MATH 151. It is equivalent to the first quarter of calculus at institutions on the quarter system.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55200", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 150 with a grade of “C” or better or scored a 5 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 141", "Name": "Integral Calculus", "Credits": "3", "Description": "Topics of this course include: computation of areas, definition of the definite integral, integrals of algebraic and trigonometric functions, applications of integrals, the calculus of exponential and logarithmic functions, basic and advanced techniques of integration, numerical integration and improper integrals. Note: The combination of MATH 140 and Math 141 includes all of the material of MATH 151 and can serve as a prerequisite to MATH 152. Math 141 is equivalent to the second quarter of calculus at an institution on the quarter system.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55201", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 140 or MATH 155B with a grade of “C” or better before you can take this class."}, {"Course": "MATH 142", "Name": "Calculus Applications and Infinite Series", "Credits": "3", "Description": "Topics of this course include: first introduction to differential equations; further applications of the differential and integral calculus; infinite sequences and series; Taylor and Maclaurin series for functions, including the trigonometric, logarithmic and exponential functions. Note: Completion of this course is equivalent to completion of MATH 152. This is equivalent to the third quarter of calculus at institutions on the quarter system.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55202", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 141 with a grade of “C” or better before you can enroll in this class."}, {"Course": "MATH 150", "Name": "Precalculus Mathematics", "Credits": "4", "Description": "This course provides the mathematical preparation necessary for success in calculus. It also provides preparation for basic physics, computer science and engineering science courses. Topics covered include review of functions and graphing techniques; logarithmic and exponential functions; review of basic right-angle trigonometry followed by an extensive treatment of trigonometric functions, identities and applications to the analytic geometry of the conic sections, applications to two-dimensional vectors and to the geometry of complex numbers. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55203", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 106 or MATH 106Y with a grade of “C” or better or scored a 4 or 5 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 151", "Name": "Calculus and Analytic Geometry I", "Credits": "4", "Description": "Topics of this course include limits, continuity, the rate of change, derivatives, differentiation formulas for algebraic, trigonometric, logarithmic, and exponential functions, maxima and minima, integration and computation of areas, the Fundamental Theorem of Calculus, areas and volumes of solids of revolution, and applications. Note: Non-science oriented students should consider MATH 155 . Credit will not be given for both MATH 151  and MATH 155 .  Note: Non-science oriented students should consider MATH 155 . Credit will not be given for both Math 151 and MATH 155. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55205", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "MATH 151H ", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 150 with a grade of “C” or better or scored a 5 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 151H", "Name": "Calculus and Analytic Geometry I - Honors", "Credits": "4", "Description": "Topics of this course include limits, continuity, the rate of change, derivatives, differentiations formulas for algebraic and trigonometric functions, maxima and minima, integration and computation of areas. Areas and volumes of solids of revolution, applications. Note: Non-science oriented students should consider MATH 155. Credit will not be given for both MATH 151 and MATH 155.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55206", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "MATH 151 ", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must be admitted to the HONORS COLLEGE and have completed MATH 150 with a C or better or scored a 5 on the LRC MATH Placement exam to enroll in this course."}, {"Course": "MATH 152", "Name": "Calculus and Analytic Geometry II", "Credits": "4", "Description": "Topics of this course include inverse functions, methods of integration, improper integrals, hyperbolic functions, sequences and infinite series, power series, Taylor series, conic sections, polar coordinates, and applications. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55208", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "MATH 152H  ", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must complete MATH 151 or MATH 151H  or MATH 141 or MATH 155B   with a grade of C or better before taking this class."}, {"Course": "MATH 152H", "Name": "Calculus and Analytic Geometry II - Honors", "Credits": "4", "Description": "Topics of this course include logarithmic and exponential functions, inverse functions, methods of integration, improper integrals, hyperbolic functions, sequences and infinite series, power series, Taylor series, applications, conic sections and polar coordinates.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55209", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "MATH 152 ", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College, and must  complete MATH 151 or MATH 151H or MATH 141 or MATH 155B  with a grade of C or better."}, {"Course": "MATH 155", "Name": "Applied Calculus", "Credits": "4", "Description": "Basic ideas of differential and integral calculus, with emphasis on elementary techniques of differentiation and integration with applications, are treated in this course. Technology will be utilized to enhance understanding of the concepts and their applications. Not recommended for students majoring in mathematics, computer science, engineering, or physical sciences. Note: Credit will not be given for both MATH 151 and MATH 155. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content. More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55211", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 106 or MATH 106Y with a grade of “C” or better or scored a 4 or 5 on the LRC MATH placement exam to enroll in this course."}, {"Course": "MATH 155B", "Name": "Calculus of Trigonometric Functions", "Credits": "1", "Description": "The main topics of this course are the differentiation and integration of trigonometric functions, together with a treatment in greater depth of topics in MATH 155.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55212", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 155 with a grade of “C” or better before you can take this class."}, {"Course": "MATH 215", "Name": "Applied Finite Mathematics", "Credits": "3", "Description": "The basic linear algebra of matrices used for solutions of large scale systems of linear equations is treated. Applications of matrices such as Leontieff models of multi-sector economics and the basics of the simplex method for solving linear economic optimization problems are discussed. Fundamental concepts of probability including basic combinatorial methods for probabilistic computations are studied. An introduction is given to decision theory. This treatment is in the context of Bayesian or statistical decision theory, though game theoretic versions may be discussed. Possible optional topics may include elementary Markov chains or the matrix algebra of spreadsheet operations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55215", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 141 or MATH 151 or MATH 155 or MATH 380 with a grade of ‘C’ or better or scored a 5 on the MATH placement exam before you can enroll in this course."}, {"Course": "MATH 221", "Name": "Introduction to Linear Algebra", "Credits": "3", "Description": "Topics of this course include: linear equations, Gauss-Jordan reduction, matrices and determinants and their properties, vector spaces and subspaces, basis and dimension, linear transformations, kernel and range, eigenvalues and eigenvectors, and matrix diagonalization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55216", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 221H ", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must complete MATH 141 or MATH 151 or MATH 380 with a grade of C or better."}, {"Course": "MATH 221H", "Name": "Introduction to Linear Algebra - Honors", "Credits": "3", "Description": "Topics of this course include: linear equations, Gauss-Jordan reduction, matrices and determinants and their properties, vector spaces and subspaces, basis and dimension, linear transformations, kernel and range, eigenvalues and eigenvectors, and matrix diagonalization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55217", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 221 ", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College and have completed MATH 141, or MATH 151 or MATH 151H or MATH 380 with a grade of “C” or better."}, {"Course": "MATH 225", "Name": "Introduction to Differential Equations", "Credits": "3", "Description": "Topics of this course include: solutions of first- and second order linear differential equations, non-linear exact and separable equations, integrating factors, homogeneous equations, higher-order linear equations, initial and boundary value problems, solutions as functions of the equation parameters, Laplace transforms, power series solutions for Bessel and Legendre equations, difference equations and numerical methods. Recommended Preparation: MATH 251.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55218", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 with a grade of “C” or better."}, {"Course": "MATH 233", "Name": "Fundamentals of Geometry", "Credits": "3", "Description": "In this course, the student will learn and apply the principles of geometry as well as recognize and understand their relevance to the real world. Topics include fundamental concepts and patterns; geometric reasoning and proof; parallel and perpendicular lines as they relate to Euclidean, hyperbolic and elliptical geometry; triangle relationships and triangle congruence; exploring quadrilaterals; transformations and similarity; investigating right triangles, polygons, surface area and volume, and circles. Throughout the course, special emphasis is given to problem-solving techniques.", "Grading": "Graded", "Course ID": "100002", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 132 or MATH 150 with a grade of ‘C’ or better or have scored a 4 or 5 on the MATH placement exam."}, {"Course": "MATH 251", "Name": "Multivariable Calculus", "Credits": "4", "Description": "Topics of this course include parametric and polar functions, vectors, lines, planes and surfaces in three dimensions, vector functions and their derivatives, partial derivatives, gradients, directional derivatives, maxima, minima, and Lagrange multipliers, multiple integrals, area, volume, surface area, integration in different coordinate systems, line integral, and the Green’s, Stokes, and divergence theorems. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55219", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 251H ", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 with a grade of “C” or better."}, {"Course": "MATH 251H", "Name": "Multivariable Calculus", "Credits": "4", "Description": "Topics of this course include parametric and polar functions, vectors, lines, planes and surfaces in three dimensions, vector functions and their derivatives, partial derivatives, gradients, directional derivatives, maxima, minima, and Lagrange multipliers, multiple integrals, area, volume, surface area, integration in different coordinate systems, line integral, and the Green’s, Stokes, and divergence theorems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100128", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MATH 251 ", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College and completed MATH 142 or MATH 152 with a grade of C or better."}, {"Course": "MATH 290", "Name": "Special Topics in Mathematics", "Credits": "1", "Description": "A special topics course covers material that is not available in a regular course, but is suitable for coverage at this level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55222", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MATH 299", "Name": "Independent Study in Mathematics", "Credits": "1", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55223", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "MATH 300", "Name": "Introduction to Mathematical Reasoning", "Credits": "4", "Description": "This course develops fundamentals of mathematical logic and proof writing. Topics will include propositional logic, quantifiers, contradiction and contrapositive, induction, sets, relations, integers, functions, images and pre-images, bijections and inverse functions. LaTeX, a typesetting program for mathematical writing will be introduced. In addition to writing proofs, students will learn to assess the soundness of proofs written by others.", "Grading": "Graded", "Course ID": "102881", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 with a grade of C or better."}, {"Course": "MATH 301", "Name": "Introduction to Mathematical Analysis I", "Credits": "4", "Description": "This course is a systematic study of basic analysis with an emphasis on formal proofs, examples and counter examples. Topics include properties of the real line, sequences, series, limits, continuity and differentiation of functions, and Riemann Integration. Recommended Preparation: CMSC 203.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55224", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 in addition to MATH 221 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 302", "Name": "Introduction to Mathematical Analysis II", "Credits": "3", "Description": "Topics of this course include: continuity, differentiation of functions of several variables, uniform convergence of sequences of functions, multiple integration, contraction mapping principle, and implicit and inverse function theorems. Note: Credit will not be given for both Math 302 and MATH 401.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55225", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 251 and MATH 301 with a grade of “C” or better."}, {"Course": "MATH 306", "Name": "Geometry", "Credits": "3", "Description": "This course is a systematic study of the core concepts and principles of two- and three-dimensional Euclidean and two-dimensional non-Euclidean geometries with a heavy emphasis on mathematical reasoning and proof (including both propositional and predicate logic). Topics may include transformations (including dilations, translations, rotations, reflections, glide reflections; compositions of transformations; and the expression of symmetry in terms of transformations), congruence, similarity and scaling (and their development and expression in terms of transformations), right triangles, trigonometry, periodic phenomena.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55227", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 with a grade of C or better."}, {"Course": "MATH 341", "Name": "Computational Methods", "Credits": "3", "Description": "Basic computational methods for interpolation, systems of linear equations, least squares approximation, numerical quadrature, numerical solution of polynomial and transcendental equations. Emphasis on the methods and their computational properties, rather than on their analytic aspects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55228", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 in addition to having completed MATH 221 and CMSC 201 with a grade of C or better."}, {"Course": "MATH 355", "Name": "Biomathematics", "Credits": "3", "Description": "Topics in this course include: Introductions to discrete-time dynamical and continuous time differential equations with an emphasis on nonlinear interactions applied to biological systems; Basic stability analysis, graphical analysis, solution techniques; Introduction to probability to address randomness in biological processes including probability distributions; Basics of descriptive statistics in relation to the probabilistic models.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101992", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH152 and MATH 221 with a C or better."}, {"Course": "MATH 365", "Name": "Financial Mathematics for Actuaries", "Credits": "3", "Description": "This course is an introduction to the mathematics of interest and the evaluation of interest related products including annuities with non-contingent payments, loans, bonds, general cash flows, portfolios, and immunization.  Additional topics discussed include sources of interest rates, stochastic interest rates, and financial instruments such as shorts, swaps, and options.  This material includes most of the learning objectives for the Financial Mathematics Exam (called Exam FM by the Society of Actuaries and Exam 2 by the Casualty Actuarial Society.)  Also students not necessarily interested in taking the actuarial exam are encouraged to take this course as an upper level elective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102303", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "STAT 365 ", "Prerequisite/Corequisite": "You must complete MATH 152 with a C or better."}, {"Course": "MATH 380", "Name": "Introduction to Operations Research", "Credits": "3", "Description": "Linear programming, including the simplex method. Transportation, assignment and transhipment problems. Network problems. Not recommended for mathematics/statistics or computer science majors. Note: Credit will not be given for both Math 380 and MATH 381.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55231", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "Rou must have completed MATH 115 or MATH 150 with a grade of “C” or better."}, {"Course": "MATH 381", "Name": "Linear Methods in Operations Research", "Credits": "3", "Description": "Introduction to convex sets. Theory of linear programming. Applications to transportation and assignment problems. Introduction to graphs with applications to network problems, including shortest route and maximum flow problems. Introduction to game theory. Note: Credit will not be given for both MATH 380 and Math 381.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55232", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 with a grade of C or better."}, {"Course": "MATH 385", "Name": "Introduction to Mathematical Modeling", "Credits": "3", "Description": "This is a project-oriented course offering the opportunity to discover how various real world problems can be described and analyzed with the aid of simple mathematical models and computer simulations. Possible project topics include operation of a fuse, spread of pollutants in a river, propagation of an infectious disease, traffic flow on a highway, oscillating chemical reactions, population growth in biology, etc.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55234", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 225 or MATH 355  with a grade of “C” or better to take this class."}, {"Course": "MATH 390", "Name": "Special Topics in Mathematics", "Credits": "1", "Description": "A special topics course covers material that is not available in a regular course, but is suitable for coverage at this level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits. Recommended Preparation: MATH 221 or MATH 225 or MATH 251 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55236", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Intro. to Financial Math for Actuarial Students"}, {"Course": "MATH 401", "Name": "Mathematical Analysis", "Credits": "3", "Description": "Topics of this course include: elementary metric space topology, sequences, series, continuity, differentiation, Riemann integral, sequences and series of functions, and implicit and inverse function theorems. Note: Credit will not be given for both MATH 302 and Math 401.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55237", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 with a grade of C or better."}, {"Course": "MATH 404", "Name": "Introduction to Partial Differential Equations I", "Credits": "3", "Description": "Linear and quasi-linear first order equations, method of characteristics, linear second order equations, derivations, classifications, and fundamental solutions, integral transforms, self-adjoint operators, Sturm-Liouville problems and eigenfunction expansions, Fourier series, boundary and initial value problem for potential, wave, and heat equations, Green’s functions, and distributions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55239", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 225 and MATH 251 with a grade of “C” or better before you can take this class."}, {"Course": "MATH 407", "Name": "Intro to Modern Algebra & Number Theory", "Credits": "3", "Description": "The basic abstract algebraic structures (rings, integral domains, division rings, fields and Boolean algebra) will be introduced, and the fundamental concepts of number theory will be examined from an algebraic perspective. This will be done by examining the construction of the natural numbers from the Peano postulates, the construction of the integers from the natural numbers, the rationals as the field of quotients of the integers, the reals as the ordered field completion of the rationals and the complex numbers as the algebraic completion of the reals. The basic concepts of number theory lead to modular arithmetic; ideals in rings; and to examples of integral domains, division rings and fields as quotient rings. The concept of primes yields the algebraic concepts of unique factorization domains, Euclidean rings, and prime and maximal ideals of rings. Examples of symmetries in number theory and geometry lead to the concept of groups whose fundamental properties and applications will be explored.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55241", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 with a grade of C or better."}, {"Course": "MATH 408", "Name": "Introduction to Abstract Algebra", "Credits": "3", "Description": "Topics of this course include a deeper examination of the structure of groups, including Sylow theorems and the fundamental theorem of abelian groups; a further study of rings, including modules and linear algebra over rings; polynomial and matrix rings; field theory, including Galois theory; and applications such as nonsolubility of quintic polynomials by radicals and geometric nonconstructilibity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55242", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 407 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 409", "Name": "Introduction to Mathematical Logic", "Credits": "3", "Description": "Propositional and first-order logic are developed. The basic framework of formal languages, logical structures and their models is given. Formal deductive systems for logical proofs is set in an algorithmic framework. The completeness and compactness theorems for consistent axiom systems are proven, including the Lowenheim-Skolem theorems. The last half of the course focuses on the work of Goedel. Using Goedel’s numbering of number theoretic formulae and proofs, his theorem asserting the incompleteness (inability to prove all true statements) of any consistent axiomatization of the natural numbers that is recursively given are proven. Related results of Tarski and Rosser, his second incompleteness theorem; the impossibility of Peano arithmetic, if consistent, to prove its own consistency are also proven. Time permitting, the course will introduce Goedel’s proof of the consistency of Cantor’s continuum hypothesis and axiom of choice with the usual axioms of set theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55243", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 or CMSC 441 or PHIL 346 with a grade of ‘C’ or better before you can take this course."}, {"Course": "MATH 410", "Name": "Introduction to Complex Analysis", "Credits": "3", "Description": "Complex number plane and functions of a complex variable, differentiability and analyticity. Cauchy-Riemann equations, integration in the complex plane, Cauchy’s theorem, power series, analytic continuation, Laurent series, improper integrals, gamma function, calculus of residues, evaluation of real integrals, argument principle, meromorphic functions and entire functions. Note: MATH 301 is recommended.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55244", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 251 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 411", "Name": "Linear Algebra", "Credits": "3", "Description": "Topics of this course include finite-dimensional vector spaces, subspaces, basis, dimension, linear transformations, matrices, linear functionals, dual space, dual-basis theorem, direct sum, quotient space, determinants, eigenvalues, minimal polynomial, characteristic polynomial, Cayley-Hamilton theorem, companion matrices, invariant subspaces, similarity, diagonalization, rational and Jordan canonical forms, nilpotent operators, inner product spaces, Gram-Schmidt orthogonalization, orthogonal matrices and spectral theorem.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55245", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 with a grade of C or better."}, {"Course": "MATH 413", "Name": "Number Theory", "Credits": "3", "Description": "Following a review of elementary number theory through Fermat’s little theorem, the course treats: unique factorization, element orders, Euler’s function and Carmichael’s lambda functions, primitive elements, quadratic reciprocity, the prime-number theorem and elementary analytic number theory, and quadratic number fields. Optional topics may include: computational number theory, finite fields, cyclotomic fields and Fermat’s last theorem.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55247", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 407 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 421", "Name": "Introduction to Topology", "Credits": "3", "Description": "Topics of this course include metric spaces, topological spaces, derived topological spaces, separation axioms, closure and continuity, covering properties and compactness, connectedness, metrizability, complete metric spaces, and introduction to homotopy theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55248", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 302 or MATH 401 with a grade of C or better."}, {"Course": "MATH 423", "Name": "Differential Geometry", "Credits": "3", "Description": "The differential geometry of curves and surfaces, curvature and torsion, moving frames, the fundamental differential forms, and intrinsic geometry of a surface. Recommended Preparation:  MATH 301.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55249", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 and MATH 251 with a grade of C or better."}, {"Course": "MATH 426", "Name": "Introduction to Math Software Packages: MATLAB", "Credits": "2", "Description": "The student will become familiar with the usage of Matlab, an advanced numerical linear algebra package that is widely used in teaching and research. Matlab is an interactive tool for high-performance numerical computations, visualization and programming. Matlab performs complex matrix algebra, computes matrix factorizations (such as LU, QR and SVD) and eigenvalues, solves linear systems of equations, provides extensive 2-D and 3-D visualization tools, and possesses programming tools used in scripts and functions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55251", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221  and CMSC 104  or CMSC 201 with a C or better."}, {"Course": "MATH 427", "Name": "Mathematical Software Packages: Maple", "Credits": "1", "Description": "The student will become familiar with the usage of Maple, an advanced computer algebra package that is widely used in teaching and research. Maple performs symbolic computations such as integration, differentiation, factoring and simplifying algebraic expressions, solving linear and non-linear systems, solving differential equations exactly or in power series, complex algebra, matrix algebra, plotting in 2-D and 3-D, and animated plots.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55252", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 152 or MATH 221 and CMSC 201 with a C or better."}, {"Course": "MATH 430", "Name": "Matrix Analysis", "Credits": "3", "Description": "Topics in this course will include a review of basic matrix operations, determinants, rank, matrix inverse and solving linear equations. The course then will study partitioned matrices, eigenvalues and eigenvectors, spectral decomposition, singular-value decomposition, orthogonal projections, idempotent matrices, quadratic forms, extrema of quadratic forms, non-negative definite and positive definite matrices, and matrix derivatives.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55253", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 251 and MATH 301 with a grade of “C” or better."}, {"Course": "MATH 432", "Name": "History of Mathematics", "Credits": "3", "Description": "An examination of the conceptual development of mathematics and the roles played by the people central to its development. Key periods of focus will be the Greco-Roman classical era, the development of mathematics from the Renaissance through the birth of the calculus, the rise of mathematical rigor and abstraction in the 18th and 19th centuries (e.g., number and quantity, algebra, geometry, discrete mathematics, statistics and probability, and calculus), and the continuing evolution of mathematics and its impact on modern society in the 20th century. Ancillary topics such as ethno-mathematics and humanistic-mathematics may be addressed. Note: This course does not qualify as an upper division mathematics/statistics elective for majors or minors, but it does qualify as a supplementary elective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55254", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed MATH 301 and ENGL 100  with a grade of C or better."}, {"Course": "MATH 441", "Name": "Introduction to Numerical Analysis", "Credits": "3", "Description": "Topics of this course include: numerical linear algebra, interpolation, numerical differentiation and integration, solution of nonlinear equations, acceleration of convergence and numerical treatment of differential equations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55255", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 201 and MATH 225 and MATH 251 and MATH 301 with a grade of C or better before you can enroll in this class."}, {"Course": "MATH 447", "Name": "Introduction to Parallel Computing", "Credits": "3", "Description": "This course introduces students to scientific computing on modern parallel computers. Examples of numerical algorithms will be taken from several areas of mathematics, including numerical analysis and numerical linear algebra. Students will discuss the implications of the parallel architecture on the design of numerical algorithms. Parallel computing equipment will be made available to students enrolled in the course. The course includes a significant portion of instruction dedicated to learning the parallel programming language on that machine. The class also includes a review of serial programming that is integrated into the presentation of sample codes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100326", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 201 or equivalent with a grade of C or better."}, {"Course": "MATH 452", "Name": "Introduction to Stochastic Processes", "Credits": "3", "Description": "This is a non-measure theoretic course. Topics include general Markov chains (branching process, queuing processes, birth and death processes, and Poisson processes), second-order processes (Gaussian processes and Wiener processes) and an introduction to stochastic differential equations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55256", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 355 or STAT 451 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 456", "Name": "Mathematical Methods for Science and Engineering", "Credits": "3", "Description": "Vector analysis and tensors, Sturm-Liouville problems and Fourier series, complex analysis, integral transforms and variational calculus.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55257", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 221 and MATH 225 and MATH 251 with a grade of C or higher."}, {"Course": "MATH 465", "Name": "Introduction to Artificial Neural Networks", "Credits": "3", "Description": "This course gives a systematic introduction to artificial neural networks, which represent a rather new and fundamentally different approach to computing and information processing. Providing parsimonious universal approximators for static and dynamic mappings, synthetic methodologies for building models and/or solutions, abilities to learn from and adapt to environments, and massively parallel computation paradigms, the artificial neural networks have formed a powerful approach to solving nonlinear or complex problems in a broad spectrum of areas including signal speech/image processing, system control, pattern recognition, robotics, financial management, digital communication, etc. This course will cover multi-layer perceptrons, recurrent neural nets, global minimization for training, adaptive and robust neural nets, neural filtering, identification # and control, support vector machines, self-organizing maps, etc.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55260", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 and MATH 251 and MATH 301 and STAT 451 all with a grade of ‘C’ or better before you can enroll in this course."}, {"Course": "MATH 469", "Name": "Mathematical Physiology", "Credits": "3", "Description": "Mathematical Physiology develops qualitative and quantitative mathematical models of and answers to questions in physiology. The objective of this course is to expose students from any of a number of scientific disciplines, who have a background in ordinary differential equations, basic biology, and some computation (i.e., familiarity with software such as Matlab), to the exciting synergy of mathematics and physiology. The course will use ordinary differential equations to study non-dimensionalization, asymptotic and perturbation theory, and bifurcation theory. We will perform stochastic simulation and derive certain partial differential equations. These techniques will be applied to physiological topics from biochemical reactions and ion channel kinetics to systems involving cardiac, pancreatic, or neuronal function and malfunction. Recommended Preparation: BIOL 141 or equivalent.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101913", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 225 with a grade of “C” or better to take this class."}, {"Course": "MATH 475", "Name": "Combinatorics and Graph Theory", "Credits": "3", "Description": "General enumeration methods, difference equations, generating functions. Elements of graph theory, including transport networks, matching theory and graph algorithms. Introduction to finite geometries and block designs.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55265", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 301 with a grade of C or better."}, {"Course": "MATH 476", "Name": "Introduction to Game Theory", "Credits": "3", "Description": "Purely non-cooperative or zero-sum games between two players are introduced. In simple cases, solutions of such games use techniques of saddle points or other geometric means. VonNeumann’s Min-Max theorem assures optimal mixed strategies. In general, linear programming techniques must be employed. Study of convex sets in Euclidean spaces, in particular of polyhedra, and polytopes is necessary for full understanding of the general case. In non-zero sum situations with two or more players, the fundamental results of John Nash assuring equilibria in mixed strategies and on arbitration or bargaining schemes are studied. For cooperative games with many players, several solution concepts are studied, including Shapley values and core allocations. Diverse application are considered. Purely noncooperative or zero-sum games between two players are introduced. Solutions of such entail techniques of finding saddle points or geometric means in simple cases.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55266", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 and MATH 251 with a grade of C or better."}, {"Course": "MATH 479", "Name": "Mathematical Problem Solving Seminar", "Credits": "1", "Description": "Mathematical problem-solving techniques, mathematical communication skills. Problem sessions with problems ranging from pre-calculus to analysis, algebra, geometry, combinatorics and probability. Problems ranging from quickies to mini research problems. Students will develop and reinforce skills from previous mathematics courses and will be introduced to topics from more advanced courses. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55267", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Math Problem Solving Sem"}, {"Course": "MATH 480", "Name": "Senior Seminar", "Credits": "1", "Description": "This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55268", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MATH 481", "Name": "Mathematical Modeling", "Credits": "3", "Description": "Derivation and analysis of mathematical models of phenomena from physics, engineering and other exact sciences. Topics include stability of equilibria of dynamical systems with emphasis on the qualitative aspects of solutions, phase plane analysis and linearization of non-linear systems. Additional topics from catastrophe theory, bifurcation, optimization and chaos will be covered as time permits. Examples will be drawn from population dynamics, flywheel governor, a model for heartbeat, bang-bang controls, self-sustained oscillations and morphogenesis.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55269", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete MATH 221 and MATH 225 and MATH 251  and ENGL 100  with a grade of C or higher."}, {"Course": "MATH 482", "Name": "Nonlinear Optimization", "Credits": "3", "Description": "Introduction to convex analysis. One-dimensional minimization. Unconstrained optimization in algorithms, global convergence and rates of convergence. Quasi-Newton techniques. Convex programming: optimality conditions and duality. Penalty and Barrier methods.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55270", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 251 and MATH 301 with a grade of ‘C’ or better before you can enroll in this course. MATH 301 can be taken concurrently."}, {"Course": "MATH 483", "Name": "Linear and Combinatorial Optimization", "Credits": "3", "Description": "Integer programming. The traveling salesman problem. Advanced linear programming techniques. Complexity. Projective methods in linear programming. The Karmarkar method.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55271", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 381 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 484", "Name": "Stochastic Methods in Operations Research", "Credits": "3", "Description": "Topics of this course include: introduction to Markov chains, Poisson processes, introduction to queuing theory, Stochastic programming, introduction to deterministic and Stochastic dynamic programming.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55272", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 355 or STAT 451 with a grade of “C” or better before you can take this course."}, {"Course": "MATH 485", "Name": "Introduction to the Calculus of Variations", "Credits": "3", "Description": "This course will provide a modern introduction to basic results of the classical calculus of variations. Special emphasis will be given to the theory of second-order conditions. Considerable attention will be devoted to physical applications of variational methods.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55273", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 221 and MATH 225 and MATH 251 and MATH 301 all with a grade of C or better before you can enroll in this class."}, {"Course": "MATH 486", "Name": "Discrete Dynamical Systems", "Credits": "3", "Description": "The course will address ideas from discrete dynamical systems, including fixed points, periodic points, bifurcations, and an explanation of period 3 implied chaos. Fractals such as Sierpinski’s gasket, Julia sets and Mandelbrot sets also will be introduced. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55274", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 225  and MATH 251  and MATH 301  all with a grade of `C’ or better before you can enroll in this class. "}, {"Course": "MATH 487", "Name": "Continuous Dynamical Systems", "Credits": "3", "Description": "This course aims to develop an understanding of the theory behind the rich qualitative behavior of dynamical systems modeled by ordinary differential equations. Topics covered includes existence and uniqueness of solutions, linear systems, characterization of behavior near equilibria, stability and Lyapunov functions, Hartman- Grobman theorem, Poincaré-Bendixson theorem, Hamiltonian systems, bifurcations and chaos.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101920", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 225 and MATH 251 and MATH 301 with a grade of C or better."}, {"Course": "MATH 490", "Name": "Special Topics in Mathematics", "Credits": "1", "Description": "A special topics course covers material that is not available in a regular course, but is suitable for coverage at this level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits. Recommended Preparation: MATH 221 or MATH 225 or MATH 251 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55275", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MATH 495", "Name": "Topics in the Mathematics of Operations Research", "Credits": "3", "Description": "Introduction to recent and advanced techniques of optimization and operations research. The course will be redefined from time to time and will reflect the instructor’s interests.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55276", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MATH 496", "Name": "Mathematics Practicum", "Credits": "1", "Description": "Under faculty direction, students will write a report dealing with mathematical concepts or techniques utilized or implemented in internships or cooperative education or in the workplace. This course is repeatable for credit. Students may complete a maximum of 4 credits.", "Grading": "Graded", "Course ID": "55277", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MATH 497", "Name": "Senior Thesis", "Credits": "3", "Description": "The student will be required to prepare an exposition of either a significant area of mathematics or of the results of a student research project. Typically, the former will be in connection with an upper-division course the student has completed or independent study (MATH 499).", "Grading": "Graded", "Course ID": "55278", "Consent": "No Special Consent Required", "Components": "Thesis Research"}, {"Course": "MATH 499", "Name": "Independent Study in Mathematics", "Credits": "1", "Description": "Under this heading, a student may agree to a course with a particular faculty member on a topic not covered in the regular curriculum. The arrangements with the faculty member must be made before the student registers for the course. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55279", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "ENME 110", "Name": "Statics", "Credits": "3", "Description": "The equilibrium of stationary bodies under the influence of various kinds of forces. Forces, moments, couples, equilibrium, trusses, frames and machines, centroids, moments of inertia, beams, friction and hydrostatics. Vector and scalar methods are used to solve problems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54187", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENME 110H ", "Prerequisite/Corequisite": "You must have completed PHYS 121 with a grade of “C’ or better or be concurrently enrolled in PHYS 121 and you must have completed MATH 151 with a “C” or better."}, {"Course": "ENME 110H", "Name": "Statics", "Credits": "3", "Description": "The equilibrium of stationary bodies under the influence of various kinds of forces. Forces, moments, couples, equilibrium, trusses, frames and machines, centroids, moments of inertia, beams, friction and hydrostatics. Vector and scalar methods are used to solve problems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100502", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory", "Course Equivalents": "ENME 110 ", "Prerequisite/Corequisite": "You must complete PHYS 121   or be concurrently enrolled in PHYS 121 and MATH 151 with a ‘C’ or better."}, {"Course": "ENME 204", "Name": "Introduction to Engineering Design with CAD", "Credits": "3", "Description": "Sophomores are introduced to engineering design using the science and tools (CAD) of prior courses. The course will cover design specifications, design analysis, performance predictions, design, changes, final design and operation specifications. Students will be required to make written and oral presentations and produce a design report.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54189", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENES 101 and ENME 220 and ENGL 100 or equivalent all with a grade of ‘C’ or better."}, {"Course": "ENME 217", "Name": "Engineering Thermodynamics", "Credits": "3", "Description": "Properties, characteristics and fundamental equations of state of materials, work and heat transfer. First and second laws of thermodynamics, thermodynamic power and refrigeration cycles, gas/vapor mixtures and psychrometrics. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required.  Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54190", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must have completed both  ENME 110 and MATH 152 with a ‘B’ or better and PHYS 121 all with a grade of  ‘C’ or better."}, {"Course": "ENME 220", "Name": "Mechanics of Materials", "Credits": "3", "Description": "Mechanics of Materials is a fundamental course on the mechanical behavior of deformable bodies under axial loads, torsion, flexure, and combined loads. The concepts of stress, strain, and material properties are introduced and used to relate external forces with the resulting internal forces and deformation of a body. Practical applications involving the design of mechanical and structural elements under various load conditions are emphasized.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54192", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENME 220H ", "Prerequisite/Corequisite": "You must have completed ENME 110 and MATH 152 with a grade of ‘B’ or better and PHYS 121 all with a grade of “C” or better."}]