[{"Course": "GES 381", "Name": "Remote Sensing", "Credits": "4", "Description": "This course includes interpretation of imagery, such as aerial photos, b/w IR, color IR, Radar, Thermal IR and various satellite system images. Special emphasis is given to acquisition of data through the use of photogrammetric techniques and visual interpretation. Topical applications include forestry, urbanization, geology and landforms, water resources, agriculture and land use. The course usually includes a one-hour aerial flight project.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51160", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete GES 102 or GES 110 or GES 120 or GES 286 with a C or better."}, {"Course": "GES 383", "Name": "Statistical and Thematic Cartography", "Credits": "4", "Description": "This course examines various ways to portray quantitative and qualitative information using thematic maps. Emphasis is on data processing, map design and construction. The computer is used to aid in data processing and map development; however, no previous experience with computers is necessary. Recommended Preparation: GES 286 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51118", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture"}, {"Course": "GES 386", "Name": "Introduction to Geographic Information Systems", "Credits": "4", "Description": "An overview of the essential characteristics, development and application of Geographic Information Systems (GIS). Students will become familiar with the specialized concepts and methods related to the compilation and manipulation of spatial data, and they will apply those concepts and methods in a laboratory setting.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51262", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed GES 286 with a grade of C or better."}, {"Course": "GES 387", "Name": "Applications for Geographis Information Systems", "Credits": "3", "Description": "A course designed for nonmajors and working professionals. An introduction and survey of the principal concepts, data structures, data management, system implementation components and design of applications using spatial data technologies. To be stressed are the underlying structure of spatial systems in combination with practical laboratory skills in developing technical competency with state-of-the-practice software tools. Laboratory skills development will attend to Web-based techniques for data access, analysis and formatting output of results. Recommended Preparation: Three credits in geography and environmental systems or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51211", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 400", "Name": "Selected Topics In Geography", "Credits": "3", "Description": "This course is provided to allow flexibility in offering advanced work not found elsewhere in the course offerings. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51163", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "GES 400H "}, {"Course": "GES 400H", "Name": "Honors Selected Topics In Geography", "Credits": "3", "Description": "This course is provided to allow flexibility in offering advanced work not found elsewhere in the course offerings. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100118", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "GES 400 "}, {"Course": "GES 404", "Name": "Forest Ecology", "Credits": "4", "Description": "A field-intensive course emphasizing forested landscape ecosystems and plant species of the Mid-Atlantic. Our challenge is to understand ecosystems, their physical and biotic characteristics, their relationship to one another in the field, successional trends, and selected aspects of their functioning. This course will stress forest species, and especially (1) field identification and characteristic habitats, (2) establishment ecology, (3) competitive and mutualistic relationships, (4) occurrence and diversity related to habitat conditions, (5) establishment and occurrence in relatively undisturbed (by humans) and disturbed environments, and (6) genetic and non genetic variation of populations, as well as adaptation to specific environments.", "Grading": "Graded", "Course ID": "100252", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete GES 308 or GES 313 or BIOL 142 with a C or better."}, {"Course": "GES 405", "Name": "Applied Landscape Ecology", "Credits": "4", "Description": "This course applies the tools of landscape ecology, including GIS, remote sensing, aerial photography and landscape classification, to explore the spatial patterning of ecological processes across landscapes at different scales. Hands-on lab and field exercises will develop understanding and skills necessary for students to plan and conduct their own investigations of landscape pattern, process, and change in local and regional landscapes in collaboration with the instructor.", "Grading": "Graded", "Course ID": "51365", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed GES 305 and GES 386 with a grade of C or better."}, {"Course": "GES 406", "Name": "Aquatic Ecology", "Credits": "4", "Description": "Students enrolled in this course will gain a thorough knowledge of the local aquatic biota and their habitats. Emphasis in this lab-based course will be placed on the interaction between physical, chemical and biological processes occurring in aquatic ecosystems. Students will learn how to collect, analyze and interpret ecological information collected from streams and rivers.", "Grading": "Graded", "Course ID": "51164", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed GES 308 or BIOL 142 with a grade of C or better."}, {"Course": "GES 408", "Name": "Quantitative Field Ecology", "Credits": "4", "Description": "Students enrolled in this course will gain an appreciation for the modern scope of scientific inquiry in the field of ecology. A major goal is for the students to become familiar with how organisms interact with one another and their natural environment by understanding the structure and function of different types of local ecosystems. Students will learn field collection techniques, as well as how to organize, analyze and present and interpret ecological information.", "Grading": "Graded", "Course ID": "54552", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete GES 308 or BIOL 142 with a C or better."}, {"Course": "GES 411", "Name": "Fluvial Morphology", "Credits": "3", "Description": "Study of the formation and development of landforms that are produced by riverine processes. Human activities on flood plains are included. Recommended Preparation: Competency in algebra and simple trigonometry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51212", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 310  with a C or better."}, {"Course": "GES 412", "Name": "Biogeochemical Cycles and the Global Environment", "Credits": "3", "Description": "This course explores the chemistry and cycling of elements across the Earth’s surface and atmosphere, with special emphasis on human-induced changes in biogeochemistry that are driving global warming, ocean acidification, acid rain, ozone depletion, water pollution; and nutrient saturation of freshwater, estuarine and coastal environments. The basic biogeochemical processes will be introduced and then integrated to explain the global cycles of water, carbon, nitrogen, phosphorus and sulfur and how these are changed by human activities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54553", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed (GES 110 or GES 111 or GES 120) and (GES 308 or BIOL 301 or BIOL 142) and CHEM 102 with a grade of C or better."}, {"Course": "GES 413", "Name": "Seminar in Biogeography", "Credits": "3", "Description": "Advanced and topical themes in biogeography.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51264", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 313 with a grade of C or better."}, {"Course": "GES 414", "Name": "Severe Storms and Their Societal Impacts", "Credits": "3", "Description": "This course investigates the physical processes that generate severe storms and high impact weather events, including hurricanes, nor’easters, tornadoes, derechos, ice storms, heat waves, blizzards and flash floods. This course examines the historical record of significant storms and their associated socioeconomic impacts, including transportation networks, power utilities, agriculture, and water management. We also examine the scientific debate surrounding global warming’s possible link to the intensity and frequency of Atlantic hurricanes.  This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: GES 110.", "Grading": "Graded", "Course ID": "102244", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 311  with a grade of C or better."}, {"Course": "GES 415", "Name": "Climate Change", "Credits": "3", "Description": "This course deals with the question of climate change and variability. Topics covered include changes in climate in different time scales (geologic, historic and the present), environmental evidence of climate change, factors controlling climate variations, and the use of computer models in reconstructing past climates and predicting climate changes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51213", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 311 with a grade of C or better."}, {"Course": "GES 416", "Name": "Hydrology", "Credits": "4", "Description": "Study of the occurrence and movement of water on and beneath the land surface. All phases of the hydrologic cycle are discussed, with particular emphasis on factors that control runoff, flood frequency, measurement and prediction of streamflow, and applications of hydrologic data in environmental planning. Principles of groundwater flow and the influence of geology on both groundwater and surface water also are included. Experience in the use of microcomputers for problem-solving is recommended.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51165", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete (GES 110 or GES 111) and (GES 310 or GES 311) or (GES 317 or GES 333) and MATH 151 and (STAT 121 or  STAT 350 or STAT 355) with a C or better."}, {"Course": "GES 419", "Name": "Watershed Analysis & Modeling", "Credits": "3", "Description": "This course will involve application of Geographic Information Systems in the analysis of water resources and watershed condition. Beginning with an introduction to the ArcHydro and TauDEM data models, students will explore digital mapping of water resources information, terrain analysis using digital elevation models, and delineation of river and watershed networks. Through integration of time-series and geospatial data students will be exposed to hydrologic principles of hydrologic modeling.", "Grading": "Graded", "Course ID": "100253", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 424", "Name": "Environmental Justice", "Credits": "3", "Description": "This course is designed to engage students with the theoretical debates, case studies, and real-world practice of environmental justice (EJ). EJ concerns the grassroots activism of communities who live with environmental inequities and the study of the distribution of environmental benefits and burdens across diverse communities. The course focuses particularly on US-based EJ issues related to human health. The course will include a field methods component.", "Grading": "Graded", "Course ID": "101811", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 286 or GES 326 or GES 328 or GES 329 or GES 337 or GES 341 or GES 342 or HAPP 329 or GWST 200 all with a C or better."}, {"Course": "GES 428", "Name": "Scientific Practice and Environmental Policy", "Credits": "3", "Description": "This course studies the relationship between science and environmental policy. Class examines the social process by which scientific consensus emerges and the ways in which environmental policy is affected by the practices of scientists. We will also explore how unsettled scientific disputes inform concrete policy making goals, and how the policy-making process, in turn, shapes scientific research. Intersections of science and policy that we will explore include: climate science and climate change policy; ecosystem science and conservation policy; and the role of citizen science and lay expertise in resolving policy disputes.", "Grading": "Graded", "Course ID": "100485", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  GES 328 or GES 307 or GES 308 or GES 310 or GES 311 or GES 313 or GES 319 or GES 326 or GES 327 or GES 329 or GES 330 or GES 341 or GES 342 or GES 363  with a C or better."}, {"Course": "GES 429", "Name": "Seminar in Geography of Disease and Health", "Credits": "3", "Description": "Current issues in the geographic distribution of disease and health and location/allocation of health care services. Methods of analysis, including computer applications of statistics and information storage, retrieval and mapping.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50100", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HAPP 429 ", "Prerequisite/Corequisite": "Open only to GES, HAPP and POSI majors. Must have completed GES 329 or have senior/graduate standing."}, {"Course": "GES 432", "Name": "Seminar in Natural Resources and Environmental Conservation", "Credits": "3", "Description": "Advanced study of natural resource problems and policies, strategies for environmental conservation and future resource landscapes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51008", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 307 or GES 308 or GES 310 or GES 311 or GES 313 or GES 314 or GES 319 or GES 326 or GES 327 or GES 328 or GES 329 or GES 363 or GES 428 or GES 434 or GES 462 with a C or better."}, {"Course": "GES 433", "Name": "Sustainability, Land Use and Natural Resources", "Credits": "3", "Description": "This seminar class will examine the theory and practice of sustainability as applied to renewable natural resources. Examples and case studies will be drawn from the land-use systems involved with agriculture, forestry, fisheries, recreation and nature conservation. This will be done in an international context, comparing and contrasting sustainability issues in developed and developing countries.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51214", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 307 or GES 308 or GES 310 or GES 311 or GES 313 or GES 314 or GES 319 or GES 326 or GES 327 or GES 328 or GES 329 or GES 330 or GES 341 or GES 342 or GES 363 with a C or better."}, {"Course": "GES 434", "Name": "Wildlife Policy and the Endangered Species Act", "Credits": "3", "Description": "The course will focus on the history of natural resource policies and wildlife laws intended to protect wildlife in the United States, with particular attention to threatened and endangered species. We use this history to analyze what many consider to be the most controversial environmental law, the 1973 Endangered Species Act (ESA). A case study approach is utilized to investigate the conflicts that have arisen in response to specific efforts to protect threatened and endangered species. The course combines science, policy and legal history, philosophy and contemporary and regional politics in an integrative approach to the problem of endangered species in the U.S. We will also discuss worldwide efforts to protect biodiversity such as the 1975 Convention of the International Trade of Endangered Species of Wild Fauna and Flora (CITES) and the 1992 Convention on Biological Diversity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54554", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 307 or GES 308 or GES 313 or GES 326 or GES 327 or GES 328 or GES 428 or GES 432 or GES 433 or GES 462 with a C or better."}, {"Course": "GES 435", "Name": "Global Patterns of Production and Trade", "Credits": "3", "Description": "This course focuses on analysis of the factors responsible for the location of industry and how these factors have contributed to the globalization of production and world trade. Course includes case studies of industries and regions of production.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51009", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 326 or GES 328 or GES 329 or GES 330 or GES 341 or GES 342 or GES 363 with a C better"}, {"Course": "GES 436", "Name": "Global Environmental Change", "Credits": "3", "Description": "This course explores international dimensions of environmental issues. We examine the global dimensions of emerging economic, cultural, and political processes and their effects on issues of conservation, pollution, and natural resource management. We will explore the ways in which environmental degradation is closely linked with issues of economic development and the implications of these linkages for addressing environmental issues. We will also examine transnational actors such as finance capital, international NGOs, global corporations, and international governance bodies such as the United Nations, and their various roles in producing, and responding to, environmental problems. Specific environmental issues that will be covered include climate change, food security, water provisioning, environmental security, population growth, waste management, and urban growth.", "Grading": "Graded", "Course ID": "100530", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 328 or GES 326 with a C or better."}, {"Course": "GES 437", "Name": "Conservation & Development in the Tropics", "Credits": "3", "Description": "Tropical nations face myriad challenges in pursuit of a sustainable development pathway, particularly when balancing priorities for poverty alleviation with those of environmental conservation. We critically analyze recent conservation and development strategies, and explore how those strategies are shaped by various actors. Students have the opportunity to work in teams to examine the effectiveness or potential for the latest set of strategies, and produce a review for an organization working in the Tropics.", "Grading": "Graded/Pass Fail", "Course ID": "102081", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 337 or GES 326 or GES 328 or GES 329 with a C or better."}, {"Course": "GES 440", "Name": "Global Poverty and Inequality", "Credits": "3", "Description": "This course examines the political, economic and socio-historical factors that cause and sustain poverty in the context of both the Global South and the United States. Students explore various development and poverty-reduction interventions and the role key actors and institutions play in addressing poverty, along with the relationship between privilege and poverty. We analyze both the positive and negative effects of programs such as growth-driven development, structural adjustment, micro-finance, charity, and cash transfer programs.", "Grading": "Graded", "Course ID": "102649", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 326 or GES 327 or GES 328 or GES 330 or GES 337 or GES 341 or GES 342 or GES 363 or GES 424  orGES 428  orGES 429  or GES 434 , GES 435 , GES 435 ,", "additional": "GES 442 , orGES 451  or GES 462 or GLBL 301 with a grade of ‘C’ or higher."}, {"Course": "GES 441", "Name": "Urbanization and Development in a Global Context", "Credits": "3", "Description": "This course examines economic, political and social processes and patterns of urbanization in a global context. It engages with theory and policy debates about the shape and form of urban development. Students look at local and global processes driving urbanization, examining the role of international agencies, NGOs, national governments and grassroots groups. Topics include urban livelihood strategies in the context of economic restructuring, urban revitalization and planning, housing and land tenure, and inequality and violence.", "Grading": "Graded/Pass Fail/Audit", "Consent": "No Special Consent Required", "Prerequisite/Corequisite": "GES 341 or GES 342 or GES 363 "}, {"Course": "GES 442", "Name": "Seminar in Metropolitan Baltimore", "Credits": "3", "Description": "Advanced study of the social and economic geography of Baltimore City and surrounding counties. Course will include data analysis and field research. Recommended Preparation: GES 341 or GES 342 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51265", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 443", "Name": "Urbanization and Development in a Global Context", "Credits": "3", "Description": "This course examines economic, political and social processes and patterns of urbanization in a global context. It engages with theory and political debates about the shape and form of urban development from a geographical perspective. Students look at  local global processes driving urbanization, examining the role of international agencies, NGOs, national governments and grassroots groups. Topics include urban livelihood strategies in the context of economic restructuring, urban revitalization and planning, housing and land tenure, and inequality and violence. The course uses a combination of academic articles, books and media sources, and draws predominantly from case studies in Africa, Asia, and Latin America.", "Grading": "Graded", "Course ID": "102677", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 451", "Name": "Urban Sustainability", "Credits": "3", "Description": "Students will apply previously gained knowledge about urban human-environment interactions to a specific research question related to sustainability in urban landscapes. Readings and in-class discussion will apply the concept of sustainability to contextualize environmental issues facing urban places, including urban development and energy consumption, land-use change, climate change and water resources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51266", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 307 or GES 308 or GES 310 or GES 311 or GES 313 or GES 319 or GES 326 or GES 327 or GES 328 or GES 329 or GES 330 or GES 341 or GES 342 or GES 363 with a C or better."}, {"Course": "GES 462", "Name": "GIS and Human-Environmental Systems", "Credits": "3", "Description": "This course will focus on the use of GIS in analyzing social and environmental systems that constitute complex human-environmental systems. Students will develop their spatial analysis skills, focusing on environmental processes and social contexts. Specific dimensions of environmental and social sustainability such as land use, transportation, economic development, environmental justice, etc. will be explored in detail.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51267", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 386 with a grade of C or better"}, {"Course": "GES 480", "Name": "Advanced Cartographic Applications", "Credits": "4", "Description": "Practical applications in the design and construction of maps, graphics and other visual materials, using computer-based cartography in a production atmosphere. Emphasis is on design and production of publishable quality graphics. Often, full-color atlases, team developed maps and interactive presentations are produced and distributed to the public. Students should plan to spend a considerable amount of time weekly in the computer laboratory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51168", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete GES 383 with a C or better."}, {"Course": "GES 481", "Name": "Digital Image Processing for Environmental Applications", "Credits": "3", "Description": "This course covers the use of digital image processing techniques for extracting information about the earth’s surficial environments from satellite remote sensing images. Lectures will cover the theory, and laboratory exercises will provide hands-on experience in the use of computers and software for image acquisition, processing, visualization, enhancement and classification applied to multispectral satellite data. Environmental applications include wetlands delineation, forestry inventory and assessments, land use and urban sprawl analysis.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51119", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed GES 381 with a grade of C or better."}, {"Course": "GES 482", "Name": "Cartographic Internship", "Credits": "3", "Description": "Students will be selected by the director of cartographic services to assist as unpaid interns for 10 hours per week in the cartographic activities of the department. The interns participate directly in cartographic production and in managing the office of cartographic services. ", "Grading": "Pass/Fail", "Course ID": "51120", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "GES 483", "Name": "GIS Internship", "Credits": "3", "Description": "Students will be selected by the director of GIS services to assist as unpaid interns for 10 hours per week in the GIS activities of the department or in an outside agency, with approval from the department for the type of work in which the student is to be engaged. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Pass/Fail", "Course ID": "51010", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "GES 485", "Name": "Field Research in Geography", "Credits": "3", "Description": "Students in this course gain hands-on experience with field methods for landscape ecology, including sampling, mapping and spatial analysis of soils, vegetation, soil organisms, stream hydrology and land use patterns in local landscapes using GIS, GPS, imagery and other techniques. The class will meet one session each week and six full-day Saturday sessions; scheduling to be arranged. Students will work in teams and prepare final projects that will be presented as scientific posters and on the Web.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51121", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 486", "Name": "Advanced Applications in Geographic Information Systems", "Credits": "3", "Description": "This course focuses on the methods for analyzing spatial data and provides an in-depth examination of technical aspects in spatial data handling, spatial pattern analysis, advanced raster processing, and dynamics GIS modeling. Students become familiar with advanced concepts, methods, and applications of Geographic Information Systems (GIS).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51011", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 386 with a grade of C or better"}, {"Course": "GES 488", "Name": "Spatial Data Analysis and GIS Applications", "Credits": "3", "Description": "This course covers a broad range of spatial analysis from basic data statistics to advanced computational techniques. The goal of this course is to introduce student to various quantitative methods used in geographical data and applications. This course will teach students to understand these concepts and to be able to apply them in geographical problems. The research topics will cover urban pattern analysis, health care, socioeconomic data, and crime data analysis. Students will have the opportunities to work on GIS application examples and cases.", "Grading": "Graded", "Course ID": "100573", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 386   with a C or better."}, {"Course": "GES 491", "Name": "Independent Study in Geography and Environmental Systems", "Credits": "1", "Description": "Independent reading and field experience, supervised by a member of the department faculty. For students of advanced standing who have substantially completed major requirements and desire to study independently an aspect of the discipline not covered by regular course offerings. The student must make an arrangement with a faculty member prior to registration. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51216", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "GES 491H "}, {"Course": "GES 491H", "Name": "Independent Study in Geography and Environmental Systems", "Credits": "1", "Description": "Independent reading and field experience, supervised by a member of the department faculty. For students of advanced standing who have substantially completed major requirements and desire to study independently an aspect of the discipline not covered by regular course offerings. The student must make an arrangement with a faculty member prior to registration. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100117", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "GES 491 "}, {"Course": "GES 497", "Name": "Research Internship", "Credits": "2", "Description": "Upon application, students are selected by the department to intern in faculty mentored research. During the internship, the students participate in a directed readings program and meet periodically to discuss the activities in which they are engaged. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "51325", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "GES 498", "Name": "Geography & Environmental Systems Internship", "Credits": "3", "Description": "Upon application, students are selected by the department to intern in the offices of public agencies, private companies or non-profit organizations. During the internship, the students participate in a directed readings program and meet periodically to discuss the activities in which they are engaged. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "51217", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "GES 499", "Name": "Honors Thesis", "Credits": "3", "Description": "Majors wishing to graduate with departmental honors must complete an honors thesis. The topic and scope of the thesis research project are to be determined in consultation with the student’s faculty advisor. Recommended Preparation: Senior standing, minimum cumulative GPA of 3.25 and departmental GPA of 3.5, completion of at least one 400-level course in a topic area related to the thesis research and permission of the student.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51169", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GERM 101", "Name": "Elementary German I", "Credits": "4", "Description": "An introduction to German through a communicative approach. Language is learned in a thematic context, based on real-life situations. Listening comprehension and basic speaking skills are emphasized. Aspects of life in German-speaking countries also are presented.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54482", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "GERM 102", "Name": "Elementary German II", "Credits": "4", "Description": "A continuation of GERM 101. Emphasis is on extending skills in spoken German within the context of real-life situations. A greater amount of reading and writing is included in this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54484", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed GERM 101 with a C or better before taking this class or have completed 2 years of high school German."}, {"Course": "GERM 103", "Name": "Intensive Review of Elementary German", "Credits": "4", "Description": "Open to students who have completed level III in high school and who nevertheless are unprepared for GERM 201, either as a result of an interruption of five years in their study of the language, or as a result of a weak language background. This course offers an intensive review of Elementary German I and II as an opportunity to improve the student’s listening, speaking, reading and writing skills. Note: GERM 103 or GERM 102, but not both, may be used toward UMBC’s GFR language/culture requirement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54487", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "GERM 201", "Name": "Intermediate German I", "Credits": "4", "Description": "A continuation of GERM 101 and GERM 102 stressing further development of listening comprehension and speaking skills. Increased emphasis on reading, writing and cultural knowledge.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54489", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 102 or GERM 103 with a grade of C or better before taking this class or have completed 3 years of High School German."}, {"Course": "GERM 202", "Name": "Gateway to Advanced German Studies", "Credits": "4", "Description": "Focus is on reading ability, writing skills, and discussion in German about topics from German society and culture. Expansion of language principles taught in GERM 101 - GERM 201, intercultural competency, and practical applications to a global society are expanded and emphasized.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54491", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 201 with a C or better before taking this class or have completed 4 years of high school German."}, {"Course": "GERM 300", "Name": "Special Projects in German Language", "Credits": "1", "Description": "Intensive individualized program of study in German language in an area determined by the student’s particular needs. This course is repeatable for credit. Note: Credits earned in GERM 300 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of German studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54496", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete GERM 202 before you can take this course."}, {"Course": "GERM 301", "Name": "Advanced German Studies I", "Credits": "3", "Description": "This advanced German Studies course further develops language skills (listening, speaking, reading, and writing) in various modes of communication (interpersonal, presentational and interpretive). Intercultural competency and practical applications in a global context are emphasized and expanded. Expository writing and a final project are required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54498", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 202 with a grade of “C” or better before taking this class."}, {"Course": "GERM 302", "Name": "Advanced German Studies II", "Credits": "3", "Description": "The course is a continuation of GERM 301 and will further develop all four language skills, but with a clear focus on the written and oral modes of communication from an intercultural perspective. Students will study the course material in a global context and be required to do contrastive analyses to expand their cultural competency. Regular expository writing assignments, regular oral presentations, and intensive reading of authentic texts and discussion are an integral part. A final project and a formal oral presentation are required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54500", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 301  with a grade of C or better before taking this class."}, {"Course": "GERM 303", "Name": "Topics in German", "Credits": "3", "Description": "Intensive work in the development of advanced language skills in German. Emphasis will be on the reading, discussion, and analysis of authentic cultural and literary texts relevant to the topic. Active use of German involving carefully thought-out communication in appropriate style is stressed in speaking and writing. Topics will reflect the wide range of the cultural and intellectual history of Germany but the emphasis will be on current issues and concerns in the German-speaking world. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54502", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 301 or GERM 302  with the grade of ‘C’ or better before you can take this course."}, {"Course": "GERM 309", "Name": "German for Professional Purposes", "Credits": "3", "Description": "This course gives participants the opportunity to improve their fluency and ease in professional situations in a global environment. Development of language and intercultural skills in various professional fields is emphasized. Topics include everyday business life, including correspondence, telephone and email communication, and specialized terminology in commercial, legal, and/or scientific fields, depending on the needs of the students.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54504", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 202 with a grade of C or better before taking this class."}, {"Course": "GERM 310", "Name": "Advanced Grammar and Style in Context", "Credits": "3", "Description": "This course presents an intensive review and expansion of major grammatical and stylistic topics in a meaningful, communicative practice context.", "Grading": "Graded/Audit", "Course ID": "101809", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GERM 301   or GERM 302   with the grade of ‘C’ or better before you can take this course."}, {"Course": "GERM 311", "Name": "Introduction to German Literature and Culture I", "Credits": "3", "Description": "A study of German culture reflected in literature from the Middle Ages to the 18th century.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54505", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 301 and either GERM 302 or GERM 303 with a grade of C or better."}, {"Course": "GERM 312", "Name": "Introduction to German Literature and Culture II", "Credits": "3", "Description": "A study of German culture reflected in literature from the 18th century to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54507", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 301 and either GERM 302 or GERM 303 with a grade of C or better."}, {"Course": "GERM 313", "Name": "The Contemporary German-Speaking World", "Credits": "3", "Description": "This course is an introduction to the contemporary German-speaking world from an intercultural perspective. The focus will be on current issues such as immigration and integration, diversity and the changing nature of German society, and the public discourse about Islam in German within a global context. Switzerland, Austria, and Luxemburg will also be studied.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54509", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 302 with a grade of “C” or better before taking this class."}, {"Course": "GERM 315", "Name": "Experiential Learning in German", "Credits": "1", "Description": "Intensive language practice and cultural immersion in a German-speaking environment. This course can be completed through study abroad or a community project in a German-speaking setting or with a German cultural background. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: MLL 230 ", "Grading": "Pass/Fail", "Course ID": "101803", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GERM 201 with a C or better before taking this class or have completed 4 years of high school German."}, {"Course": "GERM 319", "Name": "German Translation", "Credits": "3", "Description": "Instruction and practice in translating from German to English. Students work with various written material covering many fields.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54510", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 202 with a grade of “C” or better before taking this class."}, {"Course": "GERM 321", "Name": "Studies in German Literature", "Credits": "3", "Description": "Selected topics in German literature may include the study of a century, movement, genre, theme or individual author. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54512", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed GERM 311 or GERM 312 with a grade of C or better."}, {"Course": "GERM 332", "Name": "The Structure of German", "Credits": "3", "Description": "An investigation of the morphophonological and syntactic organization and processes of German, including dialectal variation. Recommended Preparation: LING 210.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54514", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed MLL 190 and either GERM 302 or GERM 303 all with a grade of C or better."}, {"Course": "GERM 350", "Name": "German Complementary Reading", "Credits": "1", "Description": "A course with readings and discussion in German to be offered in conjunction with a Germanic literature or culture course taught in English (e.g., MLL 216, MLL 261, MLL 332 or HIST 483 or HIST 484). This course is repeatable for credit. Note: Repeatable in conjunction with different courses.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54515", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete GERM 202 with a grade of “C” or better before taking this class."}, {"Course": "GERM 375", "Name": "Germany Then and Now: Explorations of German Cultural and Intellectual History", "Credits": "3", "Description": "This topics course provides an introduction to the cultural and intellectual history of Germany throughout the ages. It is subdivided into three segments: a general overview; an in-depth study of defining moments in German intellectual life and thinking (movements, genres, individual writers, philosopher, historical events, etc.); and an exploration of interconnections between past and present in German cultural life and of the commonalities and divergences between German intellectual history and that of other cultures. Taught in German. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts. Recommended Preparation: GERM 303 and GERM 401 ", "Grading": "Graded/Audit", "Course ID": "101804", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GERM 303."}, {"Course": "GERM 400", "Name": "Special Projects in German", "Credits": "1", "Description": "Open to students with special projects on application to the instructor who will supervise the particular project (subject to approval by the chair of MLL). This course is repeatable for credit. Note: Credits earned in GERM 400 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of German studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54516", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "GERM 401", "Name": "German then and now: Studies in German Language", "Credits": "3", "Description": "Writing intensive course with focus on the history and development of the German language and German language usage in a global context. Among the topics to be covered are communication theories, style and register, language an identity, dialectal diversity, political language, Sprachverfall, and feminist linguistics. Emphasis on development of advanced writing skills, formal oral presentations, and intercultural competency. A final research project is required. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Audit", "Course ID": "54518", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GERM 301 and either GERM 302 or GERM 303 with a grade of C or better."}, {"Course": "GERM 420", "Name": "German Culture in Global Context", "Credits": "3", "Description": "Students will study German discourses on one major international issue (e.g., environment, immigration, security/terrorism, religion) during the semester and compare these with similar discourses in the US and in international organizations on the same issue. Sources of study will be debates in the media, political institutions both inside and outside the countries (Bundestag, EU, UN, NATO for Germany, and the corresponding ones in the US), and non-governmental organizations. Students will discuss how divergent and convergent positions emerge on the basis of historical and cultural traditions and experiences, and are conditioned by particular economic and political interests and power relationships. This course is repeatable for credit. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "102152", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GERM 303 and MLL 301 "}, {"Course": "GERM 421", "Name": "Intercultural Studies in German Popular Culture", "Credits": "3", "Description": "This course is offered on a rotating basis with changing topics. Each topic is a study of one aspect of German popular culture, e.g. popular literature, music, mass media (TV, radio, print media), popular film and popular music which are embedded within a highly globalized context. Texts and institutions, values, behaviors and practices relating to power, hegemony, gender, and nation will be included in intercultural and transcultural analyses drawing on cultural concepts underlying various disciplines. All aspects of the course will be done entirely in German. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54520", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "German In German Televis, Studies In German Lit, Postwar German Lit", "Prerequisite/Corequisite": "You must complete GERM 303 or GERM 401 with a C or better"}, {"Course": "GERM 481", "Name": "Seminar in Intercultural German Studies", "Credits": "3", "Description": "Topics will cover some aspect of German language, literature or civilization from an intercultural or transcultural perspective. Students will be assessed for language competency with a comprehensive exam and completion of a final project. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54521", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed GERM 401 with a grade of C or better before you can take his course."}, {"Course": "GLBL 100", "Name": "Introduction to Global Studies", "Credits": "3", "Description": "An introduction to the forces of globalization affecting economic, political and social relations in the twenty-first century. This topic is inherently multi- and interdisciplinary and so the course will feature units on the parameters of the global economy, institutions of global governance, and the challenges of human security - all of which increasingly transcend borders. Intended as a first course in Global Studies for both majors and non-majors.", "Grading": "Graded", "Course ID": "101942", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GLBL 100Y "}, {"Course": "GLBL 100Y", "Name": "Introduction to Global Studies", "Credits": "4", "Description": "An introduction to the forces of globalization affecting economic, political and social relations in the twenty-first century. This topic is inherently multi- and interdisciplinary and so the course will feature units on the parameters of the global economy, institutions of global governance, and the challenges of human security - all of which increasingly transcend borders. Intended as a first course in Global Studies for both majors and non-majors.", "Grading": "Graded", "Course ID": "102707", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GLBL 100 "}, {"Course": "GLBL 300", "Name": "Research Methods in Global Studies", "Credits": "3", "Description": "An introduction to research methods in global studies designed to acquaint the student with how scholars investigate processes of globalization and transnational cultural developments using a variety of methods and data. The course will consider quantitative methods (such as statistical analyses of national indicators) as well as qualitative methods (such as global ethnography and oral history) of the social sciences, arts and humanities. Students will apply components of those methods in exercises and assignments.", "Grading": "Graded", "Course ID": "102592", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GLBL 100  with a ‘C’ or better. You can also be concurrently enrolled in GLBL 100."}, {"Course": "GLBL 383", "Name": "Global Citizenship", "Credits": "3", "Description": "In this seminar course, students critically examine theories of global citizenship, explore how global citizenship has been enacted on multiple levels, and investigate key issues of global citizenship, such as international migration, public health, world poverty and climate change. Students also engage in experiential learning through service in local community organizations that tackle global problems. Recommended Preparation: GLBL 100 or POLI 100.", "Grading": "Graded", "Course ID": "102732", "Consent": "Instructor Consent Required", "Components": "Lecture", "Same as Offered": "POLI 383."}, {"Course": "GLBL 386", "Name": "The Politics of Development", "Credits": "3", "Description": "This course examines the interaction of politics (the making and implementation of collective decisions for a society) and human development (the improvement of living conditions in a society). Various theoretical approaches are used to study the role of politics in the multiple dimensions of development, including economic growth, environmental sustainability and human rights. Recommended Preparation: 3 Social Sciences GEP Courses", "Grading": "Graded", "Course ID": "102074", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 386 "}, {"Course": "GLBL 400", "Name": "Approaches to Globalization", "Credits": "3", "Description": "This seminar course closely examines the dynamics of globalization and the ways in which different disciplines try to understand its causes and consequences. Beginning with causes, cultural, economic, political, social, and technological drivers of globalization will be studied. Moving on to consequences, the focus will be on issues such as the diffusion of cultural norms, the conduct of diplomacy, development and public health, environmental challenges, international trade and finance, political activism and state-society relations, large-scale population movements (refugees, migrants, diaspora communities), and the proliferation of weapons. Throughout the course, students will consider how the various Global Studies disciplines conceptualize and analyze globalization’s dynamics. Emphasis will be placed on careful reading, seminar discussions, and structured writing assignments.", "Grading": "Graded", "Course ID": "101962", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete GLBL 100  and GLBL 300 and ENGL 100 or equivalent with a grade of C or higher. You can be concurrently enrolled in GLBL 300 . This course is open for GLBL majors only"}, {"Course": "GLBL 401", "Name": "Individual Study in Global Studies", "Credits": "3", "Description": "Independent reading, research, and writing supervised by a faculty member from one of the participating departments and programs in Global Studies. Intended for students who desire to study independently an aspect of Global Studies not covered by regular course offerings. This course is repeatable for credit. Students may complete a maximum of 9 credits. Recommended Preparation: GLBL 400 ", "Grading": "Graded", "Course ID": "101969", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GLBL 409", "Name": "Selected Topics in Global Studies", "Credits": "3", "Description": "Study of a particular topic in Global Studies. Topics will be published in the Schedule of Classes. Recommended Preparation: GLBL 100 ", "Grading": "Graded", "Course ID": "101969", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Chinese Politics"}, {"Course": "GLBL 410", "Name": "I’m a Cyborg But That’s OK", "Credits": "3", "Description": "This class uses the figure of the cyborg to interrogate the ways in which cultured identity is constructed through media the role of technology in defining humanness in an increasingly digital world. It focuses on the processes of globalization and the connections between local and global contexts of struggle inform lived experiences of identity, including race, gender, sexuality, class and ability. Recommended Preparation: GLBL 100  or MLL 230 ", "Grading": "Graded", "Course ID": "102804", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 410 "}, {"Course": "GLBL 460", "Name": "Global Stories", "Credits": "3", "Description": "This is an interdisciplinary course that provides an introduction to community-engaged research through digital storytelling.  It explores the main concepts and methods of creating and analyzing global stories, mainly through audiovisual production. Students work on the connections between local and global contexts of production and consumption of ethnographies. Recommended Preparation: GLBL 100, GLBL 300, MLL 305", "Grading": "Graded", "Course ID": "102865", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 460 "}, {"Course": "GLBL 483", "Name": "International Negotiation", "Credits": "3", "Description": "This course presents the principles of international negotiation. Using the case study method and a multiparty negotiation simulation, students will learn in hands-on fashion about the theory and practice of negotiation. Key conceptual notions include game theoretic models of strategic situations and mediation approaches. Special topics include the role of the media in agenda-setting, the importance of non-state actors in the 21 st century diplomatic arena, and the challenges of public goods issues in international and transnational negotiations. Recommended Preparation: POLI 280 ", "Grading": "Graded", "Course ID": "102083", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 483"}, {"Course": "GLBL 496", "Name": "Global Experience Practicum", "Credits": "3", "Description": "This course is taught through an experiential learning framework the goal of which is to enhance global competence skills and instill a spirit of civic engagement in Global Studies majors. The curriculum is aimed at enhancement of global competency skills and the provision of knowledge and experience in advocacy work in a global-local community setting. Recommended Preparation: GLBL 100, GLBL 300 ", "Grading": "Graded", "Course ID": "102870", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GCSP 301", "Name": "Grand Challenges Orientation", "Credits": "1", "Description": "This seminar provides students with an introduction and foundation for the National Academy of Engineering Grand Challenge Scholars Program. The NAE’s Grand Challenges are 14 complex problems facing humanity, in the broad areas of sustainability, health, security, and the human mind. The topics for the seminar include the Grand Challenges themselves, ethical frameworks, Responsible Conduct of Research training, and initial creation of a GCSP e-portfolio. The seminar will also develop effective teamwork skills, including managing diversity and understanding implicit bias. Students will identify a particular Grand Challenge and focus area. Note: Restricted to students who have been admitted to the Grand Challenge Scholars Program.", "Grading": "Graded", "Course ID": "102385", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "GCSP 302", "Name": "Grand Challenges Program Seminar", "Credits": "1", "Description": "This seminar supports students in intentionally designing their pathway through the Grand Challenge Scholars Program by the selection and creation of their qualifying experiences, provides students with a forum to exchange their experiences and insights with each other, and offers scaffolding for them to build their e-portfolios and reflect on their experiences.", "Grading": "Graded", "Course ID": "102474", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GCSP 301 with a ‘C’ or better."}, {"Course": "GCSP 401", "Name": "Grand Challenges Leadership Seminar", "Credits": "1", "Description": "This seminar provides an opportunity for students completing the Grand Challenge Scholars Program to reflect on their experiences, share their learning and insights with new Scholars, and engage in outreach to the broader UMBC and local community. Students will work towards completion of their e-portfolios, mentor and help to train the entering cohort of Scholars, and present their experiences and knowledge they have learned in class and in public forums on and off campus. Permission required.", "Grading": "Graded", "Course ID": "102517", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GCSP 302 with a grade of ‘C’ or better."}, {"Course": "GREK 101", "Name": "Elementary Greek I", "Credits": "4", "Description": "Fundamentals of ancient classical Greek.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54573", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "GREK 102", "Name": "Elementary Greek II", "Credits": "4", "Description": "Continuation of GREK 101.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54575", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 101. with a C or better."}, {"Course": "GREK 201", "Name": "Intermediate Greek", "Credits": "4", "Description": "Selections from Xenophon, Plato, The Septuagint, the New Testament.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54579", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 102 or Equivalent with a C or better."}, {"Course": "GREK 350", "Name": "Septuagint", "Credits": "3", "Description": "Selections from the Greek version of the Old Testament. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50103", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Same as Offered": "RLST 352 ", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better."}, {"Course": "GREK 351", "Name": "New Testament Greek", "Credits": "3", "Description": "Selections from the New Testament. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50102", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Same as Offered": "RLST 351 ", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better"}, {"Course": "GREK 352", "Name": "Greek Tragedy and Comedy", "Credits": "3", "Description": "Selections from Aeschylus, Sophocles, Euripides and Aristophanes. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54582", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better"}, {"Course": "GREK 361", "Name": "Greek Oratory", "Credits": "3", "Description": "Selections from fifth and fourth century B.C.E. orators such as Lysias and Demosthenes. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54583", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better"}, {"Course": "GREK 362", "Name": "Selections from Greek Historians", "Credits": "3", "Description": "Xenophon, Herodotus and Thucydides. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54584", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better"}, {"Course": "GREK 371", "Name": "Homer", "Credits": "3", "Description": "Selections from The Iliad and The Odyssey. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54585", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better."}, {"Course": "GREK 372", "Name": "Plato", "Credits": "3", "Description": "Readings in the literary and political thought of Plato. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54586", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better."}, {"Course": "GREK 381", "Name": "History of Greek Literature I", "Credits": "3", "Description": "Lectures and assigned readings on the development of Greek literature. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54587", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better."}, {"Course": "GREK 382", "Name": "History of Greek Literature II", "Credits": "3", "Description": "Continuation of GREK 381. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54588", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete GREK 201 or Equivalent with a C or better."}, {"Course": "GREK 395", "Name": "Independent Reading in Greek", "Credits": "1", "Description": "This course is repeatable for credit. Students may complete a maximum of 15 credits. Recommended Preparation: GREK 201 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54589", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "GREK 401", "Name": "Special Author Seminar", "Credits": "3", "Description": "The author to be studied will be assigned by the instructor. This course is repeatable for credit. Students may complete a maximum of 15 credits. Recommended Preparation: GREK 201 and permission of department.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54590", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HAPP 100", "Name": "Survey of U.S. Health Care System", "Credits": "3", "Description": "This course provides an overview of the U.S. health system, giving students foundational knowledge in health policy, public health, and health administration. Student will examine different aspects of the health system and how those parts relate to each other. HAPP 100 also addresses the social, political, and economic factors involved in health and the health system. A grade of C or better in the course is required for the major.", "Grading": "Graded", "Course ID": "51072", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HAPP 100Y ", "Attributes": "Social Sciences (GEP)"}, {"Course": "HAPP 100Y", "Name": "Survey of the US Healthcare System", "Credits": "4", "Description": "This course provides an overview of the U.S. health system, giving students foundational knowledge in health policy, public health, and health administration. Student will examine different aspects of the health system and how those parts relate to each other. HAPP 100 also addresses the social, political, and economic factors involved in health and the health system. A grade of C or better in the course is required for the major.", "Grading": "Graded", "Course ID": "102557", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HAPP 100 ", "Attributes": "Social Sciences (GEP)"}]