[{"Course": "GWST 315", "Name": "Modern Masculinities", "Credits": "3", "Description": "By integrating theoretical and experiential perspectives, this course explores the social construction of masculinities and their intersections with other systems of inequality, such as race, class, and sexuality. Drawing on the contemporary feminist and masculinity studies scholarship on men and masculinities, the course examines the multiple and hierarchically organized configurations of masculinities primarily within the U.S. context. However, an overall global approach is also pursued through an investigation of the linkages between formations of globalization and masculinities. Recommended Preparation: GWST 100 or GWST 200 ", "Grading": "Graded", "Course ID": "102060", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "GWST 320", "Name": "Transnational Feminist Film", "Credits": "3", "Description": "This course uses a feminist film studies lens to analyze transnational documentary and feature films. Drawing on feminist, documentary, and postcolonial film theory, students will gain the necessary skills to critically analyze representations of gender, race, class, nationality, and sexuality in transnational film. We will examine the politics of gender in films produced in the West and the Global South and we will assess the flows between “first world” and “third world” cinematic traditions.  Recommended Preparation: GWST 100   and GWST 200 , or GWST 210 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "050105", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Same as Offered": "MLL 320 "}, {"Course": "GWST 321", "Name": "Queer Representation in Film and TV", "Credits": "3", "Description": "This course will utilize films, television programs and theoretical, historical, and analytic readings to focus on the ways in which LGBTQ people and queer issues have been represented historically in film and television, and how issues of homosexuality intersect with issues of race and gender. Using material from before and after the modern LGBTQ rights movement, we will explore such themes and stereotypes as sissies, mannish lesbians, cross dressing/drag, AIDS, transgender, bisexuality, and others.  Recommended Preparation: GWST 100, GWST 200, or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54593", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "GWST 322", "Name": "Gender, Race, and Media", "Credits": "3", "Description": "This course critically examines how ideologies of gender, race, class, ethnicity and sexuality are produced and disseminated in a range of media genres and forms such as film, television, music, advertising, news, visual and performing arts, the Internet, radio, and print media. As consumers and producers of media, students will learn to assess how media articulates, creates, and enforces identities and power. Students will practice tools of critical reading and thinking, such as textual analysis, visual discourse analysis, and the basics of media literacy. Recommended Preparation: GWST 100  and (GWST 200  or GWST 210).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50004", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 347, MLL 322 "}, {"Course": "GWST 323", "Name": "Gender and Sitcoms", "Credits": "3", "Description": "The course studies the relationship between changing gender roles and the leading ladies of television situation comedy between the 1950s and the 1990’s with particular emphasis on the sitcom form and the representation of domesticity. The course explores the second wave of US feminist history and shifting sitcom roles of wife, mother and working women during this period. Text studied will include: Mary Tyler Moore, The Honeymooners, Leave It to Beaver, Murphy Brown, I Love Lucy, Bewitched, Roseanne, The Burns and Allen Show and Father Knows Best. Feminist readings, analysis and discussion support the understanding of the media.", "Grading": "Graded", "Course ID": "100365", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "GWST 325", "Name": "History of Women in America to 1870", "Credits": "3", "Description": "This course examines the changing roles of women in American society from colonial times to 1870 and covers such topics as family, work, rebellion, religion, sexuality, slavery, reform movements and early efforts for women’s rights. Emphasis is placed on both the variety of women’s experiences and the evolving concerns and position of American women as a group. Recommended Preparation: Any 100-level social science course, junior/senior standing or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50112", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 325 "}, {"Course": "GWST 326", "Name": "History of Women in America Since 1870", "Credits": "3", "Description": "A study of the changing roles of women in American society since 1870, focusing on such topics as work, higher education and the professions, social reform, the suffrage movement, war and peace, working-class and immigrant women, birth control and sexual freedom, and the rebirth of feminism. Emphasis is placed on both the variety of women’s experiences and the evolving concerns and position of American women as a group. Recommended Preparation: Any 100-level Social Science course or junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50130", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 326 "}, {"Course": "GWST 327", "Name": "African American Women’s History", "Credits": "3", "Description": "This course traces the history of African -American women in the United States, beginning with their ancestors’ history in pre-colonial Africa and U.S. slavery to the present. Topics covered include work; family roles; activism; achievements; and bouts with racism, sexism and poverty. Recommended Preparation: Any 100-level Social Science course or 200-level Literature course or junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50010", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 354, HIST 323 "}, {"Course": "GWST 328", "Name": "Women, Gender, Sexuality, and Political Power in the U.S.", "Credits": "3", "Description": "This course analyzes the relationship between gender, politics, and policy primarily in the United States understood in a cross-cultural context. It examines the theoretical and historical construction of “women” as a group and the impact of gender and sexuality on citizenship, election, political office, and public policy. The intersection of gender, class, race, ethnicity, sexual orientation, and other identities provides an important theoretical frame through which political debates will be analyzed. Recommended Preparation: One course each in POLI and GWST, or one cross-listed POLI/GWST course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50129", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 328 "}, {"Course": "GWST 330", "Name": "Gender and Women in the Classical World", "Credits": "3", "Description": "What do we and can we know about the lives of women in ancient Greece and Italy, and how did women and men interact? In this course, archaeological and written evidence will be examined to reconstruct the activities, status and images of Greek, Etruscan and Roman women and place them within their historical and cultural contexts. Attention will be paid to the way both ancient and modern views about women and men influence our understanding of the past and present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50042", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Writing Intensive (WI), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "ANCS 320 "}, {"Course": "GWST 332", "Name": "Human Sexuality in Sociological Perspectives", "Credits": "3", "Description": "The course focuses upon sociological forces that influence sexuality and govern its expression. Topics include the sexual socialization of children and adolescents; teenage pregnancy; sexuality of single, married and older adults; governmental and educational services related to sexuality; sexual orientation; pornography; and sexual coercion. Recommended Preparation: SOCY 101 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50132", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 332 "}, {"Course": "GWST 333", "Name": "Human Sexuality in Cross-Cultural Perspective", "Credits": "3", "Description": "Norms and mores that sanction and regulate human sexuality exist universally, but their particular forms vary widely from one society to another. This course examines theories that offer a sociological explanation for the variation of sexual attitudes and behaviors in both industrialized and nonindustrialized societies. Recommended Preparation: SOCY 101 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50131", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)", "Same as Offered": "SOCY 333 "}, {"Course": "GWST 338", "Name": "Women, Gender, and Law", "Credits": "3", "Description": "This course examines how American civil and criminal legal systems shape gender and identity. It explores gender and intersectional identities in society and the historical development of women’s citizenship and legal rights. Using case law as the primary text, the course focuses on statutory remedies to discrimination in employment and education, reproduction and personal life, and the response of criminal law to domestic violence, rape, and sex work. Recommended Preparation: One prior course in Political Science or Gender and Women’s Studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50109", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "POLI 338 "}, {"Course": "GWST 340", "Name": "Women, Gender and Globalization", "Credits": "3", "Description": "This course focuses on how gender influences social, economic, and political forms of globalization, development, labor and migration, international sexual and health politics, and activism in various regions outside of the United States. We start with representations and consider how “women” have been constructed as a group cross-culturally and as part of feminist imaginaries. We analyze case studies of global and transnational movements for change led by women around the world. Finally, we discuss the ways in which gender matters as a framework for understanding global relationships and politics.", "Grading": "Graded", "Course ID": "54595", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "GWST 342", "Name": "Gender in Modern South Asia", "Credits": "3", "Description": "This course examines how gender operates as an organizing force in social, political, and economic life in South Asian countries such as India, Pakistan, Bangladesh, Nepal and Sri Lanka. We will start by discussing representations of South Asian women from the colonial to the post-colonial period, and then using case studies, we will explore contemporary debates related to nationalism, family relationships, sexuality, labor and migration, development, globalization and social movements in South Asia. Students taking this course will gain an understanding of the complex histories of the region, the relationship between colonialism, nationalism, postcolonial politics, identity and contemporary gender issues. Recommended Preparation: GWST 100 or ASIA 100 ", "Grading": "Graded", "Course ID": "101900", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "GWST 343", "Name": "Gender, Human Rights, and Political Violence in Latin America", "Credits": "3", "Description": "This class examines the politics of human rights and cultural representations of gender violence in contemporary Latin American history. Focusing on specific moments of state-sponsored violence in Latin America, the class will explore broader issues relating to Western and Third World discourses on human rights, feminism and gender relations. Students taking this course will gain an understanding of the histories of the region, the relationship between universal human rights, nationalism, political violence and contemporary gender issues. Recommended Preparation: GWST 100  or GLBL 100 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102012", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "GWST 344", "Name": "Transnational Femininities", "Credits": "3", "Description": "This course studies femininity in a trans/national context. “Trans” suggests that we will discuss femininity as something performed by and written on many kinds of bodies, not only those assigned female at birth. “Transnational” denotes that we will situate femininity in the US, across multiple nations, and within a broad sociocultural framework. We will discuss how class, bodily comportment, sexuality, nation, ability, and religion affect feminine performance and feminine/feminist/queer politics. Recommended Preparation: GWST 100  or GWST 210 ", "Grading": "Graded", "Course ID": "102477", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "GWST 345", "Name": "Unruly Bodies", "Credits": "3", "Description": "Drawing on feminist, queer, social, and critical race theory, this course examines the status of the body in both historical and contemporary debates about identity, representation, and politics. We tend to take the body for granted as the ground of experience and knowledge, but this course challenges that common sense, asking how the body is produced, managed, and deployed in a various ways to discipline and manage populations. We will also investigate the political possibilities of body work to resist and reshape these same disciplinary practices, paying particular attention to “queer” forms of embodiment. Recommended Preparation: GWST 100 or GWST 200.", "Grading": "Graded", "Course ID": "101763", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "GWST 348", "Name": "Black, Queer, and Feminist Film", "Credits": "3", "Description": "This course examines prominent themes in films that fall within the categories  “Black,” “Queer,” and “Feminist.” Most of the films are narrative, dealing with issues involving race, gender, and sexuality. This course is not just about watching films. It makes extensive use of critical historical and theoretical texts from the disciplines of psychoanalysis, feminism, literary and queer theory, as well as from film history, art history, and critical theory. Prior knowledge of film-making and/or film history/theory is not required. Recommended Preparation: GWST 210 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102061", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 349", "Name": "Gender, Sexuality and Theatrical Performance.", "Credits": "3", "Description": "The course explores representations of both gender and sexual identity in contemporary Western theatre and performance art. Specifically, we will study how representations of gender and sexuality in performance both replicate and resist normative roles and stereotypes. The course investigates feminist and queer critiques of theatrical performance, as well as the meaning of female and queer characters in dramatic literature and their embodiment on the stage.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50110", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "THTR 349 ", "Prerequisite/Corequisite": "You must have Sophomore Standing."}, {"Course": "GWST 352", "Name": "Women, Gender, and Information Technology", "Credits": "3", "Description": "This course examines critical issues concerning women, gender, and information technology. It considers women’s critical contributions to technology, from the 19th century Analytical Engine to contemporary cybersecurity industry; how women and girls fare in IT educational and professional settings; and how these issues intersect with multiple dimensions including nationality, race, class, and age. Students connect these issues to their personal experiences, academic plans, and career choices. ·", "Grading": "Graded/Pass Fail", "Course ID": "50049", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 352H , GWST 352H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "CMSC 352, IS 352 ", "Prerequisite/Corequisite": "You must have completed one IS, CMSC, or GWST course with a grade of C or better."}, {"Course": "GWST 352H", "Name": "Women, Gender, and Information Technology", "Credits": "3", "Description": "This course examines important issues concerning women, gender, and information technology (IT). It considers women’s contributions to technology, from the 19th century Analytical Engine to contemporary cybersecurity industry; how women are impacted by technology; how women and girls fare in IT educational settings; and the way these issues intersect with multiple dimensions of experience, such as nationality, race, class and age. Students will connect these issues to their ow n experiences, including academic and career choices, and will utilize information technology to completing course assignments.", "Grading": "Graded/Pass Fail", "Course ID": "100342", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 352", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "CMSC 352, IS 352", "Prerequisite/Corequisite": "You must have completed one IS, CMSC, or GWST course with a grade of C or better."}, {"Course": "GWST 353", "Name": "Marriage and the Family", "Credits": "3", "Description": "Marriage and family as social institutions. Primary relationships in marriage, their development in courtship, formalization in marriage and extension to children. The course draws on materials from related disciplines, as well as from sociology. Special emphasis on marriage and change in sex roles in modern societies. Recommended Preparation: SOCY 101 or ANTH 211 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50134", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "SOCY 353 "}, {"Course": "GWST 355", "Name": "The Sociology of Gender", "Credits": "3", "Description": "This course introduces the key concepts sociologists have contributed to the study of gender.  We will examine the origins and development of those concepts and empirical work on the sociology of gender in the last three decades. Intersectional feminist theories and research will be emphasized, as we examine how gender is socially constructed within ethno-racial contexts. Students will also be introduced to global/transnational concerns, studies of masculinities, the body and sexuality studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50117", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "SOCY 355 ", "Prerequisite/Corequisite": "You must have completed SOCY 101  or ANTH 211 or GWST 100 , any with “C” or better."}, {"Course": "GWST 356", "Name": "The Psychology of Sex and Gender", "Credits": "3", "Description": "An examination of the psychology and biology of sex and gender differences. The major focus of the course is an examination of the psychological and social factors that lead to the development of sex and gender differences and similarities in behavior. Sexuality and variations in sexual orientation will be discussed. Research on both sexes (biological construct) and gender (consequence of socialization) will be included. Diversity and variation on concepts will be explored.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50116", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PSYC 356 ", "Prerequisite/Corequisite": "You must have completed PSYC 100  and one other PSYC course both with a C or better."}, {"Course": "GWST 357", "Name": "The Psychology of Women and Gender", "Credits": "3", "Description": "This course examines theories and scientific research on the physical, cognitive, emotional, and social aspects of the psychology of women, as well as topics such a feminist psychology, intersetionality, bias in psychological research, sexual orientation, sexuality, lifespan development, and health. The psychology of persons outside the gender binary is also discussed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50115", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PSYC 357 ", "Prerequisite/Corequisite": "You must have completed PSYC 100  and one other PSYC course both with a ‘C’ or better."}, {"Course": "GWST 364", "Name": "Perspectives on Women in Literature", "Credits": "3", "Description": "Reading and analysis of literature by or about women. The course intends to familiarize students both with major women writers and with ways in which women have been portrayed in literature. Particular attention will be paid to issues of canonization, gender and genre, as well as to the development of a female literary tradition. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50085", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Arts and Humanities (GFR)", "Same as Offered": "ENGL 364 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "GWST 365", "Name": "Black Women Novelists", "Credits": "3", "Description": "In this course, students will read and analyze the first-person narratives of African and diasporan women to understand how women have used language to define and empower themselves in conformity to or in opposition to the social conventions and political ideologies of their societies. Personal narratives such as letters, diaries, memoirs, essays, journals and autobiographies will be read as literary texts - which are imaginative, reflexive and symbolic - and as social documents - which underscore the ways in which race, class, gender and sexual orientation affect the lives of black women. Texts will be examined within the framework of feminist, particularly black feminist theory and practice. Recommended Preparation: GWST 100/GWST 370/AFST 370.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100003", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 366", "Name": "Doin’ It: Case Studies in the History of Western Sexuality", "Credits": "3", "Description": "This course will explore how sexuality works in Western history. We will work with the contention that sexuality, along with connected notions of masculinity and femininity, are largely social constructions, and have been the object of intense social scrutiny and political regulation. We will investigate sexual desire and behavior, and sexual and gender ideologies, and will explore how they relate to a variety of topics such as race, marriage, reproduction, same-sex relations, religion, and the politics of state building. Recommended Preparation: Any 100 Social Science or Culture course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101930", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)", "Same as Offered": "HIST 366 "}, {"Course": "GWST 367", "Name": "The Anthropology of Gender", "Credits": "3", "Description": "The Anthropology of Gender concerns the wide range of meanings given to gender and sexuality in different settings. In exploring how gender and sexuality are culturally constructed the course does not focus on the biology of gender and sexuality per se. Rather, the course explores distinctive peoples’ understandings of gender and sexuality. Lectures focus on basic principles by which to examine gender in cross-cultural perspective. Readings focus on detailed and complex examples of distinctive gender and sexuality systems.", "Grading": "Graded", "Course ID": "102062", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ANTH 367 ", "Prerequisite/Corequisite": "You must complete ANTH 211  or SOCY 101   with a C or better."}, {"Course": "GWST 370", "Name": "Black Women: Cross-Cultural Perspectives", "Credits": "3", "Description": "A comparative examination of selected social and psychological factors that influence the lives of black women in Africa and the diaspora. Recommended Preparation: AFST 100, GWST 100 or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50007", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 370 "}, {"Course": "GWST 371", "Name": "The Female Offender", "Credits": "3", "Description": "An examination of causes and incidence of female crime and the exploration of major theories from Freud to the feminist. Community response to female crime and alternative forms of treatment are evaluated. Recommended Preparation: AFST 271 or junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50009", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AFST 371 "}, {"Course": "GWST 373", "Name": "“Do Muslim Women Need Saving?” Women and Gender in Islam", "Credits": "3", "Description": "This course will introduce students to the study of Islam and gender, explore the evolution of scholarship that uses gender as a category of analysis, and uses case studies to bring theories into everyday lived experiences in Muslim societies. Topics will cover: new interpretations from feminist scholars over the Quran and early Islam, questions of veiling, seclusion, and sexuality in Muslim empires, the status of women in debates over colonialism and nationalism, gender and revolution, masculinities, and Islamism. Recommended Preparation: Any 100-level social science course, any 100-level humanities course", "Grading": "Graded", "Course ID": "102797", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 379 "}, {"Course": "GWST 374", "Name": "European Women’s History 1200-1750", "Credits": "3", "Description": "An examination of the status and roles of women in European society through out the Middle Ages and Early Modern period. Through a mixture of secondary readings, primary sources, and film, this course investigates ideas about women and gender as well as the actions and ideas of women in the past. Topics include women and religion, women and work, women’s household and familial roles, women and sexuality, women and politics, and women’s education and writings. Recommended Preparation: Any 100-level social science course or junior/senior status", "Grading": "Graded", "Course ID": "50135", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 374 "}, {"Course": "GWST 375", "Name": "European Women’s History 1750-Present", "Credits": "3", "Description": "Examination of women in European society from the mid-eighteenth century to the present. The course emphasizes women’s life experiences within the context of larger historical changes in Europe (including the economy, cultural life, and social movements). Thus, a major goal of the course is to present women’s history both as an integral part of European social and cultural history and as a unique subject of historical investigation. Students will learn to think critically about historical arguments and to understand both the difference that gender makes in history and the differences among women’s historical experiences. The course will examine how diversity of class, race and nation shaped women’s lives by focusing on white aristocratic, middle-class and working- class women, as well as colonized and women of color. Recommended Preparation: Any 100-level social science course, 100-level literature course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50123", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 375 "}, {"Course": "GWST 376", "Name": "European Women’s History, 1914", "Credits": "3", "Description": "An examination of the role of women in European society from the eve of World War I until the present. Because the approach will be from a political, social, economic and cultural history perspective, readings will include a women’s history textbook, primary documents, autobiographical and biographical sketches, historical fiction and scholarly analysis of the role of gender in 20th-century Europe. Recommended Preparation: Any 100-level social science course, 200-level literature course, junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50104", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 376 "}, {"Course": "GWST 377", "Name": "Women and Social Policy", "Credits": "3", "Description": "This course explores the impact of social welfare programs and policies upon women’s lives, examines the assumptions and values that have gone into the formulation of these policies, and discusses alternative approaches to dealing with women’s concerns. Topics include economic circumstances, women and violence, traditional and alternative social services, and agendas for reform.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50136", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "SOWK 377"}, {"Course": "GWST 378", "Name": "Women, Gender and Science", "Credits": "3", "Description": "This course explores how the sciences have conceptualized and explained various forms of difference-what scientific knowledge says about sex, gender, race, sexuality, and other identity categories-as well as whether gender and race shape the “doing” of science-(how) does identity matter in scientific practice? Through a series of writing and research projects, the course asks students to untangle the complex relationship between scientific knowledge and social inequality, and to consider role of scientific practice in social change. Recommended Preparation: GWST 100, or GWST 200.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51374", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Gndr, Science And Tech", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "GWST 379", "Name": "Intimate Partner Violence, A Social Work Perspective", "Credits": "3", "Description": "Intimate partner violence (IPV) is a social and public health problem that impacts millions of people around the globe. Although efforts have been made to end IPV, it has persisted over time. This course introduces students to basic concepts of IPV, theories used to understand it, as well as systems involved in addressing it. The goal is to help students think critically about the factors that perpetuate IPV. Recommended Preparation: SOWK 250 ", "Grading": "Graded", "Course ID": "102705", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOWK 376 ", "Prerequisite/Corequisite": "Student must have completed PSYC 100 or SOCY 101 with a grade of ‘C’ or higher."}, {"Course": "GWST 380", "Name": "Women and Gender in Asia", "Credits": "3", "Description": "An examination of the role of women and gender in Japan, China and Korea since ancient times. Topics include the influence of gender roles in work, marriage, sexuality and birth control practices. Scholarly analysis, historical fiction and film will be used. Recommended Preparation: Any 100-level social science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50127", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "HAPP 380 "}, {"Course": "GWST 381", "Name": "Reproductive Justice in the US", "Credits": "3", "Description": "The course investigates the history and cultural politics of reproduction in the U.S, including 19th century criminalization of contraception and abortion as well as the 20th century liberalization of those laws. Special attention is given to gendered assumptions about heterosexual practices, family formation, and national belonging underlying these debates; the organized advocacy for women’s sexual and reproductive rights; and how intersecting sexual, racial, religious, and international politics have shaped domestic and foreign population policy. Recommended Preparation: GWST 100  and (GWST 200 , or GWST 300)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54596", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 382", "Name": "Perspectives on the Family", "Credits": "3", "Description": "An investigation of family life in America in various historical periods and among different subgroups. Three themes or questions dominate the course: the relationship of the family to the social context within which it exists; the nature and cause of different forms of family life within various American subcultures, past and present; and the extent to which the family has changed and not changed during several centuries. Specific families examined include the colonial New England family, the 19th-century urban middle class, the ethnic family, the black family and the contemporary family. Within each of these types of family experience, specific topics to be investigated include the role of women, relationships between women and men, attitudes toward children, modes of childrearing, housing styles and others. As part of the course, students examine their own family history. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50035", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AMST 382 "}, {"Course": "GWST 383", "Name": "History and Politics of Sexuality", "Credits": "3", "Description": "Sexuality is often considered a timeless fact of human existence, but it too has a history. Using an interdisciplinary approach, this course introduces students to ways of thinking historically about sexuality, its politics, and its changing role in personal, social, and economic life. Using case studies from different times and places, students will learn to think critically about the social-historical production of sexuality as well as how those productions shape current conceptions of sexuality, sexual orientation, gender, identity, and politics. Recommended Preparation: GWST 210.", "Grading": "Graded", "Course ID": "101812", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 390", "Name": "Topics in Gender and Women’s Studies", "Credits": "3", "Description": "A critical examination of selected issues in gender and women’s studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51375", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Tv’s Funny Ladies, Gender And Aging, Violence Against Women, Queer Represent Film/Tv, Gender &amp; American Comedy, Gender &amp; The Environment, Romantic Women Writers, Polit. Economy Of Gender, Women’s Health, Studies Of Masculinities, Issues &amp; Phases Of Hlth., Issues In Women’s Health, Amer Women In War Times, Cult Poli Of Population, Gender And Nationalism, Gender and Sexuality in Asian/American Visual Cult, Contemporary Arts in the Non-Western World, Black, Queer and Feminist Film, Feminist Internat’l Relations, Unruly Bodies, Gender in Modern South Asia, Diagnosing Gender, Gender and Human Rights in Latin America, Gender and International Development, Anthropology of Gender, Modern Masculinities, Race, Humor, &amp; 90’s Television, Transnational Femininities, Early Modern Women’s Voices, Founding Feminisms, Nineteenth Century Feminism, Mod Human Rights/Trafficking, Women and Gender in Islam"}, {"Course": "GWST 391", "Name": "The Philosophy of Sex", "Credits": "3", "Description": "An examination of the philosophical aspects of human sexuality. Topics include theories of sexual desire and sexual activity; the concept of sexual perversion; the moral evaluation of sex acts; feminist analysis of the sexual relations between men and women; and the moral status of homosexuality, adultery, pornography and abortion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50122", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PHIL 391 ", "Prerequisite/Corequisite": "You must have taken (1) PHIL course and received a grade of “C” or better before taking this course."}, {"Course": "GWST 392", "Name": "Topics in Critical Sexuality Studies", "Credits": "3", "Description": "A critical examination of selected issues in critical sexuality studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Recommended Preparation: GWST 210 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102085", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Transnational Femininities, Diagnosing Gender"}, {"Course": "GWST 400", "Name": "Senior Independent Study", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51175", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 401", "Name": "Special Projects in Gender and Women’s Studies", "Credits": "1", "Description": "Intended for students who wish to study independently an aspect of gender and women’s studies not covered by regular course offerings. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Junior/ senior standing, at least six prior credits in gender and women’s studies courses and written permission of the instructor who will supervise the project", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51176", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "GWST 413", "Name": "Language, Gender and Sexuality", "Credits": "3", "Description": "In Language, Gender and Sexuality, students gain an in-depth understanding of how language, gender, and sexuality are integrated into the fabric of cultures and societies and how sociocultural contexts give meaning to linguistic practices, to categories of gender and sexuality, and to the construction of gendered, sexual, and other identities.. Students will examine and evaluate a diverse body of scholarship from linguistics, anthropology, gender and sexuality studies, and sociology. Critical attention will be paid to understanding the roles of language, gender and sexuality in the U.S. context, especially with regard to education and the media; we will also explore relationships between language, gender, and sexuality in the range of other Western and non-Western cultures. Students will apply what they have learned in the course to final research projects.", "Grading": "Graded", "Course ID": "100279", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 613, LLC 613, MLL 413 , MLL 613"}, {"Course": "GWST 433", "Name": "Gender, Work, and Family in Cross-Cultural Perspective", "Credits": "3", "Description": "Work and family relationships as affected by gender stratification. Topics include separation of work and family, division of household labor, gender-wage differences, occupational segregation, impact of government work, and family policies on women and men.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50121", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Same as Offered": "SOCY 433 ", "Prerequisite/Corequisite": "You must complete SOCY 101  or GWST 100  and ENGL 100  or equivalent with a grade of C or better and your academic standing must be junior."}, {"Course": "GWST 434", "Name": "Gender and the Life Course", "Credits": "3", "Description": "This course examines the complex interactions of two critical social constructs: gender and the life course. Material will examine how these constructs have developed over time, how they vary across cultures and historical periods and how they interact to construct very different lives for males and females in society. Specific foci of the course include demographic and biological underpinnings of gender and the life course, age stratification systems, and times of family and other life events by gender.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50107", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 434 ", "Prerequisite/Corequisite": "You must complete SOCY 101 or GWST 100 with a minimum grade of C and your academic standing must be junior."}, {"Course": "GWST 439", "Name": "Women in Africa and the Diaspora", "Credits": "3", "Description": "This course uses the comparative approach to examine the experiences of women of African descent from the era of the trans-Atlantic slave trade to the present. It will introduce students to interdisciplinary and comparative theories and materials that will enable them to explore the economic, cultural, social and political roles of women in Africa and African descended women in the United States. Using comparative gender analysis as its theoretical focus with a global perspective, the course emphasizes the diverse, shared historical experiences of women of African descent as enslaved persons, colonial subjects and victims of all forms of oppression as well as agents of social change. Examined as well are their roles in society as mothers, daughters, wives and workers along with their participation in social and political movements since the abolition era. The course also highlights how such other social indexes as class, race, ethnic, national and religious backgrounds affect women’s lives and roles in society. Problems and issues that directly affect them and how to improve their status in the face of increased globalization will be explored.", "Grading": "Graded", "Course ID": "100280", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AFST 439"}, {"Course": "GWST 444", "Name": "Psychology of Sexual Orientation & Gender Identity", "Credits": "3", "Description": "Survey and critique of psychological research in the areas of sexual orientation and gender identity, covering operational definitions/scientific methods, history of sexual orientation and gender in the mental health field, cause theories, developmental issues across the life span, discrimination and violence, and mental health issues.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102390", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "GWST 450", "Name": "Internship", "Credits": "1", "Description": "This course offers practical work experience in businesses, agencies and organizations dealing with women’s concerns (e.g., Maryland Commission for Women, Planned Parenthood, National Women’s Health Network). This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Sophomore standing, GPA of 2.5 or higher, at least six prior credits in gender and women’s studies courses and written permission of the program director.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51067", "Consent": "No Special Consent Required", "Components": "Field Studies"}, {"Course": "GWST 452", "Name": "WILL Internship Seminar", "Credits": "2", "Description": "This seminar links GWST course materials to advanced activist and leadership activities. Students coordinate and lead the WILL membership to plan and implement activist projects. Internship students also produce written guides for use by future WILL members for organizing activities. Particular attention will be paid to defining problems, creative responses, and how to build coalitions with stakeholders across the campus and wider community.", "Grading": "Pass/Fail", "Course ID": "51019", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 458", "Name": "Advanced Topics in Feminist Philosophy", "Credits": "3", "Description": "A detailed examination of some single field of feminist philosophy. Topics will vary from year to year but are likely to include the following: feminist ethics, feminist epistemology and feminist aesthetics. In each case, the class will focus on the theoretical and practical impact of feminist thinking on these traditional areas of philosophy. We will critically discuss the relevance of women’s lived experience for philosophical theorizing. Recommended Preparation: Two of the following PHIL 258, PHIL 350, PHIL 368, PHIL 371, PHIL 373 , PHIL 372, GWST 480 or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50120", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PHIL 458 ", "Prerequisite/Corequisite": "You must complete (2) PHIL courses (at least one 300 level), with a grade of C or better to take this class."}, {"Course": "GWST 464", "Name": "Studies in Women and Literature", "Credits": "3", "Description": "The study of literature by or about women with an introduction to feminist literary theory and methods. The course will address questions of canonicity and a female literary tradition. It will examine the relationship between gender and genre, identify patterns of gender representation, and introduce students to key terms and questions in the scholarly study of gender and sexuality. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "1891", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ENGL 464 ", "Prerequisite/Corequisite": "You must complete any 300 level English Course with a grade of C or better"}, {"Course": "GWST 469", "Name": "Masculinity and Femininity in the Middle Ages", "Credits": "3", "Description": "This course considers how medieval society defined femininity and masculinity, appropriate male and female behavior, and men and women’s bodies. Close study of primary and secondary sources will help answer these questions: What did it mean to be masculine/feminine within medieval culture? Who created these definitions? How were the definitions challenged? What role does sexual behavior play in these definitions? How do other categories, like economic class, religion, and ethnicity complicate ideas about gender?  Recommended Preparation: HIST 201  and HIST 362  or HIST 366  or GWST 100  or GWST 210 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102172", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 469 "}, {"Course": "GWST 480", "Name": "Theories of Feminism", "Credits": "3", "Description": "This course examines significant debates in feminist social and political theory. The class will read major foundational and contemporary works. It takes an intersectional approach, focusing particularly on social constructions of race, ethnicity, nationality, religion, class, and sexuality. It draws on U.S. and transnational feminist sources to investigate causes and consequences of gender difference, hierarchies, and inequalities. Throughout the course, consideration is also given to the relationships between feminist theory and contemporary social justice movements. Recommended Preparation: GWST 100 and GWST 200.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51020", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 485", "Name": "Sexuality and Queer Theory", "Credits": "3", "Description": "This course is a seminar in sexuality and queer theory. The primary focus is critical engagement with social, political, and cultural theories of the social construction of sexuality and sexual identities, and of the sources, causes, and effects of sexual inequality and strategies for reducing or eradicating inequality. While emphasis will be placed on theories of sexuality, substantial time will be spent on theories of how sexuality is implicated in and supported by other forms of inequality such as gender, race, ethnicity, and class.", "Grading": "Graded", "Course ID": "101764", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 490", "Name": "Advanced Topics in Gender and Women’s Studies", "Credits": "3", "Description": "Advanced investigation of selected topics in gender and women’s studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51332", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Women & Poli Latin Amer, Language And Gender, Advanced Topics In Gwst, Femin & Masc Middle Age, Women & Politics:Latn Am, Seminar:Art Hist & Theor, Women in African Diaspora, Critical Studies of Pornography, Latin American Women Writers, Gender, Ideology & War in 20th Centure Europe, Environment,Science,Gender&Politics/Chemical World"}, {"Course": "GWST 491", "Name": "WILL Senior Seminar", "Credits": "2", "Description": "This WILL-only seminar serves as a capstone course for the WILL program. Students will reflect on their involvement in the program and produce plans of action to continue their activist work after graduation. Readings and assignments will help students build their toolboxes for continuing their activism and civic agency outside the university setting.", "Grading": "Pass/Fail", "Course ID": "51179", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 492", "Name": "Advanced Topics in Critical Sexuality Studies", "Credits": "3", "Description": "Advanced investigation of selected topics in critical sexuality studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Recommended Preparation: GWST 210  or GWST 345 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102086", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 495", "Name": "Colloquium: Research and Activism", "Credits": "3", "Description": "The Colloquium provides an opportunity to integrate the subject matter and interdisciplinary methodologies of the major program by focusing on a significant problem in the study of gender and women’s issues and activism. Emphasis is placed on student involvement in both the process and the content of gender analysis. Written and oral reports and a research paper are required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51126", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed GWST 100  and GWST 300  and GWST 480  and ENGL 100  or equivalent with a C or better."}, {"Course": "GES 102", "Name": "Human Geography", "Credits": "3", "Description": "Study of the distribution of human activities and the causes and consequences of these distributions, including population, resources, economic activity, urban and rural settlements and cultural phenomena.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51313", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GES 102Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "GES 102Y", "Name": "Human Geography", "Credits": "4", "Description": "Study of the distribution of human activities and the causes and consequences of these distributions, including population, resources, economic activity, urban and rural settlements and cultural phenomena.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54543", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "GES 102 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "GES 105", "Name": "World Regional Geography", "Credits": "3", "Description": "A survey of world regions illustrating the interaction of physical and cultural processes. These processes are examined in the context of problems confronting different cultures in contrasting environments. The course deals with regional stresses and conflicts and their geographic implications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51149", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "GES 110", "Name": "Physical Geography", "Credits": "3", "Description": "Study of the principles and processes of climate, earth materials, landforms, soils and vegetation that give logic to their integrated patterns of world distribution.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51203", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GES 110Y ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 110Y", "Name": "Physical Geography", "Credits": "4", "Description": "Study of the principles and processes of climate, earth materials, landforms, soils and vegetation that give logic to their integrated patterns of world distribution.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54544", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "GES 110 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 111", "Name": "Principles of Geology", "Credits": "3", "Description": "An introduction to the structure, composition, historical evolution and surface features of the earth. Topics include the geologic time scale and radiometric dating; major groups of rocks and minerals; sedimentation and stratigraphy; plate tectonics, seismicity, volcanism, mountain-building and geologic structures; weathering and soil formation; and sculpture of the land by surficial processes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51363", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 120", "Name": "Environmental Science and Conservation", "Credits": "3", "Description": "An introduction to the interdisciplinary study of how the earth and the earth’s ecosystems work, how they are interconnected, and how humans utilize and impact natural resource systems. Environmental problems and solutions are examined and natural resource conservation strategies and policies are reviewed. Topics covered in the course include ecosystem processes, climate and climate change, biodiversity and endangered species, land degradation and deforestation, human population growth, agriculture, and water and soil resources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51115", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GES 120H, GES 120Y ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 120H", "Name": "Introduction to Environmental Conservation - Honors", "Credits": "3", "Description": "An introduction to the interdisciplinary study of how the earth and the earth’s ecosystems work, how they are interconnected, and how humans utilize and impact natural resource systems. Environmental problems and solutions are examined and natural resource conservation strategies and policies are reviewed. Topics covered in the course include ecosystem processes, climate and climate change, biodiversity and endangered species, land degradation and deforestation, human population growth, agriculture, and water and soil resources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51150", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GES 120, GES 120Y ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 120Y", "Name": "Environmental Science and Conservation", "Credits": "4", "Description": "An introduction to the interdisciplinary study of how the earth and the earth’s ecosystems work, how they are interconnected, and how humans utilize and impact natural resource systems. Environmental problems and solutions are examined and natural resource conservation strategies and policies are reviewed. Topics covered in the course include ecosystem processes, climate and climate change, biodiversity and endangered species, land degradation and deforestation, human population growth, agriculture, and water and soil resources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54545", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "GES 120, GES 120H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "GES 220", "Name": "Lab and Field Techniques for Environmental Science", "Credits": "4", "Description": "Students enrolled in this course will gain experience in field sampling, laboratory procedures and data analysis. Exercises will involve field and laboratory work with some combination of water, soils, vegetation, landforms and atmospheric phenomena. Students will work in teams, and each will develop a final research project for presentation at the end of the semester. This is a required course for students majoring in environmental science or environmental studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51156", "Consent": "No Special Consent Required", "Components": "Lecture, Laboratory", "Attributes": "Science Plus Lab (GEP), Science Plus Lab (GFR)", "Prerequisite/Corequisite": "You must have completed GES 120 with a grade of C or better. In addition, you must have completed BIOL 100 or BIOL 101 or BIOL 141 or CHEM 101 with a grade of C or better or be concurrently enrolled in BIOL 141 or CHEM 101."}, {"Course": "GES 286", "Name": "Exploring the Environment: A Geo-Spatial Perspective", "Credits": "4", "Description": "This course is designed to introduce students to various technical tools that are currently being used in geography and environmental fields today. GIS, Remote Sensing, GPS and Cartography are discussed in the course. The course covers, among other topics, a basic understanding of how GPS systems function and how it integrate with GIS. The course also provides students a basic understanding of GIS software and concepts including raster and vector models. Students learn basic map fundamentals such as scale, map interpretation, and projections along with how remote sensing is used in mapping and GIS. The Lab portion of the course provides hands-on examples of different topical areas covered in lecture and how each integrates using real-world examples.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54546", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Science Plus Lab (GEP), Science Plus Lab (GFR)"}, {"Course": "GES 302", "Name": "Selective Topics in Geography", "Credits": "3", "Description": "This course is provided to allow flexibility in offering work not found elsewhere in the course offerings. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Three credits in a GES course or permission of instructor. Note: Some topics will require additional prerequisites", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51316", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GES 304", "Name": "Community Research", "Credits": "3", "Description": "This course will involve undergraduate students in a team-based project to generate field research findings useful to a government or non-profit client/partner. The policy areas to be researched will include environment, health, housing, poverty, and urban development, among others. Team participants will include teaching and research faculty and staff, advanced graduate students, and a Sondheim Program-based Peaceworker. Undergraduates will contribute to the research design and to the preparation of the research findings, and will conduct extensive field research. They will build practical research skills and engage with members of local communities. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "100236", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AMST 304, POLI 304, PUB 304 "}, {"Course": "GES 305", "Name": "Landscape Ecology", "Credits": "3", "Description": "Landscape ecology is an integrative discipline aimed at understanding the causes and consequences of ecological pattern, process and change within and across landscapes at local, regional and global scales. This course introduces the fundamental concepts and tools of landscape ecology and explores their application in basic ecological science, biodiversity conservation, environmental management and landscape planning.", "Grading": "Graded", "Course ID": "51257", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed GES 120  with a grade of C or better."}, {"Course": "GES 307", "Name": "Conservation Biology", "Credits": "3", "Description": "This course focuses on the biology that underlies conservation problems and the challenges we face as a society. This course will introduce some of the literature, controversies, and promising methodologies used in Conservation Biology. Objectivity and sound research design are essential for scientific progress, thus a major emphasis will be on carefully evaluating each issue in a rigorous, scientific context. Specific goals of the course are: 1) To introduce the principal concepts and methodologies of Conservation Biology, 2) To enrich understanding of the scientific contributions necessary for solving conservation problems, 3) To foster understanding of the process of science in general, and as applied in conservation contexts, 4) To further develop analytical and communication skills, thereby improving the ability to contribute to creating solutions. Classes will consist of lectures and discussion on particular issues and readings.", "Grading": "Graded", "Course ID": "54547", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 141 with a grade of C or better."}, {"Course": "GES 308", "Name": "Ecology", "Credits": "3", "Description": "Students enrolled in this course will explore the interactions between the environment and organisms as individuals, populations, communities and ecosystems. Major topics include adaptive strategies of organisms, population dynamics, species interactions, community structure and function, biodiversity and productivity. This is a background course for students majoring in environmental science or environmental studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54548", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 100 or BIOL100H or BIOL 101 or BIOL 141 or BIOL 141H with a grade of C or better."}, {"Course": "GES 310", "Name": "Geomorphology", "Credits": "3", "Description": "Study of earth surface processes and landforms, including: large-scale landscape patterns related to geologic structure; weathering and soils; hillslopes and mass wasting; watersheds and hydrologic processes; rivers and fluvial processes; coastal and estuarine processes and landforms; and the effects of glacial and periglacial activity. We will also discuss the impact of human activity on erosion and sediment yield and on landscape form and process. Recommended Preparation: PHYS 111 or PHYS 121 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51003", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 110 or GES 111 and MATH 150 or equivalent all with a C or better"}, {"Course": "GES 311", "Name": "Weather and Climate", "Credits": "3", "Description": "This course offers an introduction to the physical processes that control weather and climate. Topics covered include the mechanics of atmospheric behavior, weather systems, the global distribution of climates and their causes, as well as various topics related to climatology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51004", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 110 with a C or better."}, {"Course": "GES 312", "Name": "Natural Hazards", "Credits": "3", "Description": "In this course we explore the vulnerability of human populations to natural hazards and the ways susceptibility arises both from natural events and distinctly human elements - including burgeoning population and property, risk behavior and inadequate disaster mitigation strategies.  We examine the panoply of natural hazards, including volcanoes, earthquakes, debris flows, tsunami, severe storms, drought and flood, wildfires, extraterrestrial impactors, global warming and emerging (zoonotic) disease.  For each of these categories, students will obtain a working knowledge of physical processes, historical cases, social impacts, mitigation strategies, and the manner in which one type of hazard may precondition or trigger another.", "Grading": "Graded/Audit", "Course ID": "102656", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 310 with a ‘C’ or better."}, {"Course": "GES 313", "Name": "Biogeography", "Credits": "3", "Description": "Study of the physical, biological and cultural factors that influence the changing distributions of plants and animals over the earth.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51364", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 110 or GES 120 with a C or better."}, {"Course": "GES 314", "Name": "Geography of Soils", "Credits": "3", "Description": "Study of the properties, distribution and development of soils, soil formation and classification, soil organisms and organic matter, and soil surveys.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51207", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 110 or GES 111 with a C or better."}, {"Course": "GES 317", "Name": "Water Quality", "Credits": "3", "Description": "An introduction to basic physical, chemical and biological characteristics of natural waters, focusing on the sources and pathways by which contaminants enter aquatic systems and the impacts of water pollution on aquatic ecology and human health. Topics discussed also include drinking-water standards, wastewater treatment, point and non-point source contamination, and methods for prevention or remediation of contamination. The course concentrates most heavily on surface water quality, but some attention will be devoted to groundwater quality. Students are encouraged to complete CHEM 101 prior to enrolling in this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51317", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 110  passed with a C or better"}, {"Course": "GES 318", "Name": "Natural Environment of the Chesapeake Bay", "Credits": "3", "Description": "An introduction to the geology, circulation, geochemistry and ecology of Maryland’s most important natural resource and one of the world’s largest estuaries. In bringing together these aspects of the study of the Chesapeake Bay, we will try to understand how an estuarine system evolves under natural conditions and how the system may be affected by human activities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51258", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 110  passed with a C or better"}, {"Course": "GES 319", "Name": "Watershed Science & Management", "Credits": "3", "Description": "An introduction to watershed structure and function with particular emphasis on principles of hydrology, geomorphology, ecology and their application to the management of watersheds. Students will explore how these fundamental dimensions help shape management responses to environmental challenges in the context of past, current, and future legal and political frameworks.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100527", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete GES 110 or GES 120  and also ENGL 100 with a grade of ’C’ or better."}, {"Course": "GES 325", "Name": "Historical Geography", "Credits": "3", "Description": "An introductory course on the salient aspects of historical geography, focus on landscape evolution and regional changes of cultural phenomena. Emphasis is on development of North America, with contrasts of Latin American and non-Western landscapes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51208", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "GES 102 or GES 105 or GES 110 or GES 120 or GES 286   with a grade of C or better."}, {"Course": "GES 326", "Name": "American Conservation Thought", "Credits": "3", "Description": "An exploration of the major ideas and events of American conservation history from European colonization through to the modern environmental movement. The course focuses upon changing attitutdes towards nature, wildlife, and natural resources and also covers the evolution of federal policy regarding the establishment and management of national parks, forests and wilderness areas. In addition, we will review and analyze some of the major environmental and resource controversies of the last 100 years.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51158", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete GES 102 or GES 105 or GES 110 or GES 120 and also ENGL 100  with a grade of ’C’ or better."}, {"Course": "GES 327", "Name": "Cultural Ecology", "Credits": "3", "Description": "This course investigates the relationship between humans and their physical environment and the role that technology plays in this evolving relationship. We examine the interdependence of social organization, technology, and the environment using a case study approach from different cultures with particular emphasis upon the Amazon region of South America. The course also explores social and cultural changes arising from technological innovations and the impacts of expanding economic frontiers upon indigenous population.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51054", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Prerequisite/Corequisite": "You must complete GES 102 or GES 105 or GES 110 or GES 120 or ANTH 211 with a C or better."}, {"Course": "GES 328", "Name": "Environmental Policy", "Credits": "3", "Description": "This class examines the environmental policy process by studying how conflicting economic, social, and political interests and values compete for influence and exert power in the formulation and implementation of environmental policy. We look at the ways in which various stakeholders, including business interests, environmental interest groups, and local, national, and international governance institutions interact in defining environmental problems and formulating solutions. The class also examines the role that environmental science helps to define, and settle, debates of environmental policy, and the trade-offs between scientific expertise and political and economic concerns in policy formulation. Policies to be studied include climate change mitigation, wilderness preservation, urban land-use policy, water and air quality standards, and agricultural policy. The class draws on case studies from North American and developing country contexts.", "Grading": "Graded", "Course ID": "100358", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete GES 102 or GES 120 and also ENGL 100  with a grade of ‘C’ or better."}, {"Course": "GES 329", "Name": "Geography of Disease and Health", "Credits": "3", "Description": "The application of geographical concepts and techniques to health-related problems; origins and diffusion of diseases; physical, biological, cultural and policy factors in disease and mortality; location of social service facilities and ability of health and social systems to respond to society’s needs. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50101", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Geog Of Disease & Health", "Attributes": "Writing Intensive (WI), Social Sciences (GFR)", "Same as Offered": "HAPP 329 ", "Prerequisite/Corequisite": "You must complete GES 102 or three credits of HAPP and ENGL 100  with a minimum grade of ‘C’."}, {"Course": "GES 330", "Name": "Geography of Economic Development", "Credits": "3", "Description": "Study of patterns of economic development issues around the world with an emphasis on causes and solutions. Focus on the role of agriculture, manufacturing and service provision in the development process. Case studies of specific regions. Recommended Preparation: Permission of the Instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51006", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 102 with a grade of ‘C’ or better and have junior standing."}, {"Course": "GES 333", "Name": "Water Resources", "Credits": "3", "Description": "This course examines the distribution and abundance of water resources, the nature of water supply systems, the uses of water in modern society, and the impact of human activities on water quality and water availability. Environmental, social and economic implications of water resource management decisions will be considered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51055", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 102 or GES 105 or GES 110 or GES 120 with a C or better or have a Junior standing."}, {"Course": "GES 337", "Name": "Natural Resource Management", "Credits": "3", "Description": "Natural resource management (NRM) can be defined as the set of principles and practices that guide the human use of natural resources in ways that address the importance of sustaining those resources for (1) their overall ecosystem role and (2) for the health and productivity of future generations. This course offers an overview of NRM, tracing the history of evolution from traditional to ecosystem-based NRM. Problems resulting from the misuse and mismanagement of natural resources and challenges presented by management at varying spatial scales are also examined. The class will review the latest forms of NRM (integrated, adaptive, equitable, participatory/community-based, and sustainable) and case studies from the Chesapeake watershed to international contexts will be used to explore political, socio-economic, cultural and ecological realities that influence NRM strategies. A common thread throughout will be discussion of the complex relationship between environmental policy and NRM.", "Grading": "Graded/Pass Fail", "Course ID": "101810", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 110 or GES 120 or GES 102 with a C or better."}, {"Course": "GES 338", "Name": "Chesapeake Bay: Changing Management & Policy", "Credits": "3", "Description": "We explore the past and current challenges facing the Chesapeake Bay from a management/policy perspective. Considering the entire Chesapeake Bay watershed, we chart the shifting anthropogenic pressures on the Bay, assess conservation and restoration strategies, analyze stakeholder groups across scales, and explore future scenarios for the Bay in a changing climate. This course has a practical emphasis, with opportunities for students to engage with the field, via guest lectures and optional field experiences.", "Grading": "Graded/Pass Fail", "Course ID": "102095", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 102 or GES 110 or GES 120 with a C or better."}, {"Course": "GES 341", "Name": "Urban Geography", "Credits": "3", "Description": "This course will enhance students’ understandings of how cities work (or do not work), and will introduce the students to tools used by urban geographers to study urban places. Topical foci will include transportation, racial and economic segregation, planning, the changing form and function of cities, and social and environmental justice. In-class lectures, discussions and exercises will teach the students to apply the theory learned in the classroom to real-world applications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51056", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  GES 102  passed with a C or better."}, {"Course": "GES 342", "Name": "Metropolitan Baltimore", "Credits": "3", "Description": "Analysis of the functions, structure, development and planning problems of the metropolitan area.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51259", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete GES 102 or GES 105 or GES 120 with a C or better."}, {"Course": "GES 363", "Name": "World Regions: Contemporary International Issues", "Credits": "3", "Description": "A geographical perspective on contemporary international issues, including territorial and resource disputes, migration and immigration, environment and regional economic development, and social and political conflict. Case studies of regional issues. Recommended Preparation: GES 102 or GES 105 or three credits in a GES course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54550", "Consent": "No Special Consent Required", "Components": "Lecture"}]