[{"Course": "CHEM 406", "Name": "Bioinorganic Chemistry", "Credits": "3", "Description": "Intended for senior-level undergraduates and graduate students, this course focuses on the role and function of metals in biology. Topics include metalloenzyme mechanisms, spectroscopy and use of metals in medicine. Recommended Preparation:  CHEM 405 or CHEM 437 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52706", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 405 with a C or better."}, {"Course": "CHEM 410", "Name": "Quantum Chemistry", "Credits": "3", "Description": "Introduction to the principles of quantum mechanics and their application to chemical systems. Topics include the postulatory basis of quantum mechanics; approximate methods; vibrational, rotational, electronic, nuclear magnetic and electron spin spectroscopy; atomic structure; the chemical bond, valence bond; and molecular orbital theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52707", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 302 or CHEM 303 w/ a C or better."}, {"Course": "CHEM 415", "Name": "Statistical Mechanics and Theory of Rate Processes", "Credits": "3", "Description": "Introduction to statistical mechanics and theoretical aspects of absolute reaction rate theory. Major topics include statistical definition of entropy; compounding of systems; combinational problems; the methods of Gibbs; quantum statistics; partition functions; applications to equilibrium states of gases, solids and liquids; and partition formulation of the theory of absolute reaction rates.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52709", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 302 with a C or better."}, {"Course": "CHEM 420", "Name": "Computer Applications in Chemistry", "Credits": "3", "Description": "The course is designed to help develop an appreciation and understanding of how to write a computer program to solve problems related to chemical research. Fundamentals of electronic chemical structure calculations. This is not a theory course, but a practical course in which programming techniques, data handling, and online computational tools are discussed. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52710", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 302 or CHEM 303 with a C or better."}, {"Course": "CHEM 431", "Name": "Chemistry of Proteins", "Credits": "3", "Description": "An advanced treatment of the chemistry of proteins and protein-containing supramolecular structures. The topics include isolation and purification of proteins, structure of proteins and relation of structure to biological function.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52713", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 437 with a C or better"}, {"Course": "CHEM 432", "Name": "Advanced Biochemistry", "Credits": "3", "Description": "The topics presented would not normally be covered in any other biochemistry course and may include an advanced treatment of enzyme kinetics with emphasis upon two-substrate systems, allosteric control mechanisms, replication and transcription, and the biochemistry of specialized tissues. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52714", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Advanced Biochemistry, Molecular Recog., Adv Bioc:Post-Trans Reg, Adv Bioc:Allosteric Prot, Molec Recognition", "Prerequisite/Corequisite": "You must complete CHEM 437 and CHEM 438 with a C or better"}, {"Course": "CHEM 433", "Name": "Biochemistry of Nucleic Acids", "Credits": "3", "Description": "A survey of nucleic acid structure and function, with emphasis on chemical aspects. Topics will include DNA and RNA structure, packaging of nucleic acids, chemical and physical properties of nucleic acids, proteins and enzymes of DNA replication, fidelity of nucleic acid synthesis, biochemistry of DNA recombination, enzymology of transcription and RNA processing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52715", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 437 with a C or better"}, {"Course": "CHEM 435", "Name": "Biochemistry of Complex Carbohydrates", "Credits": "3", "Description": "Structure and function of the carbohydrates of glycoproteins, glycolipids, proteoglycans and bacterial polysaccharides; carbohydrates as informational macromolecules; decoding by lectins; biosynthesis; structure; engineering of glycoproteins; bacterial adhesion; and virulence and tumor antigens.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52717", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 437 with a C or better"}, {"Course": "CHEM 437", "Name": "Comprehensive Biochemistry I", "Credits": "4", "Description": "The first semester of a two semester sequence providing a thorough introduction to the principles of modern biochemistry. Major topics include enzyme kinetics and the structures and properties of proteins, nucleic acids, carbohydrates and lipids. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52718", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 437L", "Name": "Biochemistry Laboratory", "Credits": "4", "Description": "Modern methods of biochemical research. Laboratory experiments are designed to provide experience in working with biologically active materials and familiarity with standard biochemical techniques. These include spectrophotometry; chromatography; isotope tracer techniques; ultra-centrifugation; enzyme kinetics; and isolation, purification and characterization of proteins, nucleic acids and subcellular organelles. Two laboratory sessions per week.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52719", "Consent": "Instructor Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)"}, {"Course": "CHEM 438", "Name": "Comprehensive Biochemistry II", "Credits": "4", "Description": "Continuation of CHEM 437. Includes metabolic pathways and selected topics in nucleic acid and membrane chemistry. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52720", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 437 with a C or better"}, {"Course": "CHEM 441", "Name": "Physical Chemistry of Macromolecules", "Credits": "3", "Description": "Introduction to the physical chemistry of macromolecules. Emphasis is placed on the development of broad general concepts applicable to the study of synthetic and biological macromolecules. Topics considered include determination of molecular weight and molecular weight distributions; conformational properties of high polymers; and thermodynamics and transport properties of polymer solutions, polyelectrolytes and polymerization processes. Techniques such as sedimentation analysis, light scattering, osmometry and viscometry are discussed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52721", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CHEM 301 with a C or better."}, {"Course": "CHEM 442", "Name": "Physical Biochemistry", "Credits": "3", "Description": "Structural determination of proteins and nucleic acids in the solid state and in solution. Transitions between and stability of secondary and tertiary structure. Ligand binding and association processes. Interpretation of spectra, titration curves and multi-component equilibria, hydrodynamic properties and fluorescence polarization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52722", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 301 or CHEM 303 and CHEM 437. All courses must be completed with a grade of C or better."}, {"Course": "CHEM 443", "Name": "Molecular Spectroscopy and Biomacromolecules", "Credits": "3", "Description": "Team-taught course covering theory and applications of advanced spectroscopic techniques used to study the structure and function of biomacromolecules (polysaccharides, DNA, coenzymes and cofactors). Aspects of modern Fourier Transform NMR, including one- and two-dimensional methods (COSY, NOESY,TOCSY) will be presented. Principles of mass spectrometry and examples of the potential, limitations and applications of electron impact; desorption ionization; high-resolution tandem-mass spectrometry and interfaced chromatography mass spectrometry will be discussed. Theory and applications of other spectroscopic techniques, including molecular vibrational (raman, resonance raman and infrared), electron spin resonance (ESR) and laser fluorescence spectroscopies also will be presented. Recommended Preparation: CHEM 301 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52723", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CHEM 444", "Name": "Molecular Modeling In Biochemistry", "Credits": "3", "Description": "Survey of theoretical methods for simulation of biopolymer conformation. Energy maps, energy minimization and molecular dynamics simulation. Influence of solvents. Applications to proteins, nucleic acids, etc. Calculations using the CHARMM code.", "Grading": "Graded", "Course ID": "52724", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete CHEM 301 or CHEM 303 and CHEM 437. All courses must be completed with a grade of C or better."}, {"Course": "CHEM 450", "Name": "Chemistry of Heterocyclic Compounds", "Credits": "3", "Description": "An in-depth survey of the properties, reactions and synthesis of heterocyclic compounds containing the heteroatoms of oxygen, sulfur and/or nitrogen. The course will consist of lectures based on readings from monographs and current literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52725", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 451", "Name": "Mechanisms of Organic Reactions", "Credits": "3", "Description": "Advanced general treatment of the study of organic reaction mechanisms, with emphasis on the development of broad principles governing various organic reactions. Description of metastable intermediates such as carbonium ions, carbanions, carbenes and free radicals, kinetic effects in relation to structure, conformational analysis and stereochemistry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52727", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CHEM 451H", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 452", "Name": "Physical Organic Chemistry", "Credits": "3", "Description": "Introduction to theoretical aspects of organic chemistry. Molecular orbital approximations, linear-free energy relationships, general theory of acid-base catalysis, medium effects and isotope effects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52728", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 301 or CHEM 303  with a C or better."}, {"Course": "CHEM 453", "Name": "Organic Chemistry of Nucleic Acids", "Credits": "3", "Description": "A survey of organic chemical principles governing structure, properties and reactions of nucleic acids, including synthesis of nucleic acid bases, nucleosides, nucleotides and polynucleotides, and their important synthetic analogs possessing antiviral and antitumor properties. Study of reactivity of nucleic acid building blocks, including addition and substitution reaction, ring-openings and rearrangements, hydrolysis of glycosidic and phosphodiester bonds, and photochemical reactions. Study of primary structure, acid-base property, tautomerism and conformation of nucleic acids. Review of secondary structure, base-pairing and -stacking interactions, helical structure, stability, conformation, denaturation, renaturation and cross-linking.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52729", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 455", "Name": "Introduction to Biomedicinal Chemistry", "Credits": "3", "Description": "A survey of the drug design, discovery and development processes utilized by academic and industrial medicinal chemists using rational approaches to drug design and development from a biological, organic chemistry and mechanistic standpoint. Topics will include: structure activity relationship studies (SAR), identification of the pharmacophore, stereochemical considerations, the role of electronic and H-bonding interactions, bioavailability, +chemical and metabolic stability, toxicity, drug metabolism, DNA interactive drugs, receptors and enzymes as drug targets, the design and mechanistic features of receptor and enzyme inhibitors and the pharmacokinetic variability and design of prodrugs, the advantages and disadvantages of using monotherapy vs combination therapies such as multitargeted drugs, dual inhibitors and mutual prodrugs, among other current approaches to drug design. Additional topics will include the use of computers in drug design, the development of resistance, use of synergism in multidrug therapy, clinical trials, patent issues as well as moral and ethical responsibilities facing medicinal chemists. Case studies will focus on currently used (or recently used, but discontinued) drugs, particularly those reflecting controversy or innovation, as well as historical perspectives.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52730", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 457", "Name": "Total Synthesis of Natural Products", "Credits": "3", "Description": "The course will cover the total syntheses of selected natural products from animal, plant, marine, bacterial and fungal sources, including vitamins, alkaloids, hormones, terpenoids and antibiotics. Both historically significant total syntheses of landmark, such as those of cholesterol, morphine, strychnine and vitamin B12, as well as the more modern total syntheses, such as those as taxol, bleomycin and enediyne antibiotics, will be elaborated. Students who opt to take the course for graduate credits (CHEM 657) will be required to write an additional term paper and/or make an oral presentation on the total synthesis of a selected natural product.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52731", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CHEM 457H ", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 461", "Name": "Advanced Instrumental Methods of Analysis", "Credits": "4", "Description": "A lecture-laboratory course covering the theory, instrumentation and applications of modern instrumental techniques. Advantages and limitations of different instrumental methods are discussed using selected topics of environmental, pharmacological and toxicological analysis. Laboratory experiments include polarography and pulse voltammetry, anodic stripping analysis, potentiometry with ion-selective electrodes, flame and electrothermal atomic absorption, UV-VIS spectrophotometry, capillary gas chromatography and high-performance liquid chromatography (HPLC). (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52732", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CHEM 300 and CHEM 311L with a C or better."}, {"Course": "CHEM 465", "Name": "Mass Spectrometry at the Chemistry-Biology Interface", "Credits": "3", "Description": "Primary mass spectrometric methods for the structural characterization and functional investigation of biomolecules, such as proteins, nucleic acids, carbohydrates, etc. will be covered. Sequencing, identification of post-translational modifications, proteome application and functional investigations of biomolecules will be discussed using a problem based approach.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52733", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 300 and CHEM 301 with a C or better."}, {"Course": "CHEM 467", "Name": "Advanced Analytical Methods", "Credits": "3", "Description": "This is an advanced survey of molecular characterization methodologies, and the information that can be obtained from each, as well as their application to current, real-world chemical/biochemical analyses. The course will consist of: (i) Data Handling and Chemical Transport Phenomena, (ii) Molecular Characterization Methods (fluorescence, Raman, Electrochemical, etc.), (iii) Chemical/Biochemical Imaging (fluorescence and Raman microscopy, atomic force microscopy, SEM, TEM, etc.). It will consist of lectures and discussions based on readings from current literature", "Grading": "Graded/Audit", "Course ID": "102433", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 300  with a C or better."}, {"Course": "CHEM 470", "Name": "Toxicological Chemistry", "Credits": "3", "Description": "The relationship between the chemical properties of toxic chemicals, e.g., chlorinated hydrocarbons, metals, drugs, solvents and naturally occurring toxicants and their genotoxic effects, are systematically examined. Topics covered include biotransformations, dose-response and statistical considerations, chemical air pollution, pharmacokinetics, chemical mutagenicity and carcinogenicity, analytical procedures, geo-chemistry of environmental pollution, radiation toxicology and combinations of chemicals.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52734", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a grade of C or better"}, {"Course": "CHEM 472", "Name": "Enzyme Reaction Mechanisms", "Credits": "3", "Description": "The mechanism of enzyme action will be examined with emphasis on three-dimensional structure of enzymes, chemical catalysis, methods of determining enzyme mechanisms, stereochemistry of enzymatic reactions, detection of intermediates, affinity labels and suicide inhibitors, transition state analogs, energy relationships, evolutionarily “perfect” enzymes, genetic engineering and enzymes and use of binding energy in catalysis. Instruction will be in both lecture and seminar format, with emphasis on recent literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52735", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 and CHEM 437  with a C or better."}, {"Course": "CHEM 490", "Name": "Special Topics in Chemistry", "Credits": "3", "Description": "This course is intended for senior science students. Format may vary. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52737", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CHEM 499", "Name": "Undergraduate Research", "Credits": "1", "Description": "Original laboratory or theoretical investigation suitable for advanced students. Registration with the consent of the faculty member with whom the research is to be carried out. Hours to be arranged. One credit hour is equal to a minimum of four hours work in the laboratory per week. A formal paper will be required on research performed. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "52738", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "CHIN 101", "Name": "Elementary Chinese I", "Credits": "4", "Description": "An introduction to Chinese language and culture. Emphasis is on listening comprehension and basic speaking skills. The Pinyin phonetic system of Mandarin Chinese is studied. Chinese characters also are introduced.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52786", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "CHIN 102", "Name": "Elementary Chinese II", "Credits": "4", "Description": "Continuation of CHIN 101.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52788", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed CHIN 101 with a grade of C or better before taking this class or have completed 2 years of high school Chinese."}, {"Course": "CHIN 201", "Name": "Intermediate Chinese I", "Credits": "4", "Description": "Further development of listening comprehension and speaking skills, with an increased emphasis on reading ability and cultural knowledge.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52790", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must have completed CHIN 102 with a grade of C or better before taking this class or have completed 3 years of high school Chinese."}, {"Course": "CHIN 202", "Name": "Intermediate Chinese II", "Credits": "4", "Description": "Continuation of CHIN 201.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52792", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must have completed CHIN 201 with a C or better before taking this class or have completed 4 years of high school Chinese."}, {"Course": "CHIN 300", "Name": "Special Projects in the Chinese Language and Culture", "Credits": "1", "Description": "This course is repeatable for credit.", "Grading": "Graded/Pass Fail", "Course ID": "52794", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "CHIN 301", "Name": "Advanced Chinese I", "Credits": "3", "Description": "Readings in Chinese television and radio plays, newspapers, business and fiction, with conversation and composition.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52795", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete CHIN 202 with a grade of “C” or better."}, {"Course": "CHIN 302", "Name": "Advanced Chinese II", "Credits": "3", "Description": "A continuation of CHIN 301, with focus on listening, reading, speaking and writing. Readings in literature, science and business.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52796", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHIN 301 with a grade of ‘C’ or better before taking this class."}, {"Course": "CHIN 309", "Name": "Business Chinese", "Credits": "3", "Description": "A course designed for students who wish to study business or who wish to become acquainted with the language of business in China. This course introduces business terminology and concepts particular to China, as well as essential tools for researching company stocks and the import and export trade.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52797", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete CHIN 301 with a grade of C or better before taking this class."}, {"Course": "CHIN 315", "Name": "Introduction to Literary Chinese", "Credits": "3", "Description": "This course introduces students to literary Chinese, a rich written language that has evolved over the past 2500 years. Through reading, translation, analysis, and homework, you will learn to read some foundational texts of the Chinese tradition, using literary Chinese, modern Chinese, and English. All students must be prepared to translate into modern Chinese and English on a regular basis in class and to acquire the vocabulary of grammatical analysis in modern Chinese.", "Grading": "Graded", "Course ID": "101847", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHIN 202 with a grade of “C” or better."}, {"Course": "CHIN 319", "Name": "Chinese Translation", "Credits": "3", "Description": "Instruction and practice in translating from Chinese into English. Students work with various written materials covering many fields. This course is repeatable for credit. Recommended Preparation: CHIN 301 or equivalent.", "Grading": "Graded", "Course ID": "52798", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Chinese Translation"}, {"Course": "CMPE 101", "Name": "Introduction to Computer Engineering", "Credits": "3", "Description": "Introduction to engineering, with emphasis on the electrical and computer disciplines. It introduces the engineering discipline and the non-technical, social, ethical, and environmental issues that an engineer must take into account. Design process, working in teams, oral and written communication skills are covered. Technical topics include DC circuits, laboratory instrumentation, computer organization, machine language, and programming in a language such as C. Students will work in teams on a design project, which includes design, construction, evaluation, testing, modeling and presentation.", "Grading": "Graded", "Course ID": "100251", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Science Plus Lab (GEP), Science Plus Lab (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 150 with a grade of C."}, {"Course": "CMPE 212", "Name": "Principles of Digital Design", "Credits": "4", "Description": "This course introduces students to the science of digital design. The topics covered include: Boolean algebra; logic theorems; logic circuits and methods for their simplification, including Karnaugh maps and the Quine-McCluskey algorithm; combinational design; electrical characteristics of gates, timing, races and hazards; sequential circuits, their specification via state machines and minimization; principles of register transfer notation; exposure to hardware description language(s); and synthesis tools. This course includes a laboratory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052814", "Consent": "Department Consent Required", "Components": "Discussion, Laboratory, Lecture", "Attributes": "Course Fee = $50.00"}, {"Course": "CMPE 306", "Name": "Introductory Circuit Theory", "Credits": "4", "Description": "This course introduces the fundamental linear passive elements of resistance, capacitance, inductance and the physical basis for their current voltage characteristics. It covers the basic analysis of circuits with these linear passive elements including Kirchoff’s laws, node and mesh analysis and a solution of the resulting circuit differential equations for transient and steady-state responses. The frequency domain description of circuit analysis is introduced. The operational amplifier and circuits using these components is covered. The basics of magnetic induction and transformers in linear circuits are discussed. The course includes a laboratory in which the student designs and makes measurements on simple test circuits using both real components and PSPICE simulation.", "Grading": "Graded", "Course ID": "52815", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Science Plus Lab (GEP), Science Plus Lab (GFR)", "Prerequisite/Corequisite": "You must complete PHYS 122 and MATH 225 with a grade of C or better. MATH 225 can be taken concurrently."}, {"Course": "CMPE 306T", "Name": "Introductory Circuit Theory Lab", "Credits": "1", "Description": "This course covers the lab material from CMPE306. The course is intended only for transfer students who have taken a 3-credit equivalent course to CMPE 306 before transferring to UMBC. Equivalent 3-credit courses will only be transferred to 4-credit CMPE306 after the student has successfully passed CMPE306T with a regular grade.", "Grading": "Graded", "Course ID": "052816", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Course Fee = $50.00"}, {"Course": "CMPE 310", "Name": "Systems Design and Programming", "Credits": "4", "Description": "This course provides computer engineering students with system design software and hardware experience. This course covers hardware features that support advanced process and memory management in modern architectures such as the Pentium. The details of the entire chipset for 8086 are covered, including topics related to the register architecture, machine language, clock generator, bus controller and memory, I/O and interrupt interface. Other details of a complete computer system are discussed, including I/O bus protocols and support chips, memory chips, interrupt handler hardware and external support chips for disk storage, video and direct memory access. This course includes a laboratory that focuses on assembly language programming and board design software.", "Grading": "Graded", "Course ID": "52817", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed CMPE 212 with a B or better and/or CMSC 201H with a C or better."}, {"Course": "CMPE 311", "Name": "C Programming and Embedded Systems", "Credits": "3", "Description": "In this course, students learn about hardware and software aspects of embedded systems. Students learn C programming language through use in an embedded platform. The course builds on CMPE 310 , introducing advanced topics including communication interfaces, advanced IO devices and other peripherals, multitasking, firmware, real-time operating systems/embedded operating systems and device drivers. The course will provide a hands-on experience in designing and ramming an embedded system using a microcontroller-based development platform.", "Grading": "Graded", "Course ID": "52818", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete CMPE 310 with a grade of C or better."}, {"Course": "CMPE 312", "Name": "Principles of Digital Design", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52819", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMPE 312L", "Name": "Fundamental Digital Design Laboratory", "Credits": "2", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52820", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture"}, {"Course": "CMPE 314", "Name": "Principles of Electronic Circuits", "Credits": "4", "Description": "A brief overview of semi-conductor devices and technology. The basic physical operation of PN-junction diodes, junction field effect transistors, MOSFETs and bipolar transistors. The corresponding small signal AC models. Basic transistor circuit configurations (CE, CC CB, CS, CD, CG). DC bias. Small signal analysis. Simple multi- transistor circuits: diffamp, operational amplifier and current mirror frequency response. In addition to the lectures, there is a laboratory associated with the course. You must have passed the Computer Engineering Gateway to get into this class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52822", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed CMPE 306 and MATH 225 with a C or better"}, {"Course": "CMPE 314T", "Name": "Electronics Circuits Lab", "Credits": "1", "Description": "This course covers the lab material from CMPE 314. The course is intended only for transfer students who have taken a three-credit equivalent course to CMPE 314 before transferring to UMBC. Equivalent 3-credit courses will only be transferred to 4-credit CMPE 314 after the student has successfully passed CMPE314T with a regular grade.", "Grading": "Graded", "Course ID": "52823", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00"}, {"Course": "CMPE 315", "Name": "Principles of VLSI Design", "Credits": "4", "Description": "Introduction to the concepts and techniques of VLSI (Very Large Scale Integration) design, the VLSI design process, details of the MOS transistor, CMOS processing technology and device fabrication, design rules, digital CMOS circuits, VLSI structures, timing issues, simulation, real circuits and performance. This course includes a laboratory that uses the CADENCE design tools.", "Grading": "Graded", "Course ID": "52824", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CMPE 314 with a C or better before taking this class."}, {"Course": "CMPE 320", "Name": "Probability, Statistics, and Random Processes", "Credits": "3", "Description": "This course presents the fundamental concepts of probability, statistics and random processes from a computer and electrical engineering perspective, emphasizing applications in communications and signal processing. Students will learn the basics to analyze and model the probabilistic behavior of engineering systems and to analyze experimental data associated with such systems. You must have passed the Computer Engineering Gateway to get into this class.", "Grading": "Graded", "Course ID": "52825", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed MATH251 or MATH251H and MATH225 with a C or better"}, {"Course": "CMPE 323", "Name": "Signal and Systems Theory", "Credits": "4", "Description": "This course covers basic signal and system theory from both continuous-time and discrete-time perspectives, covering linear systems, impulse response, Fourier Series and Transforms including DFT and FFT, transfer functions, and filters. It will touch on Laplace and Z transforms as time permits. It is a core requirement for students taking the communications track and is an elective for all other students.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52827", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete CMPE306 and MATH225 with a grade of C or better before taking this class."}, {"Course": "CMPE 330", "Name": "Electromagnetic Waves and Transmission", "Credits": "3", "Description": "An introduction to waves, transmission lines, and electromagnetics is made with the focus on computer engineering and communications applications. The physical limits on Kirchoff’s Laws are discussed. Phasor and vector analysis is reviewed. Transmission lines are studied in the time domain and the frequency domain. Electrostatics, magnetostatics, and the calculation of the capacitance and inductance in transmission lines are then studied. Time-varying fields, and the integral, differential, and phasor forms of Maxwell’s equations are introduced. Plane waves are studied.", "Grading": "Graded", "Course ID": "52828", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete CMPE 306 and MATH 225 and MATH 251 all with a grade of C or better before taking this class."}, {"Course": "CMPE 349", "Name": "Introduction to Professional Practice", "Credits": "3", "Description": "Introduction to systems engineering, project management, and professional ethics preparing students for immediate immersion in CMPE 450. Development and practice of skills in the design and partitioning of a system from initial customer requirements through development of specifications, Statement of Work, and proposal documents. The Classroom environment simulates the professional workplace. Students are required to develop and write various technical documents throughout the course. Professional practice experience includes real-world workplace ethics and behaviors. Note: This class is intended to be taken the semester before enrolling in CMPE 450 Capstone I.", "Grading": "Graded", "Course ID": "102070", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete CMPE Gateway which is CMPE 212 , CMSC 201 or CMSC 201H , MATH 152 or MATH 152H , and ENES 101 or ENES 101H all with a B or better and ENGL 100  or Equivalent with a C or better."}, {"Course": "CMPE 413", "Name": "Principles of VLSI Design", "Credits": "4", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52831", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture"}, {"Course": "CMPE 415", "Name": "Programmable Logic Devices", "Credits": "3", "Description": "This course covers the concepts, structure and programming characteristics of programmable logic devices such as PLDs and FPGAs. Hardware Description Languages (HDLs) are used to create designs that are tested on FPGA devices.", "Grading": "Graded", "Course ID": "52833", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 310 with a grade of C or better."}, {"Course": "CMPE 416L", "Name": "Capstone Computer Engineering Laboratory", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52835", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMPE 417", "Name": "VLSI Design Algorithms", "Credits": "3", "Description": "The design and implementation of algorithms for VLSI. Algorithms used at all levels of the design process are examined, including requirement specification, logic optimization, critical path analysis, place and route, mask layout, power analysis, logic simulation, fault simulation and test generation algorithms.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52836", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 315  with a C or better, before taking this class."}, {"Course": "CMPE 418", "Name": "VLSI Design Verification and Testing", "Credits": "3", "Description": "Introduction to digital design verification and testing topics, including design verification process, fault modeling, fault simulation, automatic test pattern simulation, functional test, logic and parameter testing techniques, and package testing. Built-in self test, design for testability and sequential test generation issues will be examined. Commercial computer-aided verification and ATPG tools will be used to generate tests on existing designs. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52837", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "VLSI Design Verif/Test"}, {"Course": "CMPE 419", "Name": "Computer Arithmetic Algorithms and Implementations", "Credits": "3", "Description": "This course introduces students to the algorithms employed in modern Arithmetic Logic Units (ALUs) and DSP processors to realize arithmetic operations. The topics covered include: introduction to arithmetic, unconventional fixed-radix number systems, redundant representations, sequential algorithms for multiplication and division, binary floating point numbers, fast addition and multiplication, fast division, evaluation of elementary functions (polynomial/rational function methods as well as CORDIC), logarithmic and residue number representations. Other topics are covered in articles from current literature in the area. Some knowledge of material from CMPE 315 is beneficial but not essential.", "Grading": "Graded", "Course ID": "52838", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 212."}, {"Course": "CMPE 422", "Name": "Digital Signal Processing", "Credits": "3", "Description": "Discrete-time signals and system analysis and the z-transform; sampling of continuous time signals, analog-to- digital and digital-to-analog conversion; design of finite impulse response and infinite impulse response digital filters, direct and computer-aided designs; the discrete Fourier transform and fast Fourier transform; effects of quantization and finite work-length arithmetic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52839", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 323 with a grade of C or better before taking this class."}, {"Course": "CMPE 423", "Name": "Principles of Communication Engineering", "Credits": "3", "Description": "Time- and frequency- domain description of signals used in communication. Mathematical characterization of noise effects. The mathematical description of analog modulation of transmissions, including amplitude, phase, and frequency modulation, and basic block-diagram level description of associated receiver and transmitter architectures. The effects of AWGN on analog modulations. Digital transmission by energy- and bandwidth constrained waveforms, including PAM, PSK, QAM and M-ary orthogonal signaling. Analysis of digital communications in additive white Gaussian channels. Overall communication systems engineering process, including the analysis and preparation of link-budgets for free-space, line-of-sight propagation, with examples drawn from contemporary radio communication systems.", "Grading": "Graded", "Course ID": "52840", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 320 and CMPE 323 with a grade of C or better before taking this class."}, {"Course": "CMPE 440", "Name": "Analog and Mixed Signal Circuits", "Credits": "3", "Description": "Fundamentals of analog integrated circuits and their integration with digital circuits into application-specific integrated circuits (ASICs). The contents include principles and designs of operational amplifiers, analog multipliers, comparators, phase-lock-loops, A/D and D/A converters, voltage/frequency converters, DC/DC converters, regulators, communication circuits including: filters, transmitter/ receiver circuits modulators/ demodulators.", "Grading": "Graded", "Course ID": "52841", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 314 with a C or better before taking this class."}, {"Course": "CMPE 447", "Name": "Analog Integrated Circuit Design", "Credits": "3", "Description": "The course covers basic fundamentals of analog circuit design as they pertain to IC design. The focus will be on MOSFET technology, but BJTs will also be covered. Topics will include MOS and bipolar transistor devices along with their models and physical layout in ICs, current mirrors, single-transistor amplifiers, frequency response, differential amplifiers, feedback and stability, references, and noise analysis. The course will include design, simulation, and layout using industry-standard software.", "Grading": "Graded", "Course ID": "100245", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMPE 314 with a C or better before taking this class."}, {"Course": "CMPE 450", "Name": "Capstone I", "Credits": "3", "Description": "This is the first half of a two-semester capstone experience, taken in consecutive Fall and Spring semesters. Students to engage in a complete project design experience over two semesters, integrating the technical concepts learned in prior courses. Entrepreneurship, team leadership and project management skills are emphasized. Students function in a classroom environment that closely simulates professional and entrepreneurial practice including budgetary, time, technical and sometimes social, ethical and environmental constraints. (Fall)", "Grading": "Graded", "Course ID": "052842", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Course Fee = $50.00"}, {"Course": "CMPE 451", "Name": "Capstone II", "Credits": "3", "Description": "This is the second half of a two-semester capstone experience, taken in consecutive Fall and Spring semesters. Students to engage in a complete project design experience over two semesters, integrating the technical concepts learned in prior courses. Entrepreneurship, team leadership and project management skills are emphasized. Students function in a classroom environment that closely simulates professional and entrepreneurial practice including budgetary, time, technical and sometimes social, ethical and environmental constraints.", "Grading": "Graded", "Course ID": "52843", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CMPE 450 and CMPE 311 with a C or better."}, {"Course": "CMPE 471", "Name": "Experimental Techniques for Electrical and Computer Engineering", "Credits": "3", "Description": "This course exposes students to basic technologies and laboratory techniques in three areas of electrical and computer engineering: wireless communications, optical communications, and bio-medical instrumentation. Techniques that students will learn include RF transmission, modulation, and detection; antenna and phased-array antenna operations, measurement of laser diode and photodetector characteristics; signal coupling to optical fibers and transmission; avalanche photodiode analog and photon counting mode operations, photoluminescence, electroluminescence, and Raman scattering measurement; and brainwave electroencephalography (EEG) measurement", "Grading": "Graded", "Course ID": "52826", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CMPE 314 with a C or better before taking this class."}, {"Course": "CMPE 485", "Name": "Introduction to Communication Networks", "Credits": "3", "Description": "An introduction to the fundamentals of communication and computer networking. Topics include: transmissions, WDM, circuit and packet switching, data link and medium-access technologies, X.25, frame relays, ISDN, xDSL, cable modem, SONET, ATM, TCP/IP, routing techniques and quality of services (QoS).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52845", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMPE 486", "Name": "Mobile Radio Communications", "Credits": "3", "Description": "This course provides a technical introduction to mobile radio telephony. Topics include: the evolution of mobile radio communications, transforming signal representation between time and frequency domains, allocation and assignment of communication channels for cellular phones, signal modulation techniques and wireless networks. An in-depth study of the GSM and IS-95 CDMA cellular phone systems also will be presented.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52846", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 313 or CMPE 212 and MATH 152."}, {"Course": "CMPE 491", "Name": "Special Topics in Computer Engineering", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52847", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Digital Signal Process, Mobile Radio Telephony, Spec Topics In Comp Engr, Communications Systems, Spec Topics In Comp Eng, Sensor Networks, Comp Arith Alg/VLSI Real, Embedded Systems, Wireless Sensor Networks, Robotics, Spec Topic In Comp Engr, Wearable Computing, Prog Embedded Systems, Intro Network Security, Nanoelectronics For Cmpe, Computer Arithmetic, Comp Arith Algor Implem, Biomed Electronics, Intro to Engn Math & Computation, Advanced Computer Arithmetic A, Intro to Quantum Mechanics for EE, Advanced FPGA Design, Mixed Signal Design II, Probabilistic Models, Data Intensive Computing, Biosensor Technology, Communications Systems, Medical Imaging, Embedded Systems and FPGAs, Advanced Math for Engineers, Ultra Low Power Bioelectronics & Mixed Sig Sys, Data Driven SP, Biomedical Microsystems, DSP Hardware, Low Power Bioelectronics, Advanced Arithmetic Algorithms"}, {"Course": "CMPE 499", "Name": "Independent Study in Computer Engineering", "Credits": "1", "Description": "A student may enroll in this course to study computer engineering topics that are not available in a regular course. The student and the faculty member supervising the independent study must determine the objectives of the project, the number of credits to be earned and the evaluation criteria for the project. Students are limited to two independent study courses in computer engineering. This course is repeatable for credit. Students may complete a maximum of 4 credits.", "Grading": "Pass/Fail", "Course ID": "52848", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "CMSC 100", "Name": "Introduction to Computer Science", "Credits": "3", "Description": "A one-semester introduction to computers and computer science. This course is intended for non-science majors. Topics include computer algorithms, data representations, computer systems, networks, databases, graphics, artificial intelligence, and the effects of computers on society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52864", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 100H", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "CMSC 100H", "Name": "Introduction to Computer Science", "Credits": "3", "Description": "A one-semester introduction to the computers and computer science. This course is intended for non-science majors. Topics include computer algorithms, data representations, computer systems, networks, databases, graphics, artificial intelligence, and the effects of computers on society. In the honors discussion session, students will read and discuss current articles about the interaction between humans and computers, and will also have hands-on laboratories to provide more in-depth exposure to programming techniques. The honors section of this course is intended to prepare students for CMSC 201.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100125", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 100", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "CMSC 103", "Name": "Scientific Computing", "Credits": "4", "Description": "An introduction to computers and programming. This course is intended for students who will major in scientific disciplines other than computer science. The course emphasizes scientific applications and uses the FORTRAN programming language. The elements of FORTRAN covered in this course include assignment statements, input/output statements, control structures, repetition structures, sub-routines, functions, arrays and files. This course also covers general programming concepts, including computer components, structured programming, algorithm development, problem-solving, testing, debugging and documentation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52867", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed MATH 151 or MATH 140 with the grade of C or better"}, {"Course": "CMSC 104", "Name": "Problem Solving and Computer Programming", "Credits": "3", "Description": "This course is designed to provide an introduction to problem solving and computer programming that does not require prior programming experience. Elementary problem solving skills and algorithm development will be introduced. Students will be taught the basic use of a programming environment and basic programming constructs (including loops, control statements, functions, and arrays). This course also teaches students the fundamentals of using the UNIX operating system, and introduces general computer science concepts. Note: This course does not fulfill any of the computer science major requirements. Students who have taken and received transfer credit for, or who are taking concurrently any computer programming course in a high-level programming language, will not receive credit for CMSC 104. The list of such computer programming courses includes, but is not limited to AP Computer Science, CMSC 201, CMSC 202, and sections of CMSC 291 that cover programming topics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52868", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 104Y "}, {"Course": "CMSC 104Y", "Name": "Problem Solving and Computer Programming", "Credits": "4", "Description": "This course is designed to provide an introduction to problem solving and computer programming that does not require prior programming experience. Elementary problem solving skills and algorithm development will be introduced. Students will be taught the basic use of a programming environment and basic programming constructs (including loops, control statements, functions, and arrays). This course also teaches students the fundamentals of using the UNIX operating system, and introduces general computer science concepts. Note: This course does not fulfill any of the computer science major requirements. Students who have taken and received transfer credit for, or who are taking concurrently any computer programming course in a high-level programming language, will not receive credit for CMSC 104. The list of such computer programming courses includes, but is not limited to AP Computer Science, CMSC 201, CMSC 202, and sections of CMSC 291 that cover programming topics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100689", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 104 "}, {"Course": "CMSC 106", "Name": "Programming in C", "Credits": "2", "Description": "An introduction to programming in C for students experienced in a high-level programming language. Topics include elementary data structures, control structures and input/ output functions in C; the use of the C preprocessor; user-defined types such as arrays, records and structures; system calls; and the use of a symbolic debugger. Students will be expected to complete significant programming projects using the C programming language. Recommended Preparation: Mastery of a high-level programming language other than C.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52870", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMSC 109", "Name": "Programming Topics", "Credits": "2", "Description": "An introduction to programming in a specific programming language, which may vary from semester to semester. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52873", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 103 or CMSC 201 "}, {"Course": "CMSC 121", "Name": "Introduction to UNIX", "Credits": "1", "Description": "This is an introductory course on UNIX intended primarily for incoming students new to UNIX and to computing at UMBC. Topics include an introduction to the UMBC computing environment, basics of the UNIX environment, e- mail using Pine and the emacs/Xemacs editor. Students are required to obtain a UMBC GL account prior to the first day of class.", "Grading": "Pass/Fail", "Course ID": "52874", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMSC 201", "Name": "Computer Science I", "Credits": "4", "Description": "An introduction to computer science through problem solving and computer programming. Programming techniques covered by this course include modularity, abstraction, top-down design, specifications documentation, debugging and testing. The core material for this course includes control structures, functions, lists, strings, abstract data types, file I/O, and recursion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52879", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 201H ", "Prerequisite/Corequisite": "You must have completed MATH 150 or MATH 151 or MATH 152 or MATH 155 with a ‘C’ or better, or have MATH test placement into MATH 151."}, {"Course": "CMSC 201H", "Name": "Computer Science I (Honors)", "Credits": "4", "Description": "An introduction to computer science through problem solving and computer programming. Programming techniques covered by this course include modularity, abstraction, top-down design, specifications documentation, debugging and testing. The core material for this course includes control structures, functions, lists, strings, abstract data types, file I/O, and recursion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52879", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 201 ", "Prerequisite/Corequisite": "You must have completed MATH 150 or MATH 151 or MATH 152  or MATH 155 with a C or better, or have  MATH test placement into  MATH 151  ."}, {"Course": "CMSC 202", "Name": "Computer Science II", "Credits": "4", "Description": "This course continues the student’s development of programming and problem-solving skills by providing an introduction to object-oriented design and programming (OOP). The primary focus is on OOP principles and techniques, including encapsulation, composition, inheritance, and polymorphism. Other OOP topics such as exception handling, containers, and generic programming are also covered. This is the second course for students interested in pursuing further study in computer science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52881", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 202H ", "Prerequisite/Corequisite": "You must have completed CMSC 201 or CMSC 201H and (MATH 150 or MATH 151 or MATH 151H or MATH 152 or MATH 152H) with a C or better"}, {"Course": "CMSC 202H", "Name": "Computer Science II (Honors) (MS)", "Credits": "4", "Description": "This course continues the student’s development of programming and problem-solving skills by providing an introduction to object-oriented design and programming (OOP). The primary focus is on OOP principles and techniques, including encapsulation, composition, inheritance, and polymorphism. Other OOP topics such as exception handling, containers, and generic programming are also covered. This is the second course for students interested in pursuing further study in computer science", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52882", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CMSC 202", "Prerequisite/Corequisite": "You must have completed CMSC 201 or CMSC 201H and (MATH 150 or MATH 151 or MATH 151H or MATH 152 or MATH 152H) with a C or better"}, {"Course": "CMSC 203", "Name": "Discrete Structures", "Credits": "3", "Description": "This course introduces the fundamental tools, topics and concepts of discrete mathematics needed to study computer science. This course emphasizes counting methods, proof techniques and problem solving strategies. Topics include Boolean algebra; set theory; symbolic logic; predicate calculus; number theory; the methods of direct, indirect and inductive proofs; objective functions; equivalence relations; graphs; set partitions; combinatorics; modular arithmetic; summations; and recurrences.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52883", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 151 or MATH 140 with the grade of C or better"}, {"Course": "CMSC 210", "Name": "Advanced Computing", "Credits": "3", "Description": "This course strengthens and extends the student’s programming and problem-solving skills through the use of advanced programming language constructs, pre-defined libraries, and proper software engineering techniques. Topics include program design, debugging, and testing, source code versioning control, use of a software development environment, data formats, web programming, web data extraction, and data visualization. This is the second course for non-computer science, non-computer engineering majors interested in pursuing further study in applied computing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102856", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 201 with a C or better"}, {"Course": "CMSC 232", "Name": "Advanced Java Techniques", "Credits": "2", "Description": "Advanced programming techniques in Java will be presented. The use of networking, threaded programs and techniques for object reflection and persistence will be discussed in class and will be the motivation for homework assignments. Additional topics will include distributed computation facilities in Java, including remote method invocation (RM), and distributed service architectures such as Jini and space-based computations in Java Spaces also will be examined. As time permits, Java security issues will be presented.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52896", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 202 or CMSC 202H with the grade of C or better."}, {"Course": "CMSC 291", "Name": "Special Topics in Computer Science", "Credits": "1", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52903", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMSC 299", "Name": "Independent Study in Computer Science", "Credits": "1", "Description": "A student may enroll in this course to study computer science topics that are not available in a regular course. The student and the faculty member supervising the independent study must determine the objectives of the project, the number of credits to be earned and the evaluation criteria for the project. Students are limited to two independent study courses in computer science. This course is repeatable for credit. Students may complete a maximum of 4 credits.", "Grading": "Pass/Fail", "Course ID": "52904", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "CMSC 304", "Name": "Social and Ethical Issues in Information Technology", "Credits": "3", "Description": "A survey course that reviews social issues and the ethical impact of information technology throughout the world. The course examines the policy issues that relate to the use of information technology, such as persona, privacy, rights of access, security, transborder information flow and confidentiality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52907", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed CMSC 202 or CMSC 202H or CMSC 210 and ENGL 100 or equivalent with the grade of C or better."}, {"Course": "CMSC 310", "Name": "Data Analysis and Structures", "Credits": "3", "Description": "The purpose of this course is to introduce non-computer science and non-computer engineering students to principles of algorithms and data structures. This course teaches students how to design increasingly complex programs in a manageable way, using abstract data structures, data analysis and manipulation, and other software engineering concepts. Using these data structures, programs can be designed to analyze and visualize data sets imported from external locations such as websites or databases. The classroom experience will be active combining the introduction of new topics with in-class activities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102857", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "You must complete CMSC 210 with a C or better."}, {"Course": "CMSC 313", "Name": "Computer Organization and Assembly Language Programming", "Credits": "3", "Description": "This course introduces the student to the low-level abstraction of a computer system from a programmer’s point of view, with an emphasis on low-level programming. Topics include data representation, assembly language programming, C programming, the process of compiling and linking, low-level memory management, exceptional control flow, and basic processor architecture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52911", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 331", "Name": "Principles of Programming Language", "Credits": "3", "Description": "This course examines the theory, design and implementation of programming languages and provides students with an introduction to programming languages that are likely to be new to them. Topics include specifications of syntax and semantics, declarations, binding, allocation, data structures, data types, control structures, control and data flow, concurrency, and the implementation and execution of programs. The major language paradigms will be described and explored, including imperative, object-oriented, functional, logic programming, concurrent and others. Programming projects will provide experience in several languages.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52913", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 340", "Name": "Advanced C++", "Credits": "3", "Description": "This course will follow advanced programming topics in C++ to include topics including pointers, memory allocation, object -oriented design, inheritance, polymorphism, operator overloading, templates and exceptions. In-class programming practice, projects, and design programming will be used to improve programming skills. This class may be especially helpful for transfer students who have taken Computer Science I and II in Java and are ready to take CMSC 341. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102802", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "This class must be taken concurrently with CMSC 341 "}, {"Course": "CMSC 341", "Name": "Data Structures", "Credits": "3", "Description": "An examination of a range of advanced data structures, with an emphasis on an object-oriented approach. Topics include asymptotic analysis; various binary search trees, including red-black and splay trees; skip lists as alternatives to binary search trees; data structures for multidimensional data such as K-D trees; heaps and priority queues, including binary heaps, binomial heaps, leftist heaps (and/or other mergeable heaps); B-trees for external storage; other commonly used data structures, such as hash tables and disjoint sets. Programming projects in this course will focus on implementation issues for data structures and on empirical analysis of their asymptotic performance.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52914", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 341H ", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 341H", "Name": "Data Structures", "Credits": "3", "Description": "An examination of a range of advanced data structures, with an emphasis on an object-oriented approach. Topics include asymptotic analysis; various binary search trees, including red-black and splay trees; skip lists as alternatives to binary search trees; data structures for multidimensional data such as K-D trees; heaps and priority queues, including binary heaps, binomial heaps, leftist heaps (and/or other mergeable heaps); B-trees for external storage; other commonly used data structures, such as hash tables and disjoint sets. Programming projects in this course will focus on implementation issues for data structures and on empirical analysis of their asymptotic performance.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100127", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 341 ", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 345", "Name": "Software Design and Development", "Credits": "3", "Description": "This course introduces the basic concepts of software engineering, including software life cycle, requirements analysis and software design methods. Professional ethics in computer science and the social impact of computing are discussed as an integral part of the software development process. Additional topics may include tools for software development, software testing, software metrics and software maintenance.", "Grading": "Graded/Pass Fail", "Course ID": "052915", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 352", "Name": "Women, Gender, and Information Technology", "Credits": "3", "Description": "This course examines critical issues concerning women, gender, and information technology. It considers women’s critical contributions to technology, from the 19th century Analytical Engine to contemporary cybersecurity industry; how women and girls fare in IT educational and professional settings; and how these issues intersect with multiple dimensions including nationality, race, class, and age. Students connect these issues to their personal experiences, academic plans, and career choices. ", "Grading": "Graded/Pass Fail", "Course ID": "50049", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 352H , GWST 352H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 352, IS 352", "Prerequisite/Corequisite": "You must have completed one IS, CMSC, or GWST course with a grade of C or better."}, {"Course": "CMSC 352H", "Name": "Women, Gender, and Information Technology", "Credits": "3", "Description": "This course examines important issues concerning women, gender and information technology (IT). Students will consider such topics as the history of women’s involvement with IT; how women are impacted by technology; how women and girls fare in the educational setting as well as online; and the way gender intersects with IT in relation to other dimensions of women’s experience, such as race, class and age. Students will connect issues relevant to women and IT to their own career choices, interact with women in the IT field and utilize technology for research and presentation.", "Grading": "Graded/Pass Fail", "Course ID": "100341", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 352, GWST 352, IS 352 ", "Prerequisite/Corequisite": "You must complete a course in CMSC, IS, or GWST and earn a grade of C or better in order to take this course."}, {"Course": "CMSC 391", "Name": "Special Topics in Computer Science", "Credits": "1", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52920", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Program Microcontrollers, Student Succ/Appl Learn, Problem Solving Seminar, Systems Design & Programming"}, {"Course": "CMSC 396", "Name": "Undergraduate Teaching Fellowship", "Credits": "1", "Description": "This service-learning course is designed for undergraduate teaching fellows in computer science courses. Activities can include assisting with in-class learning exercises, leading lab sessions, development and grading of class content and assignments, learning new pedagogical developments in computer science, holding office hours, and conducting review sessions. Teaching fellows are expected to participate in a weekly meeting emphasizing professionalism, teaching diverse student populations, and teaching computer science. Successful completion of the course for which they will be a teaching fellow required. This course is repeatable for credit. Students may complete a maximum of 9 credits. Note: This course cannot count towards requirements of the major or minor programs of Computer Science and Electrical Engineering.", "Grading": "Graded", "Course ID": "102803", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 150 and CMSC 201 with an overall GPA of 3.0 or higher."}, {"Course": "CMSC 404", "Name": "The History of Computers and Computing", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52921", "Consent": "No Special Consent Required", "Components": "Lecture"}]