[{"Course": "HAPP 200", "Name": "Human Development Implications for Health and Disease", "Credits": "3", "Description": "Overview of basic biological principles and human issues in health and disease for non-technically oriented students preparing for careers in health care administration, community and public health, social work, etc. Topics include an introduction to human biology and development, interrelationships within the ecological framework, human anatomy and physiology, health and disease, nutrition and malnutrition, significant acute and chronic diseases, public health and disease prevention, aging, trauma, disability and mental stress.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51127", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HAPP 300", "Name": "Research Methods in Health", "Credits": "3", "Description": "This course considers principles of health research, including an overview of different types of health and health-related research. The course examines issues in research design, measurement, sampling, and computer applications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54599", "Consent": "NO Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have a 2.5 cumulative GPA and have completed HAPP 100 and STAT 121 or STAT 350 or STAT 351 or SOCY 301 all courses with a grade of C or better."}, {"Course": "HAPP 310", "Name": "Population and Reproductive Health", "Credits": "3", "Description": "Population and reproductive health are intrinsically linked through fertility, but the relationship can be affected by myriad of social, economic, behavioral, and political factors. The world’s population continues to grow while many still lack access to reproductive health services and family planning. The course will also cover population theory, methods of measurement, and population/reproductive health indices where appropriate. Significant emphasis will be placed on inequality and disparities in reproductive health. ", "Grading": "Graded/Audit", "Course ID": "102693", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100   or SOCY 101   or ANTH 211  with a grade of ‘C’ or better."}, {"Course": "HAPP 329", "Name": "Geography of Disease and Health", "Credits": "3", "Description": "The application of geographical concepts and techniques to health-related problems; origins and diffusion of diseases; physical, biological, cultural and policy factors in disease and mortality; location of social service facilities and ability of health and social systems to respond to society’s needs. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50101", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Geog Of Disease & Health", "Attributes": "Writing Intensive (WI), Social Sciences (GFR)", "Same as Offered": "GES 329 ", "Prerequisite/Corequisite": "You must complete GES 102 or three credits of HAPP and ENGL 100  or equivalent with a minimum grade of ‘C’ or higher."}, {"Course": "HAPP 340", "Name": "Health Communication", "Credits": "3", "Description": "Understanding how we communicate about health, and evidence based methods and theories around effective health communication, is a relatively new field of study. This class will expose students to the field of health communication. Students will develop an understanding of the evolution of health communication, and applications in promoting health. Students will also build skills in a variety of media to enhance their ability to effectively communicate about health.", "Grading": "Graded", "Course ID": "102406", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "ENGL 100  with a grade of C or better."}, {"Course": "HAPP 350", "Name": "Public Health Ethics", "Credits": "3", "Description": "This course serves to introduce central concepts and key issues in public health ethics. Students will learn various proposed frameworks for analyzing ethical issues in public health, and how public health ethics differs from traditional medical ethics. Students will use a case-based approach to analyze ethical issues in public health, and practice applying the frameworks to real and fictitious cases through class discussions and written assignments.", "Grading": "Graded", "Course ID": "102409", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "HAPP 100  with a grade of C or better."}, {"Course": "HAPP 354", "Name": "Social Bases of Public and Community Health", "Credits": "3", "Description": "Introduction to concepts of public health and community medicine.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50143", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 354 ", "Prerequisite/Corequisite": "You must have completed HAPP 100 or ANTH 211 or SOCY 101 with a grade of C or better."}, {"Course": "HAPP 358", "Name": "Bioethics", "Credits": "3", "Description": "A survey of the ethical constraints on the practice of medicine, biomedical research using human and nonhuman animals, and the delivery of health care. Specific topics will include doctor-patient confidentiality; autonomy, competence, and medical decision-making; ethical issues at the beginning and end of human life; and controversial biomedical technologies such as cloning and stem cell research. Recommended Preparation: PHIL 150 ,PHIL 152 , HAPP 350 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50142", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 358H ", "Attributes": "Arts and Humanities (GEP)", "Same as Offered": "PHIL 358 ", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better."}, {"Course": "HAPP 380", "Name": "Global Issues in Health and Disease", "Credits": "3", "Description": "This course provides an international comparative perspective on measures of population health such as life expectancy, infant mortality and leading causes of mortality and morbidity. Factors affecting global health disparities such as lifestyle, environment and health systems will be considered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54597", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100 with a grade of C or better."}, {"Course": "HAPP 390", "Name": "American Health Care System and the Black Community", "Credits": "3", "Description": "A course for students concerned with the health status of black, poor and minority people. Analysis of the relationship between the condition of the health of black people in America and the health delivery system. Specific attention will be on federal, state and local health care policies; personnel training in health administration; medical care organizations; financing and research and evaluation. Recommended Preparation: HAPP 100, AFST 271 or junior/senior status", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50029", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AFST 390 "}, {"Course": "HAPP 391W", "Name": "Seminar on AIDs for Health and Social Services Providers and Administrators", "Credits": "2", "Description": "This course is for health care and human-service providers working in settings that serve individuals affected by HIV/ AIDS. The course approaches the multitude of needs created by the HIV epidemic from various perspectives, including prevention education, psychosocial adjustment, community resources and family systems. Conducted in a seminar format, the course relies on large-and small-group discussions, exercises, and client and policy case reviews to improve skills in working effectively with people affected with HIV/AIDS.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50141", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 391W, SOWK 391W "}, {"Course": "HAPP 398", "Name": "Selected Topics in Health Administration and Policy", "Credits": "3", "Description": "This course explores critical topics in health administration, health policy, and public health. It draws on current research and debates from across disciplines to explore health-related issues from international, national, and/or local perspectives. Topics that may be explored include environmental health, emergency preparedness, health care marketing, population health, and health care quality improvement, among others.  Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51278", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HAPP 401", "Name": "Occupational Health Policy and Practice", "Credits": "3", "Description": "The problems of health and safety and their management in the workplace and the role of the individual, the community, industry and government in occupational health program development and regulation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51224", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100 with a grade of C or better."}, {"Course": "HAPP 402", "Name": "Environmental Health Policy and Practice", "Credits": "3", "Description": "Environmental health regulation and man’s place in the environment and problems in management of water, air, food, energy, housing, waste disposal, pests and sanitation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51074", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100 with a grade of C or better."}, {"Course": "HAPP 403", "Name": "Introduction to International Field Research", "Credits": "3", "Description": "The purpose of this course is to help prepare students for the increasingly sophisticated requirements of a global society, to develop an international perspective on important issues in culture, policy and practice, and to gain experience using social science field research methods. The international experience is designed to enable students to conduct field research on issues that will be of importance to the United States and Europe by studying the inter-relationships of health and social policy, science and technology, culture and life style in an international context. Students learn social science research methods and vocabulary and concepts from the disciplines of sociology, anthropology and health services research. This course includes lectures, structured exercises, field trips, site visits and discussions in the United States and Switzerland. Recommended Preparation: Six social science credits and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50144", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "SOCY 403 "}, {"Course": "HAPP 405", "Name": "Contemporary Issues in Long Term Care", "Credits": "3", "Description": "This course surveys a very important service and policy component of the health care system. A brief history of the evolution of long-term care provides the foundation to analyze issues such as social, economic and political environments, as well as credentialing, insurance and reimbursement. Various management functions will be examined, including financing, regulation, staffing and education. Case studies will introduce the student to community profile, demographics and housing alternatives.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54598", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100 with a grade of C or better."}, {"Course": "HAPP 411", "Name": "Health Regulation and Quality Improvement", "Credits": "3", "Description": "This course overviews health care regulations and associated quality improvement programs within health care organizations and society. It addresses the dynamic processes by which regulations are developed, proposed, modified, codified, implemented, and enforced at local, state, and federal levels relative to professional and institutional providers. The intersection between health care regulation and quality improvement efforts is addressed from multiple perspectives.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51378", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete HAPP 100 and ENGL 393 or HAPP 340  all with a C or better."}, {"Course": "HAPP 420", "Name": "Epidemiology", "Credits": "3", "Description": "This course studies health and disease in populations and compares groups within populations, including age, sex, race, and ethnic groups. The course examines the sources of data and the methods used by public health researchers. It also studies methods used in public health programs to measure and control diseases and to evaluate programs.", "Grading": "Graded", "Course ID": "102021", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "HAPP 300 or (SOCY 300 and SOCY 301) all with a C or better."}, {"Course": "HAPP 429", "Name": "Seminar in Geography of Disease and Health", "Credits": "3", "Description": "Current issues in the geographic distribution of disease and health and location/allocation of health care services. Methods of analysis, including computer applications of statistics and information storage, retrieval and mapping.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50100", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GES 429 "}, {"Course": "HAPP 452", "Name": "Health Care Organization and Delivery", "Credits": "3", "Description": "Current issues are reviewed in health care organization, delivery and financing in the United States and the various policies and approaches that impact the changing health care delivery system. Particular emphasis is placed on the implications of technological developments and the increasingly competitive environment in alternative aspects of health care.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50139", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 452 ", "Prerequisite/Corequisite": "You must complete HAPP 100 and (HAPP 300 or SOCY 300) all with a C or better."}, {"Course": "HAPP 470", "Name": "Health Administration and Policy Program Internship", "Credits": "6", "Description": "The internship experience provides Health Administration and Policy (HAPP) majors with an opportunity to develop their knowledge and skills further by serving as an intern under the guidance of an internship preceptor in a professional organization or institution. Internships must be approved by the HAPP Internship Coordinator.   ", "Grading": "Graded", "Course ID": "102405", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Students must complete HAPP 100  and HAPP 300  or HAPP 412, all with a C or better. Students must be a HAPP major and Cumulative GPA of 2.5 and 90 credits completed."}, {"Course": "HAPP 495", "Name": "Health Administration and Policy Internship", "Credits": "5", "Description": "Students will serve as interns in medical care or health service organizations, and institutions, with supervision provided at the placement location and by the internship coordinator.", "Grading": "Pass/Fail", "Course ID": "51023", "Consent": "Department Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must be a HAPP major, and have completed HAPP 496 with C or better, have minimum GPA 2.5,  and have 90 or greater credits"}, {"Course": "HAPP 496", "Name": "Internship Seminar", "Credits": "1", "Description": "This seminar helps students prepare to enter the job market by offering information on how to prepare professional resumes and cover letters, build interviewing skills and negotiate job offers. The seminar will also require students to create a web-based professional networking profile. This a core course requirement for all HAPP majors and must be completed successfully with a grade of “C” or better to advance in the program. Recommended Preparation: ENGL 393 ", "Grading": "Graded", "Course ID": "51181", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be a HAPP Major, and have completed HAPP 100  and have greater or equal to 60 credits to take this class."}, {"Course": "HAPP 497", "Name": "Health Planning and Administration", "Credits": "3", "Description": "This course introduces the application of management principles and practices, strategic planning, recruitment and deployment of staff, legal and ethical issues and financing strategies within health care organizations. Health policy and governmental influences impacting healthcare organizations will also be discussed. The course will focus on using critical thinking skills related to various applications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51024", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HAPP 100 and MGMT 210 (ECAD 210) with a grade of C or better."}, {"Course": "HAPP 498", "Name": "Financial Management and Decision Support for Health Service Organizations", "Credits": "3", "Description": "An introduction to the budgetary process, ongoing financial management skills at the department level, and decision support activities in independent, as well as, multi-organizational systems. Emphasis on understanding the reporting mechanisms and the accountability that is expected of the departmental manager with regard to resource allocation, including staffing alternatives, technology procurement, supply utilization, and department goal attainment. ", "Grading": "Graded", "Course ID": "50072", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Fin Mgmt/Dec Sup Hso", "Same as Offered": "EHS 498 ", "Prerequisite/Corequisite": "You must complete HAPP 100 or EHS 200 or AGNG 200 and ECON 121 with a C or better."}, {"Course": "HAPP 499", "Name": "Independent Study", "Credits": "1", "Description": "The student completes an individual project in a specific health administration and policy area under the supervision of a member of the HAPP faculty. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51379", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must be a HAPP Major"}, {"Course": "HEBR 101", "Name": "Elementary Modern Hebrew I", "Credits": "4", "Description": "An introduction to Hebrew as it is spoken and written today. Listening comprehension, speaking, reading and writing skills are developed. Introductory exposure to Israeli society and culture is included", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54603", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "HEBR 102", "Name": "Elementary Modern Hebrew II", "Credits": "4", "Description": "Continuation of HEBR 101. The course focuses on extending Hebrew language skills. Additional exposure to Israeli society and culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54605", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete HEBR 101 with a C or better before taking this class or have completed 2 years of high school Hebrew."}, {"Course": "HEBR 201", "Name": "Intermediate Modern Hebrew I", "Credits": "4", "Description": "Further development of listening comprehension and speaking skills and increased emphasis on reading, writing and cultural knowledge. Focus on everyday life in Israeli society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54607", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), Culture (GFR), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete HEBR 102 with a grade of C or better before taking this class or have completed 3 years of high school Hebrew."}, {"Course": "HEBR 202", "Name": "Intermediate Modern Hebrew II", "Credits": "4", "Description": "Reading, writing and oral use of Hebrew, with an emphasis on contemporary Israeli society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54609", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete HEBR 201 with a grade of C or better before taking this class or have completed 4 years of high school Hebrew."}, {"Course": "HEBR 301", "Name": "Advanced Hebrew I", "Credits": "3", "Description": "This advanced Hebrew language course focuses on sociocultural issues and current events in Israeli life as reflected in newspapers, contemporary journals and literature. Language will be developed through such class activities as reading, discussion, composition and oral presentations in Hebrew. Recommended Preparation: HEBR 201 with a grade of C or better or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54611", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)"}, {"Course": "HEBR 302", "Name": "Advanced Hebrew II", "Credits": "3", "Description": "This course is a continuation of HEBR 301 with increased attention to the development of reading and writing skills. The evolution of Israeli culture will be traced through a survey of 20th-century Hebrew literature. Class activities will include intensive reading, discussion and writing. A short critical paper will be required. Recommended Preparation: HEBR 301 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54612", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR), Language (GFR)"}, {"Course": "HEBR 323", "Name": "Selected Hebrew Authors", "Credits": "3", "Description": "The emphasis of this course is on expanding Hebrew language skills. Exploration of the work of one or two authors serves as the basis for more advanced work in Hebrew comprehension, as well as in writing and speaking the language. Literary critique and analysis through class discussions and writing assignments are the foci of class activities. The author(s) to be studied will be selected by the instructor. Authors such as S.Y. Agnon, C.N. Bialik, C. Hazaz or A. Oz may be chosen. Recommended Preparation: HEBR 201 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54613", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "HIND 101", "Name": "Elementary Hindi I", "Credits": "4", "Description": "An introduction to Hindi language and culture through a communicative approach. Language is learned in a thematic context based on real-life situations. Students will be introduced to the Deva-Nagari alphabet in its original form. Grammatical aspects of the language and commonly used phrases in communicative situations will be taught. Aspects of everyday life, work and leisure activities will also be introduced.", "Grading": "Graded/Audit", "Course ID": "054627", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIND 102", "Name": "Elementary Hindi II", "Credits": "4", "Description": "This course is the continuation of HIND 101 . The course focuses on the more advanced grammatical concepts of the language. Emphasis is on intensive vocabulary building and the development of more complex speaking and writing skills within the context of real-life situations. Food, costumes, customs and traditions of India will also be introduced through Hindi songs and movies", "Grading": "Graded/Audit", "Course ID": "102162", "Consent": "No special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete HIND 101 with C or better before taking this class."}, {"Course": "HIND 201", "Name": "Intermediate Hindi I", "Credits": "4", "Description": "A continuation of HIND 102. The course will include a survey of more advanced grammar; emphasis will be on developing listening comprehension and on increasing conversational fluency in the language. Various aspects of Indian culture, necessary for language competency, are introduced through Indian geography, folktales, short stories and various other genres of literature, including poetry.", "Grading": "Graded", "Course ID": "102174", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "201 Level Language Requirement (GEP)", "Prerequisite/Corequisite": "You must complete HIND 102  with a grade of C or better before taking this class."}, {"Course": "HIND 202", "Name": "Intermediate Hindi II", "Credits": "4", "Description": "A continuation of HIND 201 . Further development of speaking, reading, writing, and listening skills, with greater focus on syntax, morphology and grammar. Students will be involved in meaningful, functional communication through interactive activities that might be encountered in real life situations. Conversational teaching materials are supplemented by popular songs and video clips from Bollywood. The course will include a variety of reading and writing activities taken from materials representative of cultural topics. ", "Grading": "Graded", "Course ID": "102173", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete HIND 201  with a grade of C or better before taking this class."}, {"Course": "HIST 101", "Name": "American History to 1877", "Credits": "3", "Description": "Major topics include colonial America, the American Revolution, the Constitution, the federal period, sectional conflict, and the Civil War and the Reconstruction. Emphasis on differing interpretations of controversial issues.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54613", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 101H , HIST 101Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 101H", "Name": "American History to 1877", "Credits": "3", "Description": "Major topics include colonial America, the American Revolution, the Constitution, the federal period, sectional conflict, and the Civil War and the Reconstruction. Emphasis on differing interpretations of controversial issues.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54631", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 101 , HIST 101Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 101Y", "Name": "American History To 1877", "Credits": "3", "Description": "Major topics include colonial America, the American Revolution, the Constitution, the federal period, sectional conflict, and the Civil War and the Reconstruction. Emphasis on differing interpretations of controversial issues.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102024", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HIST 101 , HIST 101H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 102", "Name": "American History, 1877 to the Present", "Credits": "3", "Description": "Major topics include industrialization, progressivism, World War I, the twenties, the Depression and the New Deal, World War II, the Cold War and post-war America.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54632", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 102H, HIST 102Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 102H", "Name": "American History: 1877 to the Present - Honors", "Credits": "3", "Description": "Major topics include industrialization, progressivism, World War I, the twenties, the Depression and the New Deal, World War II, the Cold War and post-war America.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54633", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 102, HIST 102Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 102Y", "Name": "American History, 1877 to the Present", "Credits": "4", "Description": "Major topics include industrialization, progressivism, World War I, the twenties, the Depression and the New Deal, World War II, the Cold War and post-war America.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100458", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HIST 102,  HIST 102H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 103", "Name": "East-Asian Civilization", "Credits": "3", "Description": "A history of traditional society in East Asia, focusing on China and Japan, but touching also on Korea and Vietnam. This course will introduce the principal elements of East Asian civilization before the intrusion of the West in the 19th century. It also will provide an essential historical perspective to developments in contemporary East Asia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54634", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 103H , HIST 103Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 103H", "Name": "East-Asian Civilization", "Credits": "3", "Description": "A history of traditional society in East Asia, focusing on China and Japan, but touching also on Korea and Vietnam. This course will introduce the principal elements of East Asian civilization before the intrusion of the West in the 19th century. It also will provide an essential historical perspective to developments in contemporary East Asia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100237", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 103 , HIST 103Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HIST 103Y", "Name": "East-Asian Civilization", "Credits": "3", "Description": "A history of traditional society in East Asia, focusing on China and Japan, but touching also on Korea and Vietnam. This course will introduce the principal elements of East Asian civilization before the intrusion of the West in the 19th century. It also will provide an essential historical perspective to developments in contemporary East Asia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102025", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HIST 103 , HIST 103H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 110", "Name": "Western Civilization to 1700", "Credits": "3", "Description": "A survey of Western Civilization from its foundation through the ancient, medieval, and early modern periods. This course will cover the main political, economic, cultural, and religious features and developments of western society. Major topics will include the political and philosophical contributions of the ancient Greeks, the Roman Republic and Empire, the influences of Christianity, Islam, and Judaism, medieval social and cultural structures, the Renaissance, the Reformations, European exploration and contact with other peoples and cultures, and the Scientific Revolution.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54635", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 110H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 110H", "Name": "Western Civilization to 1700", "Credits": "3", "Description": "A survey of Western Civilization from its foundation through the ancient, medieval, and early modern periods. This course will cover the main political, economic, cultural and religious features and developments of western society. Major topics will include the political and philosophical contributions of the ancient Greeks, the Roman Republic and Empire, the influences of Christianity, Islam, Judaism, medieval social and cultural structures, the Renaissance, the Reformations, European exploration and contact with other peoples and cultures, and the Scientific Revolution.", "Grading": "Graded", "Course ID": "100038", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 110 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HIST 111", "Name": "Western Civilization 1700 to the Present", "Credits": "3", "Description": "A survey of Western Civilization from the Enlightenment through to the present day. This course will cover the main political, economic, cultural, and social features and developments of the West in the modern era. Major topics will include Absolutism, the Enlightenment, the political revolutions of the eighteenth century, the Industrial Revolution, imperialism, nationalism, fascism, socialism, the World Wars, the Cold War, and globalization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54636", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 111H, HIST 111Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 111H", "Name": "Western Civilization 1700 to the Present", "Credits": "3", "Description": "A survey of Western Civilization from the Enlightenment through to the present day. This course will cover the main political, economic, cultural, and social features and developments of the West in the modern era. Major topics will include Absolutism, the Enlightenment, the political revolutions of the eighteenth century, the Industrial Revolution, imperialism, nationalism, fascism, socialism, the World Wars, the Cold War, and globalization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100238", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 111, HIST 111Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HIST 111Y", "Name": "Western Civilization 1700 to the Present", "Credits": "4", "Description": "A survey of Western Civilization from the Enlightenment through to the present day. This course will cover the main political, economic, cultural, and social features and developments of the West in the modern era. Major topics will include Absolutism, the Enlightenment, the political revolutions of the eighteenth century, the Industrial Revolution, imperialism, nationalism, fascism, socialism, the World Wars, the Cold War, and globalization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54637", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HIST 111, HIST 111H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 200", "Name": "Themes in World History", "Credits": "3", "Description": "A history that covers the globe thematically from voyages of discovery, to colonization, cultural contact, empire, slavery, race, nation, migration, technology and the environment. Recommended to students seeking an international historical perspective on world issues. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54638", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 200Y ", "Topics": "Film and History, Entrepreneurship in the Early Modern World, Consumption, Don’t Buy It, Human Rights, Planets & Worlds, Earth & Home, Asian Diasporas, Global Terrorism, Don’t Buy It, Representations of Imperialism, Jewish Diasporas, Mapping of the Jewish Diaspora, The Ottoman Empire", "Attributes": "Social Sciences (GFR)"}, {"Course": "HIST 200Y", "Name": "Themes In World History", "Credits": "4", "Description": "A history that covers the globe thematically from voyages of discovery, to colonization, cultural contact, empire, slavery, race, nation, migration, technology and the environment. Recommended to students seeking an international historical perspective on world issues. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100222", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HIST 200 ", "Topics": "Film and History, Entrepreneurship in the Early Modern World, Consumption, Human Rights, Planets & Worlds Earth & Home, Asian Diasporas, Global Terrorism, Don’t Buy It, Representations of Imperialism, Jewish Diasporas, Mapping of the Jewish Diaspora, The Ottoman Empire", "Attributes": "Social Sciences (GFR)"}, {"Course": "HIST 201", "Name": "Introduction to the Study of History", "Credits": "3", "Description": "This course introduces student to the strategies, methods and critical thinking skills necessary for the study of history. The class includes instruction on conducting scholarly research, interpreting primary and secondary evidence and the writing of analytical papers. Students are also introduced to issues of historical epistemology, historiography and the ways that the practice of studying and writing history has changed over time.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54639", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 201H "}, {"Course": "HIST 201H", "Name": "Introduction to the Study of History-Honors", "Credits": "3", "Description": "This course introduces student to the strategies, methods and critical thinking skills necessary for the study of history. The class includes instruction on conducting scholarly research, interpreting primary and secondary evidence and the writing of analytical papers. Students are also introduced to issues of historical epistemology, historiography and the ways that the practice of studying and writing history has changed over time.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100217", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 201 "}, {"Course": "HIST 203", "Name": "Film & History: Representations of Imperialism in Modern World History", "Credits": "3", "Description": "Imperialism represents one of the more brutal chapters in modern history. Its impact on native peoples and societies raises profound moral questions about culpability, collaboration, resistance, and justification of violence on both sides. How do we deal with the memory of such traumatic events in popular culture? How do those popular memories compare with the historical evidence? This course compares representations of imperialism in film history with the treatment of the same events by historians.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102090", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 204", "Name": "Don’t Buy It: The Global History of Commodities", "Credits": "3", "Description": "This course looks at how the mass demand for commodities in the late 19th and early 20th centuries changed the way people worked, lived, and saw themselves as they produced and consumed in radically different ways from their parents and grandparents. Long before the Internet, commodities circled the globe, connecting distant places to one another through chains of relationships created to produce, deliver and sell commodities. Commodities also linked people. They connected enslaved African producers to middle-class American consumers, Asian factory workers with Europeans taking beach holidays. Students examine both producers and consumers as they follow the chain of production of certain commodities-rubber, sugar, corn, bananas, and housing. For their final project, students will produce and show a two-minute mini-documentary on one product in one country.", "Grading": "Graded", "Course ID": "102091", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 206", "Name": "Entrepreneurs in the Early Modern World", "Credits": "3", "Description": "This class uses the topic of entrepreneurship to explore major events and changes in early modern world history. Entrepreneurship is any new innovative or creative approach or idea that results in a venture or undertaking that is usually for profit. This course will focus on key areas of entrepreneurial activity such as: Commerce, Trade, Financial Speculation, European Colonization, Religious Missions, Piracy, Science, and Medicine. The geographic focus will be Europe, Africa, the Americas, and Asia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102221", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 207", "Name": "Asian Diasporas", "Credits": "3", "Description": "he story of human migration within and from Asia is at the heart of world history, touching upon every aspect of the human experience. As Asian migrants move within countries, within continents, and across oceans, they have faced many unique challenges and created profoundly complex networks of communication. This course will focus on the history of the global Chinese and Indian diasporas, comparing and contrasting them where appropriate with similar, though smaller-scale, networks of Koreans, Vietnamese, Pakistani, and other Asian groups abroad in the nineteenth and twentieth centuries.", "Grading": "Graded/Audit", "Course ID": "102139", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ASIA 207 "}, {"Course": "HIST 208", "Name": "Global Terrorism", "Credits": "3", "Description": "This course provides a survey of the post-world War II upsurge of domestic and international terrorism. It examines the nature of, reasons for and consequences of terrorism.  We will also study the nature and consequences of counter-terrorism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102408", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 209", "Name": "Themes in World History: Planets and Worlds, Earth and Home", "Credits": "3", "Description": "This course uses the history of cosmology to explore how various cultures have understood their relationship to earth and sky through time. All cultures identified their home in relation to the sky, but articulated this in different and evolving cultural ways. First considered a unique home, earth became in the modern era one planet among many. Once considered completely unapproachable and alien entities, planets within and outside our own system became worlds like the earth.", "Grading": "Graded", "Course ID": "102245", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 218", "Name": "Introduction to African-American History: A Survey", "Credits": "3", "Description": "This course offers a broad survey of the history of the African-American experience from the African background to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50030", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 206"}, {"Course": "HIST 242", "Name": "Introduction to Contemporary Africa", "Credits": "3", "Description": "A survey of contemporary Africa, its geography, peoples and cultural heritage. Economic, cultural, political and social changes on the continent since World War II, including the struggle for independence and the problems of nation-building.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50027", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "AFST 211"}, {"Course": "HIST 243", "Name": "Introduction to African History", "Credits": "3", "Description": "A survey of ancient and medieval kingdoms of Africa, the spread of Islam in Africa, European slave trade, white settler penetration of southern Africa and Arab penetration of East Africa, the colonial conquest, the 20th century and the emergence of nationalist movements seeking independence.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50026", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "AFST 212"}, {"Course": "HIST 255", "Name": "History of Christianity from its Origins to the Reformation", "Credits": "3", "Description": "Hebrew and Greco-Roman background, the life of Christ, the New Testament and development of theology, triumph of the church in the Roman Empire, the medieval church, the reformation and the end of medieval Christendom, and implications of the Reformation for the modern world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50150", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 255H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "RLST 255 "}, {"Course": "HIST 255H", "Name": "History of Christianity from its Origins to the Reformation-Honors", "Credits": "3", "Description": "Hebrew and Greco-Roman background, the life of Christ, the New Testament and development of theology, triumph of the church in the Roman Empire, the medieval church, the reformation and the end of medieval Christendom, and implications of the Reformation for the modern world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54648", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 255 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "RLST 255 "}, {"Course": "HIST 273", "Name": "History of the Jews in Modern Times, From the Middle Ages to 1917", "Credits": "3", "Description": "Political and socioeconomic forces at work in Europe and within the Jewish community during this period. Hassidism and enlightenment, emancipation and reform. The French and Russian revolutions. Jewish existence in Eastern Europe. Zionism and Aliyah.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50160", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "JDST 273, RLST 273 "}, {"Course": "HIST 274", "Name": "Contemporary Jewish History: 1917 to the Present", "Credits": "3", "Description": "Jewish civilization in the 20th century with attention to interwar years, the attempted destruction of European Jewry in World War II and the resistance of the Jews. Post-war issues are examined: including the Allies and the United Nations, the emergence of new centers in Europe and Israel, Jews in the former Soviet Union, Jewish identity struggle in America and post-Holocaust thought.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50147", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "JDST 274, RLST 274"}, {"Course": "HIST 300", "Name": "Introduction to Public History", "Credits": "3", "Description": "Public history is an interdisciplinary form of scholarship practiced as public service. Public historians help create historical understanding by sharing authority and inquiry with a variety of partners, including audiences, museum professionals, reservationists, business leaders and others. Public historians are trained, first and foremost, as historians ‘to conduct research, to craft interpretations and to write well. However, public historians must also be prepared to work collaboratively with partners for whom an understanding of history can have immediate practical implications. This course provides students with an introduction to the field. Students will explore the history of federal and state sponsorship of museums and historic sites, learn to think critically about the needs and interests of audiences, and explore best practices and ethics for public professionals. Recommended Preparation:  Must have earned at least a ‘C’ in one 100 or 200 level SS or AH course.", "Grading": "Graded", "Course ID": "100503", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 301", "Name": "The American City", "Credits": "3", "Description": "This course traces the history of America’s cities, from the colonial period through the late 20th century, locating urban forms in their visual, social, political, and symbolic contexts. We will consider the changing nature of cities through time and place. Part of class will focus on urban architectures and technologies. Course assignments will challenge students to think about why cities look and function the way they do, and why we should care about urban locales.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54658", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "HIST 302", "Name": "History of Maryland", "Credits": "3", "Description": "This course is an overview of Maryland history from its earliest settlement to the mid-20th century. The readings will focus on history, archaeology, architecture, and material culture to provide a broad perspective on Maryland life, culture, and history. The class will include field trips, analysis of primary texts, and a research project.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054659", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 303", "Name": "The Second World War", "Credits": "3", "Description": "Origins, nature and impact of World War II. In addition to an examination of the diplomatic and military events, the course also is concerned with the effects of “total war” on the societies involved. Recommended Preparation: Any social science course, junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54660", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 306", "Name": "The First World War", "Credits": "3", "Description": "Origins, nature and impact of the First World War. Particular emphasis is placed on the military, diplomatic, social, scientific and technological developments, events of the war years, and how this first total war affected the subsequent history of the United States and Europe. Recommended Preparation: Any 100-level social science course, junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54663", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 308", "Name": "Perspectives on Childhood and Adolescence", "Credits": "3", "Description": "Attitudes toward children and childhood as a stage of life are historically contingent phenomena: They are shaped by the social context within which they exist. This course examines attitudes toward children and children as a social group within various historical settings and among different subcultures in America. We will attempt to understand why these variations occur and how they make sense within our own particular setting. As part of this course, students are encouraged to think critically about their own experieince of and attitudes toward childhood. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50034", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AMST 384 "}, {"Course": "HIST 311", "Name": "American Entrepreneurs: From Christopher Columbus to Steve Jobs", "Credits": "3", "Description": "The entrepreneur symbolizes the American way. In this class, we will discuss and define the role of the entrepreneur in American economic development and also examine how entrepreneurs have shaped the lives of everyday Americans throughout our countrys history. Using several case studies, we will examine how entrepreneurs responded, on the one hand, to market forces and consumer demand and, on the other hand, to the political environment and regulatory frameworks set up over time. Recommended Preparation: Any 100 level SS course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101988", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 312", "Name": "From Ottoman to Isis: Politics & Culture in the 20th Century Middle East.", "Credits": "3", "Description": "This course will introduce students to the major trends and significant events in the history of the modern Middle East, with particular attention to themes of colonialism, nationalism, sectarianism, the impact of oil on the region, Western ambitions, and the rise of political Islam(s). We will also use film and literature to explore the complexity of life on the ground, as ordinary people and leaders alike struggle with their changing circumstances. Recommended Preparation: HIST 201.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102568", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 313", "Name": "America as a Great Power? U.S.Foreign Relations in the Twentieth Century", "Credits": "3", "Description": "This course traces the history of U.S. foreign policy in the twentieth century as the United States rises from regional to great power. We will use a variety of primary and secondary sources to critique foreign policy decisions as well as understand the international context in which they were made. Doing so will help us understand the connection between history and current policy directions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54716", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "HIST 315", "Name": "Native American History, 1800-Present", "Credits": "3", "Description": "This course is a survey of Native American history from the end of the American Revolution to the present that explores how Indian peoples confronted the many challenges of the last several centuries. It traces how Native Americans responded to often hostile US Indian policy., massive economic and cultural change, and radical transformations of their societies. Student learn how Indian peoples struggled to preserve traditional ways even as they adapted to an ever-modernizing America. Recommended Preparation:  HIST 101  or HIST 102 ", "Grading": "Graded", "Course ID": "102696", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 316", "Name": "Native American History from Contact to 1840", "Credits": "3", "Description": "This course surveys the history of Native Americans in North America from first contact with Europeans in the 15th century until the removal of the so-called “Five Civilized Tribes” in the mid-19th century. We will focus on different cultural groups and cross–cultural contact, emphasizing adaptation, as well as resistance. Topics include war, trade, gender relations, consumerism, religion, disease, sexuality, racial identity and environmental change. Recommended Preparation: A 100-level social science course or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54668", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 317", "Name": "American Political Development", "Credits": "3", "Description": "This course examines the development of the American political system through a historical lens. The course uses theories of American political culture and ideology to frame particular policy areas through historical time periods from the early 1800s to the early 2000s.", "Grading": "Graded", "Course ID": "100319", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 317 "}, {"Course": "HIST 318", "Name": "United States Constitutional History", "Credits": "3", "Description": "A survey of Constitutional history from the founding of the English colonies in North America until the present. The class focuses in particular on the Enlightenment and Common Law roots of the United States Constitution, debates over the scope of federal power, the role of slavery and freedom in constitutional debates, and the rising pressure to expand civil rights and responsibilities for all citizens.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100320", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 318"}, {"Course": "HIST 319", "Name": "Novelty and Nostalgia: The Rise of Modern America, 1877 to 1945", "Credits": "3", "Description": "American social, cultural and political life underwent dramatic transformations during the period between the end of the Civil War and the end of World War II. Americans’ understanding of freedom, democracy, rights and responsibility evolved in significant ways. Students will seek to understand why the expansion of democracy and freedom is so often met with violent resistance and arrive at a deeper understanding of the experiences and beliefs that shaped everyday life in modern America. Recommended Preparation: Any 100 SS course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101925", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "HIST 320", "Name": "Atlantic Revolutions on Film", "Credits": "3", "Description": "This course uses documentary and feature-length films to examine the revolutions that spread across the Atlantic World in the late-18th-19th century, a period often called the “Age of Revolutions.” Students will view films on the American, French, Haitian, and Latin American revolutions to analyze how film is used to portray history and why filmmakers have treated each of these revolutions so differently.  Recommended Preparation: HIST 340 ", "Grading": "Graded", "Course ID": "102719", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "HIST 321", "Name": "African-American History to 1865", "Credits": "3", "Description": "An in-depth examination of the social, political and economic history of African Americans in the United States from the 1600s to the Civil War era focusing on chattel slavery, the free black community, family, abolitionism, resistance and the Civil War. Recommended Preparation: AFST 100 or AFST 206 or junior/senior standing or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50008", "Consent": "No Special Consent Required", "Components": "Seminar", "Same as Offered": "AFST 352 "}, {"Course": "HIST 322", "Name": "African American History Since 1865", "Credits": "3", "Description": "An in-depth examination of the political, social, economic and cultural history of African Americans in the United States from the Reconstruction era following the Civil War up to present. Topics include African Americans and the military, the Great Depression, migrations, urbanization, racism, family, civil rights and current issues. Recommended Preparation: AFST 100 or AFST 206 or junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50011", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 353 "}, {"Course": "HIST 323", "Name": "African American Women’s History", "Credits": "3", "Description": "This course traces the history of African-American women in the United States, beginning with their ancestors’ history in pre-colonial Africa and U.S. slavery to the present. Topics covered include work; family roles; activism; achievements; and bouts with racism, sexism and poverty. Recommended Preparation: Any 100-level Social Science course or 200-level Literature course or junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50010", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 354, GWST 327 "}, {"Course": "HIST 325", "Name": "History of Women in America to 1870", "Credits": "3", "Description": "This course examines the changing roles of women in American society from colonial times to 1870 and covers such topics as family, work, rebellion, religion, sexuality, slavery, reform movements and early efforts for women’s rights. Emphasis is placed on both the variety of women’s experiences and the evolving concerns and position of American women as a group. Recommended Preparation: Any 100-level social science course, junior/senior standing or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50112", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 325 "}, {"Course": "HIST 326", "Name": "History of Women in America Since 1870", "Credits": "3", "Description": "A study of the changing roles of women in American society since 1870, focusing on such topics as work, higher education and the professions, social reform, the suffrage movement, war and peace, working-class and immigrant women, birth control and sexual freedom, and the rebirth of feminism. Emphasis is placed on both the variety of women’s experiences and the evolving concerns and position of American women as a group. Recommended Preparation: Any 100-level Social Science course or junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50130", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 326 "}, {"Course": "HIST 327", "Name": "Modern Latin American History", "Credits": "3", "Description": "This course introduces students to the social, economic, political, and cultural history of Latin America from independence to the early 1980s. The class focuses on the emergence of the modern nation-states in Latin America and the diverse experiences of politicians, peasants, guerrillas, workers, artisans, slaves, and ordinary families that shaped society after colonial rule. The course traces Latin American history both chronologically and thematically by focusing on major events, social movements, and political processes through the lenses of gender, race, class, ethnicity, and sexuality. Recommended Preparation: Any 100-level Social Science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100553", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 328", "Name": "Colonial Latin America", "Credits": "3", "Description": "This course will introduce students to the Pre-Columbian background of the Americas, the impact and meanings of European conquest, and the history of three centuries of Spanish and Portuguese rule that followed until independence in the early nineteenth century. The transition from Amerindian civilizations and native rule to European conquest and colonization marked a violent, painful, and complex shift in race and ethnic relations, in religious and cultural life, in ideas about gender, sexuality, and practices related to marriage, and profound economic transformations in the hemisphere. The course will invite students to look at the impact of the conquest from multiple perspectives, to confront our conventional knowledge about the Columbian encounter, and to understand the deeper processes of colonization. Recommended Preparation: Any 100-level Social Science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101929", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 330", "Name": "Ancient Science and Technology", "Credits": "3", "Description": "This course will survey the birth and development of ancient science and technology. Topics may include scientific reasoning and methodology; mathematics, geometry, and astronomy; anatomy and medicine; construction, engineering, and mechanical technology. Historical background - political, economic, social, cultural, and religious - provides insights into related fields of political science, psychology, and ethical philosophy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100244", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "ANCS 330 "}, {"Course": "HIST 339", "Name": "Images of Science and Technology in Cinema and Media", "Credits": "3", "Description": "This course introduces historical media analysis and criticism, applying it to more than a century of productions that shaped public images of scientists and engineers, their work, and its implications for the future. Science fiction and allied genres became a forum where the public confronted the benefits, dangers, drama, hopes and fears of an avowed scientific and technological age. Cinema, television, and new media also helped realize germinating discoveries and inventions.by making them seem achievable.  Recommended Preparation: Any 100-level Social Science course.", "Grading": "Graded", "Course ID": "102246", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 340", "Name": "Atlantic Revolutions", "Credits": "3", "Description": "This course will examine the revolutions that the spread across the Atlantic World from the mid-18th to the mid-19th century, a period some have called the “Age of Revolutions.” The primary focus will be exploring the “successful” revolutions of the era: the rebellion of the thirteen British American colonies, the internal revolution within France, the independence movement that wound up ending slavery in the French island of Saint-Domingue (Haiti), and the numerous wars of independence in Latin America. Given the breadth of topics, the objective is not to gain an exhaustive understanding of any one revolution, but rather to explore the connections between them all.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101935", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "HIST 341", "Name": "The American Colonies", "Credits": "3", "Description": "A history of the American colonies from their founding to 1774, comparing the social and economic development of the West Indies, New England, mainland South and middle colonies. Topics include patterns of settlement, racial and ethnic interaction, labor, religion, family and gender roles, and cultural achievements.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54705", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "HIST 343", "Name": "Democratizing America, 1763-1850", "Credits": "3", "Description": "This course explores America’s democratic experiment, from the American Revolution through the mid-19thcentury. The course covers political topics like voting rights and party politics, but also examines the social,cultural, and economic aspects of democracy in this turbulent era. Students will learn what men and women of all races and classes wanted from democracy, how they tried to have their voices heard, and assess how well the American political system worked for them.", "  Recommended Preparation": "Any 100 level Social Science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54712", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 344", "Name": "The American Civil War", "Credits": "3", "Description": "A history of the period 1840-1880, including an analysis of the sectional conflict, the events of the war and the era of reconstruction. Recommended Preparation: Any 100 level Social Science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54713", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 345", "Name": "Origins of Modern America, 1877-1920", "Credits": "3", "Description": "An analysis of the United States’ rapid transition from a largely agricultural society to the world’s most diverse urban and industrial economy. Specific topics include America’s growth as a world power, the American West and territorial expansion, shaping a post-Reconstruction South, urbanization and the new consumer economy, industrialization, entrepreneurship, innovation, changing gender roles, modern childhood and family life, and politics. Recommended Preparation: Any 100 level Social Science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54717", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 346", "Name": "The United States, 1917 to 1945", "Credits": "3", "Description": "An examination of American life and politics in the era of World War I, the 1920s, the Great Depression and World War II. Recommended Preparation: Any 100 level Social Science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54718", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 347", "Name": "The United States Since 1945", "Credits": "3", "Description": "An examination of American history from the 1940s through the 1990s. Primary emphasis is given to political, social and economic history. Recommended Preparation: Any 100 level Social Science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54719", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 348", "Name": "American Intelligence: The Revolution to 9/11", "Credits": "3", "Description": "This course surveys the history, development, and role of intelligence in international military and foreign affairs, as well as core intelligence functions and terminology to include collection, analysis, dissemination, propaganda, clandestine and covert action, and counterintelligence. Focusing on the U.S. experience, the course examines the U.S. Intelligence Community’s origins, operations, and management. The course evaluates component organizations, assesses intelligence contributions to policymaking and warfare, and examines how secrecy in intelligence is reconciled with the openness of the American political and constitutional system. Recommended Preparation: Any 100-level Social Science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100468", "Consent": "No Special Consent Required", "Components": "Lecture"}]