[{"Course": "HIST 499", "Name": "Honors Thesis in History II", "Credits": "3", "Description": "Research and writing of honors thesis in history. HIST 498 and HIST499 comprise a two-semester sequence and are part of the departmental honors program. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54764", "Consent": "No Special Consent Required", "Components": "Independent Study", "Attributes": "Writing Intensive (WI)"}, {"Course": "HONR 100", "Name": "Honors Forum I", "Credits": "2", "Description": "This course introduces students to the Honors College community, to UMBC and its academic disciplines, and to the resources and opportunities available on campus. Students interact with an array of professors through guest lectures and engage in small-team project work.", "Grading": "Pass/Fail", "Course ID": "54861", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 200", "Name": "Interdisciplinary Honors Seminar", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54863", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 210", "Name": "Great Books Seminar I", "Credits": "3", "Description": "An introduction to the great books of world literature, religion, philosophy, history, and science from ancient times to the present day. This course will include readings from such works as the Bible, the Bhagavad-Gita, Confucius, Homer, Plato, Dante, Machiavelli and Shakespeare.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54865", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 211", "Name": "Great Books Seminar II", "Credits": "3", "Description": "A second semester course on the great books of world literature, religion, philosophy, history and science. The course will include readings from such authors as Moliere, Swift, Basho, Darwin, Tolstoy, Dickinson and selected modern writers. Although this course continues work begun in HONR 210, it is designed so that students can easily enter HONR 211 without having taken HONR 210.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54866", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 300", "Name": "General Honors Seminar", "Credits": "3", "Description": "A significant interdisciplinary theme will be examined under the direction of a UMBC faculty member or an expert guest instructor. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded", "Course ID": "54872", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 390", "Name": "Reflections on Community Service", "Credits": "3", "Description": "This course provides opportunities for reflection on the principles and techniques of community service. It introduces students to basic methods of community service; offers background in the cultural, political and social contexts of community service; and serves as a forum for discussion of issues surrounding civic engagement and social responsibility. Students will apply the concepts and skills they develop to actual experiences in community service. This course is repeatable for credit.", "Grading": "Pass/Fail", "Course ID": "54873", "Consent": "No Special Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 400", "Name": "Honors Independent Study", "Credits": "1", "Description": "Independent study or research under the guidance of a faculty mentor. Course guidelines are available in the Honors College. This course is repeatable for credit. Students may complete a maximum of 4 credits.", "Grading": "Graded/Pass Fail", "Course ID": "54874", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 410", "Name": "Honors Internship", "Credits": "3", "Description": "This course offers academic credit for an internship or other applied learning experience. For each credit hour, student interns perform three hours per week of supervised tasks for a business, government or non-profit agency. Internships are individually arranged with the sponsoring agency under the supervision of the Shriver Center. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Pass/Fail", "Course ID": "54875", "Consent": "No Special Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HONR 490", "Name": "Senior Honors Project", "Credits": "1", "Description": "A formal research paper, an extended essay, a report of experimental research, a performance or a portfolio of creative work that represents the outcome of an independent project by a member of the Honors College. Note: Permission to register will be granted after the student submits a written proposal describing the proposed Honors project, which then is approved and signed by the faculty mentor and the Honors College course director.", "Grading": "Graded/Pass Fail", "Course ID": "54876", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HCST 100", "Name": "The Human Context of Science and Technology", "Credits": "3", "Description": "In this course students explore interactions among the humanities, the sciences and technology, including study of the sciences and technology using humanistic approaches, and study of the effects of the sciences and technology on art, philosophy and society. Students will have the opportunity to consider the role of human values in the pursuit of the sciences and in the invention and employment of various technologies. Practical social and political issues relating to science and technology will also be addressed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54602", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HCST 100H ", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)"}, {"Course": "HCST 100H", "Name": "Introduction to the Human Context of Science and Technology", "Credits": "4", "Description": "In this course, students explore interactions among humanities, the sciences and technology, including study of the sciences and technology using humanistic approaches, and the study of the effects of the sciences and technology on art, philosophy and society. Students will have the opportunity to consider the role of human vales in the pursuit of the sciences and in the invention and employment of various technologies. Practical social and political issues relating to science and technology will also be addressed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100042", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "HCST 100 ", "Attributes": "Arts and Humanities (GEP), Writing Intensive (WI), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "HCST 400", "Name": "Independent Study in Human Context of Science and Technology", "Credits": "3", "Description": "Independent study on an approved topic related to the Human Context of Science and Technology. Recommended Preparation: At least one HCST elective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102722", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have taken HCST 100 and earned a grade of C or better."}, {"Course": "HCST 499", "Name": "Advanced Topics in the Human Context of Science and Technology", "Credits": "3", "Description": "Advanced investigation of selected topics in the Human Context of Science and Technology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits. Recommended Preparation: HCST 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102773", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HUM 120H", "Name": "Introduction to the Humanities I", "Credits": "4", "Description": "Part I of a two-semester honors course devoted to an exploration of various aspects of the humanities. The course will consist of substantial reading, discussion and writing based on works of literature, history, cultural studies, philosophy and the arts of Western and non-Western cultures. Fieldtrips and attendance at the Humanities Forum are an integral part of the course. Team-taught by professors from two disciplines. Note: Acceptance into the Humanities Scholarship Program required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054878", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "HUM 121H", "Name": "Introduction to the Humanities II", "Credits": "4", "Description": "Part II of a two-semester honors course devoted to an exploration of various aspects of the humanities. The course will consist of substantial reading, discussion and writing based on works of literature, history, cultural studies, philosophy and the arts of Western and non-Western cultures. Fieldtrips and attendance at the Humanities Forum are an integral part of the course. Team-taught by professors from two disciplines. Note: Acceptance into the Humanities Scholarship Program required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054879", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "HUM 250", "Name": "Interdisciplinary Studies in the Humanities", "Credits": "3", "Description": "Selected interdisciplinary topics in the humanities. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054884", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HUM 260", "Name": "Issues in Photography and the Humanities", "Credits": "3", "Description": "This course will explore the relationships between photography and the humanities by examining issues that have common relevance, such as Realism, Modernism, environmentalism, eroticism, censorship, pornography, multiculturalism, and Postmodernism. Through significant learning experiences, images and texts will be analyzed and discussed, and historical perspectives will be provided. Opportunities will be provided for students to examine original materials and become acquainted with primary sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054887", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "IS 101", "Name": "Introduction to Computer Based Systems", "Credits": "3", "Description": "An overview of computer information systems. This survey course introduces computer hardware, software, procedures, systems and human resources, and it explores their integration and application in business and other segments of society. The fundamentals of computer problem-solving and programming in a higher-level programming language are discussed and demonstrated.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54988", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture"}, {"Course": "IS 101H", "Name": "Introduction to Computer Based System", "Credits": "3", "Description": "An overview of computer information systems. This survey course introduces computer hardware, software, procedures, systems and human resources, and it explores their integration and application in business and other segments of society. The fundamentals of computer problem-solving and programming in a higher-level programming language are discussed and demonstrated.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100202", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture"}, {"Course": "IS 101Y", "Name": "Introduction to Computer Based Systems", "Credits": "4", "Description": "An overview of computer information systems. This survey course introduces computer hardware, software, procedures, systems and human resources, and it explores their integration and application in business and other segments of society. The fundamentals of computer problem-solving and programming in a higher-level programming language are discussed and demonstrated.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54989", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture"}, {"Course": "IS 125", "Name": "Information Systems Logic and Structured Design", "Credits": "3", "Description": "This course teaches the development of well-structured solutions to various programming applications as a preparation for programming language courses. Concepts of data representation, handling and physical/logical interface are emphasized. Various logical and mathematical tools for problem-solving are introduced. This course also includes a unit on the basics of Microsoft Office, in particular MS Word, PowerPoint, and Excel. BTA majors without prior exposure to MS Office should take IS 101 or IS 125 before taking IS 295 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51093", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 147", "Name": "Introduction to Computer Programming", "Credits": "3", "Description": "This course introduces the basic principles and techniques involved in computer programming and computing. Methods of algorithm development, program development, and program design are taught using an object-oriented programming language. Projects are geared toward those typically encountered in the Information Systems field. Recommended Preparation: IS 101  or COMP 101 ", "Grading": "Graded", "Course ID": "54990", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 199", "Name": "Service-Learning and Information Systems", "Credits": "1", "Description": "This service-learning experience is for all levels of students providing IS-related support for community organizations. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "54991", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must also be enrolled in PRAC 096."}, {"Course": "IS 202", "Name": "Systems Analysis Methods", "Credits": "3", "Description": "Overview of the system development life cycle. Emphasis on current system documentation through the use of both classical and structured tools/techniques for describing process flows, data flows, data structures, file designs, input and output designs, and program specifications. Discussion of the information gathering and reporting activities and of the transition from analysis to design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51025", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 246", "Name": "Topics in Programming Languages and Tools", "Credits": "3", "Description": "This course will introduce a high-level programming language or a development tool. The specific language or tool may vary and more than one may be offered (the letter suffix will be used to distinguish them). Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54992", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Visual Basic, Programming Lang C#, Prog Lang & Tools, Visual Studio, Android Programming for Mobile Applications; Python", "Prerequisite/Corequisite": "You must have completed IS 147 or CMSC 201 with a grade of C or better."}, {"Course": "IS 247", "Name": "Computer Programming II", "Credits": "3", "Description": "This second course in a sequence continues the development of programming and problem-solving skills, focusing on topics such as: lists, searching and sorting, sets, stacks, queues, trees and an introduction to analyses of algorithm time and space requirements.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51280", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete IS 147 and either MATH 151  or MATH 151H  or MATH 155   all with a C or better."}, {"Course": "IS 295", "Name": "Intermediate Business Applications", "Credits": "3", "Description": "Extends the introduction of business-oriented application programs to include intermediate functions from typical productivity software found in many businesses and organizations. Stresses the use of case studies to develop and implement solutions using functions from programs such as spreadsheet and databases. Recommended Preparation: IS 101 or IS 125 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51183", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 296", "Name": "Foundations of Data Science", "Credits": "3", "Description": "This course offers an introduction to data analytics incorporating a synthesis of inferential and computational thinking, through manipulation of real data, anchoring students’ understanding of both the principles and practice of data science. The course teaches critical concepts and skills in computer programming and statistical inference, along with hands-on analysis of real-world datasets, including economic data, document collections, geographical data, and social networks. It also delves into social issues surrounding data analysis such as privacy.", "Grading": "Graded", "Course ID": "102828", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 298", "Name": "Special Topics in Information Systems", "Credits": "1", "Description": "A topic at the intermediate level that deals with the design, implementation or post-installation review of information processing systems. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51026", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "IS 300", "Name": "Management Information Systems", "Credits": "3", "Description": "An overview of management information systems (MIS), including the development of transaction processing systems and their relationship to management reporting systems. The course objectives include developing an understanding of the purpose, functions, components and applications of transaction processing systems and management reporting systems in private and public organizations, and describing and evaluating policies for information resource management. Recommended Preparation: IS 101 or COMP 101 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54993", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "IS 300H "}, {"Course": "IS 300H", "Name": "Management Information Systems", "Credits": "3", "Description": "An overview of management information systems (MIS), including the development of transaction processing systems and their relationship to management reporting systems. The course objectives include developing an understanding of the purpose, functions, components and applications of transaction processing systems and management reporting systems in private and public organizations, and describing and evaluating policies for information resource management. Recommended Preparation: IS 101 or COMP 101 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100355", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "IS 300 "}, {"Course": "IS 303", "Name": "Fundamentals of Human-Computer Interaction", "Credits": "3", "Description": "This course provides a survey of human factors and human computer interaction relevant to the design and use of information systems. It describes the contributions of information systems, computer science, psychology, sociology and engineering to human-computer interaction. Emphasis is placed on human factors theories, human information processing concepts, interaction design approaches and usability evaluation methods. Application areas and current research are also reviewed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51335", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 202 or IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 304", "Name": "Ethical Issues in Information Systems", "Credits": "3", "Description": "A survey course that reviews the ethical impact of information systems and related technology throughout the world. The course examines the policy issues that relate to the use of information systems, such as persona, privacy, rights of access, security, transborder data flow and confidentiality. Recommended Preparation: ENGL 100 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51336", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete any IS course or any CMSC course or COMP 101 all with a ‘C’ or better."}, {"Course": "IS 310", "Name": "Software and Hardware Concepts", "Credits": "3", "Description": "A survey of technical topics related to computer systems with emphasis on the relationships between hardware architecture, system software and applications software. The architecture of processors and storage systems are explored, and the implications for systems software design are covered, along with the impact of hardware and system software design on the development of application programs in a business environment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51225", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed  IS 147 or  CMSC 201 or CMSC 201H   and either MATH 151 or MATH 151H   or MATH 155  all with a grade of C or better "}, {"Course": "IS 317", "Name": "Accounting Information Systems", "Credits": "3", "Description": "This course examines accounting systems concepts and technologies, transaction processing systems and the control of accounting information. The roles and uses of technology will be explored in regard to accounting systems design, financial and processing controls, performance evaluation and information security.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50061", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ECAC 317 ", "Prerequisite/Corequisite": "You must have completed ECON 122 with a grade of C or better to take this course."}, {"Course": "IS 320", "Name": "Advanced Business Applications", "Credits": "3", "Description": "Students will analyze, design and implement solutions to examples of real-world business problems using advanced database and spreadsheet software that is commonly found in business today.", "Grading": "Graded", "Course ID": "100228", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 295 with a C or better."}, {"Course": "IS 325", "Name": "Introduction to Management Science", "Credits": "3", "Description": "A survey of the concepts and techniques of management science, including decision-making tools, mathematical programming, networks and operations management, and simulation. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51130", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 and either MATH 151 or MATH 155 with a grade of C or better."}, {"Course": "IS 350", "Name": "Business Communications Systems", "Credits": "3", "Description": "A survey of business data communications for end users of computer networks. Students will gain a basic understanding of the features, operations and limitations of different types of communications and network systems. Topics covered include: fundamentals of data and signals, telecommunications systems, wired and wireless media, error control, local-area networks, wide-area networks, the Internet and network security. This course will provide the student the knowledge and ability to interact with the system professional administering these areas.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51094", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "IS 300 and (MATH 155 or MATH 151) with a C or better. This course is available to BTA majors or IS minors only."}, {"Course": "IS 352", "Name": "Women, Gender, and Information Technology", "Credits": "3", "Description": "This course examines critical issues concerning women, gender, and information technology. It considers women’s critical contributions to technology, from the 19th century Analytical Engine to contemporary cybersecurity industry; how women and girls fare in IT educational and professional settings; and how these issues intersect with multiple dimensions including nationality, race, class, and age. Students connect these issues to their personal experiences, academic plans, and career choices. · Recommended Preparation: A prior course in Computer Science, Information Systems or Gender and Women’s Studies.", "Grading": "Graded/Pass Fail", "Course ID": "050049", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 352H , GWST 352H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "CMSC 352, GWST 352 ", "Prerequisite/Corequisite": "You must have completed one IS, CMSC, or GWST course with a grade of C or better."}, {"Course": "IS 361", "Name": "Technology for Management of Aging Services", "Credits": "3", "Description": "This course will introduce students to the history of technology, both as a social/cultural phenomenon that has shaped the lives of those entering their later years as well as an enabler to improve and enhance quality of life for aging Americans. Students will be introduced to various types of technology and to how they can be used to improve the care and quality of life for aging Americans. Recent advances in technology such as electronic health records, home monitoring devices, software and tools that enhance seniors’ connections with the outside world and turn therapy into recreation, and electronic tools that can be used to manage and enhance an organization’s approach to improving its culture and care practices will be examined. Guest speakers and opportunities to see some of these technologies either in use or through live demonstrations or video will be featured.", "Grading": "Graded", "Course ID": "100021", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AGNG 361 ", "Prerequisite/Corequisite": "You must complete any AGNG course and any IS course or any CMSC course or COMP 101 all with a ‘C’ or better."}, {"Course": "IS 369", "Name": "Research Seminar: Writings In Information Systems", "Credits": "3", "Description": "This seminar course introduces students to current research writing in the fields related to Information Systems. Students will be required to read examples of current research publications in order to improve their professional analytical, communications and interacting skills. The course is designed to improve students skills through reading and critiquing the IS literature, preparing written reviews of journal articles, making presentations, and interacting collaboratively. The content areas for this work will relate to the broad topical areas that encompass the field of information systems that have been encountered through other courses in the program.  Recommended Preparation: STAT 351 ", "Grading": "Graded", "Course ID": "54994", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENGL 100 and one IS 200 or IS 300 level course with a C or better."}, {"Course": "IS 387", "Name": "Information Architecture for the Web", "Credits": "3", "Description": "This course focuses on the creation and organization of web content that meets the information needs of end-users and serves the communication purposes of the site’s sponsors or creators. Students will learn how to analyze information architecture, navigation, audience and usability of good and bad Websites; conduct online research about best practices; talk with Web content developers from a variety of fields; and develop the Web content plan for a site.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51227", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete (IS 247 or CMSC 202) and IS 303 with a C or better. IS 303 can be taken concurrently."}, {"Course": "IS 397", "Name": "Health IT Internship", "Credits": "3", "Description": "This course provides the opportunity for students in the Information Systems Management, B.S., particularly those enrolled in the Health Information Technology Certificate, to earn academic credit while employed in a professional internship position that is related to Health IT. This course is repeatable for credit. Students may complete a maximum of 6 credits. Note: Requires a GPA of 2.5 or better, at least 30 credits completed towards graduation, and co-enrollment in the Career Center’s PRAC.", "Grading": "Pass/Fail", "Course ID": "102469", "Consent": "Department Consent Required", "Components": "Internship"}, {"Course": "IS 399", "Name": "Cooperative Education in Information Systems Management", "Credits": "1", "Description": "This course provides the opportunity for students in the Information Systems Management, B.S. to earn academic credit while employed in a professional position under the Cooperative Education Program. The course is repeatable to a maximum of six credits for a second co-op assignment. Course grading is based on the student meeting the requirements of the Office of Professional Practice and an acceptable performance evaluation from the employer. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "51131", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete PRAC 98A or PRAC 98B or PRAC 98C or PRAC 99 or PRAC 99A or PRAC 99B. You can also be concurrently enrolled in these classes."}, {"Course": "IS 400", "Name": "Individual Study in Information Systems", "Credits": "1", "Description": "Course open to students in the Information Systems Management, B.S. only. Students considering enrolling in this course are encouraged to meet with the faculty member coordinating the individual study to determine the course requirements and their IS advisor to determine if the course fits their needs. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "54995", "Consent": "Department Consent Required", "Components": "Research"}, {"Course": "IS 403", "Name": "User Interface Design", "Credits": "3", "Description": "A second-semester human computer interaction course in which the student will have the opportunity to apply the user interface theories, guidelines and principles presented in the introductory course. The goal of the course is for the students to follow the complete systems development life cycle in analyzing, designing, developing, implementing and evaluating an interactive user interface. Course activities include producing project milestone deliverables, developing a design report, coding an interactive interface and conducting a formal interface evaluation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51337", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 303  with a grade of C or better"}, {"Course": "IS 410", "Name": "Introduction to Database Design", "Credits": "3", "Description": "This course introduces the student to the process of database development, including data modeling, database design and database implementation. Students learn basic interactive SQL for both data definition and queries. Students practice design skills by developing a small database project. This course requires consent of the department, where consent will be granted only to students who have completed the IS BS Gateway.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51282", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 300  and IS 310  with a grade of B or better before registering for this course."}, {"Course": "IS 413", "Name": "GUI Systems Using JAVA", "Credits": "3", "Description": "This course introduces the student to graphical user interface systems using the most current version of Java. Students will learn to implement a series of interactive stand-alone or Web-based interfaces. Event handling and multi-threaded Java programs will be studied. Image and data transmission via the Internet will be presented. Students will read articles from the current research literature that offer guidelines in interface design. Familiarity with UNIX file and directory manipulation is recommended.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51096", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 247 or CMSC 202 with a ‘C’ or better."}, {"Course": "IS 417", "Name": "Information Systems for Auditors", "Credits": "3", "Description": "Information Systems Auditing involves the examination of controls within an organization’s IT infrastructure. Formerly known as an EDP Audit, the IS Audit involves collecting and evaluating evidence about an organization’s systems, practices and operations. This course covers methods and outcomes of those procedures as well as the impact and implications involving controls mandated by governmental agencies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50062", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ECAC 420 ", "Prerequisite/Corequisite": "You must have completed ECAC 321 OR IS 300 both with a grade of C or better."}, {"Course": "IS 420", "Name": "Database Application Development", "Credits": "3", "Description": "The course offers hands-on experience for developing client/server database applications using a major database management system. Students learn how to create and manipulate database objects, including tables, views and sequences; develop program units using SQL; and implement client applications such as forms and reports. The course provides students with firsthand experience developing prototype client/server applications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51184", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must have completed IS 410 with a grade of C or better."}, {"Course": "IS 425", "Name": "Decision Support Systems", "Credits": "3", "Description": "This course provides an overview of theoretical and organizational aspects of decision support systems (DSS), including descriptive and prescriptive decision-making concepts, individual and group decision support systems, and executive information systems. Management of DSS within the end-user environment also is discussed. Projects using DSS software are required, and case examples are discussed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51228", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": " You must have completed IS 410, MGMT 210, MATH 215 or MATH 221 with a ‘C’or better."}, {"Course": "IS 427", "Name": "Introduction to Artificial Intelligence: Concepts and Applications", "Credits": "3", "Description": "This course will provide an introduction to, and hands-on experience with, several artificial intelligence (AI) techniques. It will begin with the concepts and design of knowledge-based systems; the students will identify the issues arising in the design of rule-based systems. Machine learning, particularly neural network topologies will be introduced. The class also will include a discussion of recent advances in AI, including intelligent agents, natural language processing, evolutionary computing and case-based reasoning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51075", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete (IS 247 or CMSC 202) and (MATH 215 or MATH 221), each with a C or better."}, {"Course": "IS 428", "Name": "Data Mining Techniques and Applications", "Credits": "3", "Description": "Data mining is the exploration and analysis of large quantities of data to discover hidden and meaningful patterns. Students will learn both how data mining techniques work and how to apply data mining to various business and organizational contexts in this course. Students will gain an in-depth understanding of how data mining is changing the way businesses understand their customers and make decisions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54996", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 410 and STAT 351 with a grade of C or better."}, {"Course": "IS 430", "Name": "Information Systems and Security", "Credits": "3", "Description": "A survey course relating to the establishment and maintenance of a practical information security program. The security implications of databases, telecommunications systems and software are examined, as are techniques to assess risks and to discover abuses of systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51132", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 and IS 310 with a grade of C or better."}, {"Course": "IS 432", "Name": "Computer Viruses", "Credits": "3", "Description": "Through a review of the current literature, a survey of state-of-the-art software tools and an examination of actual microcomputer-based viruses, the course is intended to prepare students for the eventuality of having to protect their machines and data against the increasingly common threat of viruses.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51097", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 434", "Name": "The Evolution of Modern Information Systems", "Credits": "3", "Description": "This course examines the impact of information systems on nearly every aspect of life in the United States and other countries. It traces the developments that have made this situation possible, especially those changes following the release of the personal computer and the rise of networking. Included are topics relating to the increasing reliance on information systems within the economic and social context of the computer revolution.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51185", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 436", "Name": "Structured Systems Analysis and Design", "Credits": "3", "Description": "A capstone course involving advanced study and application of structured analysis and design methods throughout the system life cycle. Emphasis is given to the common approaches for gathering requirements, modeling, analyzing and designing information systems. Managing the complexity of system development projects is also addressed. These skills are applied via a semester-long, team-based, field research project.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51029", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 410 with a grade of C or better."}, {"Course": "IS 437", "Name": "Applied Systems Design", "Credits": "3", "Description": "Applied Systems Design extends material from IS 436 and allows students to apply material from IS 436 in project teams to create a working Information System. Emphasis is on real-world requirements and constraints. Students may have to sign non-disclosure forms if involved in projects sponsored by organizations providing design opportunities.", "Grading": "Graded", "Course ID": "54997", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 436 with a C or better before you can enroll in this course."}, {"Course": "IS 438", "Name": "Project Management", "Credits": "3", "Description": "A course covering the manner in which a system project is planned, scheduled and controlled during a project’s life. The use of project management techniques such as PERT (Project Evaluation and Review Technique) and Gantt charts will be examined in depth, as will be other techniques of planning, scheduling and controlling projects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51229", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 440", "Name": "Integrating Technology into Business Processes", "Credits": "3", "Description": "Office information and decision support systems are examined as emerging and critical elements in business data and information systems. Emphasis is given to information processing considerations at the systems level, including analysis and management of support activities such as data and records management, electronic filing and retrieving systems, word processing, micro- and repro-graphics, and (tele)communications. The course includes discussion of person/machine interfaces and appraisals of current and future technological trends and their impacts on data processing and office equipment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51133", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "IS 202 with a grade of C or better and you must be concurrently enrolled in or have completed IS 350 with a grade of C or better."}, {"Course": "IS 448", "Name": "Markup and Scripting Languages", "Credits": "3", "Description": "IS 448 covers the history, theory, and practice of markup languages and their associated scripting languages. This course covers client-side web technology, such as Javascript and server-side web technology, such PHP, markup languages, such as XML, and common databases used with web technology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51091", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 247 or CMSC 202 with a C or better."}, {"Course": "IS 450", "Name": "Data Communications and Networks", "Credits": "3", "Description": "This is an introductory survey course in data communications and networking. It surveys basic theory and technology of computer networking. A single networking protocol stack is also covered in depth. This course requires consent of the department, where consent will be granted only to students who have completed the IS BS Gateway.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51230", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 300  and IS 310  with a grade of B or better before registering for this course and complete MATH 215 or MATH 221 with a C or better."}, {"Course": "IS 451", "Name": "Network Design and Management", "Credits": "3", "Description": "This course covers implementation and administration of enterprise networking and distributed applications. It includes readings and case studies on middleware, network architecture for distributed applications and selected technologies to support enterprise systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51098", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450 with a grade of C or better."}, {"Course": "IS 451M", "Name": "LAN Management Using Microsoft", "Credits": "3", "Description": "A hands-on course using the latest version of the Microsoft server, which covers the design, building, management, security and technical issues involved in a local area network.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51030", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450 with a grade of C or better."}, {"Course": "IS 451U", "Name": "LAN Management Using Unix", "Credits": "3", "Description": "A hands-on course taught in a computer classroom in UNIX operating system management and networking. The design, building, management, security and technical issues involved in a local area network will be covered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51231", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450  with a grade of C or better."}, {"Course": "IS 452", "Name": "Internetworking", "Credits": "3", "Description": "This course covers network routing and other topics in internetworking. This will be a project-oriented course that will consist of lectures and hands-on laboratory experience creating projects that simulate real-world networks.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51077", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450 with a grade of C or better."}, {"Course": "IS 454", "Name": "Survey of Telecommunications", "Credits": "3", "Description": "This course examines the design and management issues in communications beyond the local area, including wide-area networks, high speed data transfer, integrated voice and data communications, distributed processing and internetworking.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51284", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450 with a grade of C or better."}, {"Course": "IS 456", "Name": "Telecommunications Policy", "Credits": "3", "Description": "This course presents and discusses current telecommunications policy issues based on technological advances and both national and international regulatory developments. The course provides a background in the development and progression of telecommunications regulation and discusses the impact of such policies on various segments of the telecommunications industry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51032", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 450 with a grade of C or better."}, {"Course": "IS 460", "Name": "Health Care Informatics I", "Credits": "3", "Description": "The focus of this course is on health care information systems. Examples of topics covered include: requirements and design, providers and payers, regulations, e-commerce, privacy and security, personnel and vendors, knowledge and diffusion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51338", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 461", "Name": "Health Care Informatics II", "Credits": "3", "Description": "The focus of this course is on advanced topics in health care information systems. Examples of topics include e- commerce standards, government regulation of privacy and security, and cancer information systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51099", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "IS 464", "Name": "Telemedicine", "Credits": "3", "Description": "This course addresses topical issues of telemedicine in a variety of healthcare contexts. It covers issues in designing, developing, deploying and evaluating telemedicine systems; the role of information technologies in supporting communication and collaboration; the legal and policy issues around telemedicine system use; and current topics on new technologies in telemedicine. Students will be exposed to ongoing telemedicine research projects and state-of-the-art telemedicine systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51100", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 with a grade of ‘C’ or better."}, {"Course": "IS 467", "Name": "Health IT Project", "Credits": "3", "Description": "This course provides the opportunity for students in the Information Systems Management, B.S., particularly those enrolled in the Health Information Technology Certificate, to synthesize material learned in previous coursework by applying it to a Health IT -related project related to the student’s interests. It consists of an independent study/research project, either individual or in a small group, directed by a faculty member.", "Grading": "Graded", "Course ID": "102470", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "IS 469", "Name": "Senior Project in Information Systems", "Credits": "1", "Description": "This course is designed to help a student synthesize material learned in other courses by applying it to a project in the student’s area of interest. It is open to students in the Information Systems Management, B.S. by permission of the department. It will consist of an independent study/research project directed by a faculty member or a work-related internship experience focused on computer systems in a setting appropriate to the student’s interests under the supervision of a faculty member. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51033", "Consent": "Department Consent Required", "Components": "Research", "Prerequisite/Corequisite": "You must have attained Senior standing and completed two or more IS courses at the 400 level with a grade of C or better."}, {"Course": "IS 470", "Name": "Software Testing", "Credits": "3", "Description": "This course will examine concepts and techniques for testing of software in development environments. Topics include, testing software at the unit, subsystem and system levels, approaches to automatic and manual test data generation, creating test oracles, coverage analysis to decide when to stop testing, test prioritization, mutation testing, regression testing, automated software testing tools, and testing trends in current development environments.", "Grading": "Graded", "Course ID": "102830", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 247 with a C or better."}, {"Course": "IS 471", "Name": "Data Analytics for Cybersecurity", "Credits": "3", "Description": "Cyber security is pervasive in the areas of not only computer networks but also sensor networks, industrial control systems and user devices.  One common thread in these types of systems and end users is data.  This course provides an introduction to data analytics for multiple aspects of cyber security and focuses on data analytics methods for discovering anomalies pertaining to Cyber threats through exercises in programming an hands on data analytics tools.", "Grading": "Graded", "Course ID": "102380", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 410 with a C or better."}, {"Course": "IS 472", "Name": "Software Security", "Credits": "3", "Description": "Many cybersecurity attacks are facilitated by software vulnerabilities, i.e. characteristics of software source code that unintentionally allow unauthorized access to computer memory.  Future cybersecurity professionals require an understanding of various techniques that can be applied throughout the software development lifecycle to prevent, detect, and remove such vulnerabilities.  Through this course students will: 1) Develop an understanding of common vulnerabilities and emerging attacks; 2) Learn how to apply secure coding standards and techniques to ensure that their source code is as free from vulnerabilities as possible; 3) Be provided hands-on experience in handling software vulnerabilities.", "Grading": "Graded", "Course ID": "102381", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete IS 247  with a C or better"}, {"Course": "IS 474", "Name": "Legal Aspects of Information Systems", "Credits": "3", "Description": "This course focuses on the legal issues surrounding the use and misuse of computer-stored information and copyrights and piracy of computer software.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51285", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed IS 300 or IS 300H with a grade of C or better."}, {"Course": "IS 478", "Name": "Cybersecurity Internship", "Credits": "3", "Description": "This course provides the opportunity for students in the Information Systems Management, B.S., particularly those enrolled in the Cybersecurity Informatics Certificate, to earn academic credit while employed in a professional internship that is related to cybersecurity. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "102383", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "Student must have at least a GPA of 2.5 or better, 30 credits completed toward graduation, and a co-enrollment in the Career Center’s PRAC."}, {"Course": "IS 479", "Name": "Cybersecurity Project", "Credits": "3", "Description": "This course provides the opportunity for students in the Information Systems Management, B.S., particularly those enrolled in the Cybersecurity Informatics Certificate, to synthesize material learned in previous coursework by applying it to a cybersecurity-related project related to the student’s interests. It consists of an independent study/research project, either individual or in a small group, directed by a faculty member.", "Grading": "Graded", "Course ID": "102389", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "IS 498", "Name": "Special Topics in Information Systems", "Credits": "1", "Description": "Topics in the design and implementation of information processing systems. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51339", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Prog For Biomedical Info, Wireless Networking, Success Thru Appl Learn, Intelligent Invest Sys, Entrepreneurship For It, Erp:Data Integ/Anal SAS, Network Systems And Serv, AIS, Advanced Web Development, Foundations of Public Health Informatics, Technical and Policy Issues of Privacy, The Philosophy of Information Technology, Semantic Web, Mobile Human Computer Interaction, Cybersecurity"}, {"Course": "INDS 330", "Name": "Ways of Knowing", "Credits": "3", "Description": "How can the insights from various disciplines inform our understanding of difficult issues? This course explores methods of different academic disciplines and their implications for an interdisciplinary understanding of complex problems. Each year students will examine a compelling issue (e.g. AIDS, energy policy) by integrating the contributions of several disciplines. Students will develop skills in interdisciplinary research and problem-solving, oral and written communication, and in integrating diverse perspectives. Recommended Preparation: ENGL 226 ", "Grading": "Graded", "Course ID": "54977", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "INDS 330H ", "Topics": "Ways Of Knowing", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent  with a C or better."}, {"Course": "INDS 330H", "Name": "Ways of Knowing", "Credits": "3", "Description": "How can the insights from various disciplines inform our understanding of difficult issues? This course explores methods of different academic disciplines and their implications for an interdisciplinary understanding of complex problems. Each year students will examine a compelling issue (e.g. AIDS, energy policy) by integrating the contributions of several disciplines. Students will develop skills in interdisciplinary research and problem-solving, oral and written communication, and in integrating diverse perspectives.", "Grading": "Graded", "Course ID": "100015", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "INDS 330 ", "Topics": "Ways Of Knowing", "Attributes": "Writing Intensive (WI)"}, {"Course": "INDS 335", "Name": "Interdisciplinary Degree Plan Writing Seminar", "Credits": "3", "Description": "This seminar guides students through the process of claiming one’s education by researching and assessing one’s professional goals and the academic/co-curricular pathways by which they may be achieved. Students each write a formal, individualized degree plan that includes a description of the degree concept; a course list with rationale for each within that degree; a description of activities beyond the classroom that support the degree; and a professional cover letter. Students focus on the processes of close editing, re-writing, and collaboration.", "Grading": "Graded", "Course ID": "102088", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete INDS 330  with a ‘C’ or better."}, {"Course": "INDS 399", "Name": "Guided Reading in Individualized Study", "Credits": "1", "Description": "Directed studies carried out under the supervision of faculty mentors previously identified within a student’s INDS degree proposal, under administrative oversight of the student’s primary INDS program advisor. The purpose of this course is to obtain a thorough grounding in key literature pertaining to the area of undergraduate research identified within the student’s degree proposal as a target of the capstone research experience (IINDS 490). Recommended Preparation: An approved INDS degree proposal.", "Grading": "Graded", "Course ID": "102089", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete INDS 335 with a ‘C’ or better."}, {"Course": "INDS 400", "Name": "Individualized Study: Independent Study", "Credits": "1", "Description": "Independent study or research with a faculty mentor focused on an issue related to the capstone. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54978", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "INDS 400H "}, {"Course": "INDS 400H", "Name": "Individualized Study: Honors Independent Study", "Credits": "1", "Description": "Independent study or research. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54979", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "INDS 400 "}, {"Course": "INDS 410", "Name": "Individualized Study: Internships", "Credits": "1", "Description": "Internships are encouraged in Individualized Studies. Students may request up to six credits of internship experience. This course is repeatable for credit. Students may complete a maximum of 6 credits. Note: Requests for more than six credits must be approved by the director of the Individualized Studies Program. Permission is granted after proposal is approved.", "Grading": "Pass/Fail", "Course ID": "54980", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "INDS 430", "Name": "Individualized Study Seminar", "Credits": "3", "Description": "A seminar designed to examine the integrative nature of individualized studies through readings, discussions and class presentations on important topics that cut across academic disciplines. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54981", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "INDS 430H ", "Topics": "Astrobiology, Kinetic Sculpture Project, Game Design and Management"}, {"Course": "INDS 430H", "Name": "Honors Individualized Study Seminar", "Credits": "3", "Description": "A seminar designed to examine the integrative nature of individualized studies through readings, discussions and class presentations on important topics that cut across academic disciplines. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54982", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "INDS 430 "}, {"Course": "INDS 480", "Name": "Individualized Study: Capstone Project Seminar", "Credits": "3", "Description": "With consultation from faculty mentors, students in this seminar will develop and submit a proposal for their capstone project— a prerequisite to enrollment in the final capstone project course, INDS 490. Strategies for conducting interdisciplinary research and designing a cohesive, integrated, manageable project will be discussed in addition to elements of an effective literature review and reflection on the scholarship of interdisciplinarity.", "Grading": "Graded", "Course ID": "54985", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete INDS 335  with a grade of ‘C’ or better."}, {"Course": "INDS 490", "Name": "Individualized Study: Capstone Project", "Credits": "3", "Description": "An independent study or other creative effort demonstrating the accomplishment of the approved objectives in the student’s individualized studies proposal. Note: Permission to register will be granted from the Individualized Studies Office after the student submits a written statement describing the capstone project, which has been approved and signed by the faculty advisors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54986", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "INDS 490H ", "Prerequisite/Corequisite": "You must complete INDS 480 with a C or better."}, {"Course": "INDS 490H", "Name": "Individualized Study: Capstone Project - Honors", "Credits": "4", "Description": "An independent study or other creative effort demonstrating the accomplishment of the approved objectives in the student’s individualized studies proposal. Note: Permission to register will be granted from an Individualized Studies advisor after the student submits the completed INDS 490 form, which has been approved and signed by the faculty mentors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54987", "Consent": "Department Consent Required", "Components": "Independent Study", "Course Equivalents": "INDS 490 "}, {"Course": "JPNS 101", "Name": "Elementary Japanese I", "Credits": "4", "Description": "An introduction to Japanese language and culture. Focus on basic grammatical patterns to handle specific conversational situations and to read and write simple passages using Hiragana, Katakana and some kanji. After successfully complete this course, students are able to understand short, simple utterances in specific context, exchange greetings, name a number of familiar objects within their immediate environment, for example, daily life, family, etc.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55042", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "JPNS 102", "Name": "Elementary Japanese II", "Credits": "4", "Description": "Continuation of JPNS101. Emphasis on 4 basic skills; listening, speaking, reading and writing within the context of students¿ immediate surroundings, for example, comparing two or more items, expressing opinions, reasoning, informal speech and etc. Continue introducing new kanji. After successfully completing this course, students are able to understand short, simple utterances in specific contexts, respond to simple, direct questions, or requests for information.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55044", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete JPNS 101 with a C or better before taking this class or have completed 2 years of high school Japanese."}, {"Course": "JPNS 201", "Name": "Intermediate Japanese I", "Credits": "4", "Description": "Building on the grammar patterns and vocabulary covered through JPNS 102, this course focuses on language use in a wide range of situations, including polite expression in formal situations. Students will explore different use of language depending on the situation by speaking, listening, reading and writing as well as incorporating cultural concepts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55046", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must have completed JPNS 102 with a C or better before taking this class or have completed 3 years of high school Japanese."}, {"Course": "JPNS 202", "Name": "Intermediate Japanese II", "Credits": "4", "Description": "This is the second sequence in the Intermediate Japanese. Continued emphasis on complex sentence structures to prepare the students for expressing their opinions in Japanese. Students’ critical thinking is encouraged to understand Japanese culture and society deeply by introducing authentic materials on specific topics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55048", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete JPNS 201 with a C or better before taking this class or have completed 4 years of high school Japanese."}, {"Course": "JPNS 300", "Name": "Special Projects in the Japanese Language and Culture", "Credits": "1", "Description": "This course is repeatable for credit.", "Grading": "Graded/Pass Fail", "Course ID": "55050", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "JPNS 301", "Name": "Advanced Japanese I", "Credits": "3", "Description": "This is the first of a two-course sequence for Advanced Japanese. This course focuses on further developing four language skills (listening, speaking, reading, and writing) with emphasis on expressing their views on a range of topics, including socio-cultural issues and current events. The course includes such activities as formal presentations, discussions, intensive readings, and report writings in Japanese as well as kanji practice.", "Grading": "Graded", "Course ID": "101765", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete JPNS 202 with a C or better and/or equivalent"}, {"Course": "JPNS 302", "Name": "Advanced Japanese II", "Credits": "3", "Description": "This is the second of a two-course sequence for Advanced Japanese. This course focuses on continuing development of four language skills (listening, speaking, reading and writing) with emphasis on expressing their views on a range of topics, including socio-cultural issues and current events. In addition to regular oral practice, this course has an increasing emphasis on cultural aspect of the language use. The course includes such activities as formal presentations, discussions, intensive readings, and report writings in Japanese as well as kanji practice.", "Grading": "Graded", "Course ID": "101766", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete JPNS 301 with the grade of C or higher and/or equivalent."}]