[{"Course": "ANTH 499", "Name": "Independent Study", "Credits": "1", "Description": "This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52256", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete a minimum of 9 credits of Anthropology courses each with a minimum grade of “C”."}, {"Course": "ARBC 101", "Name": "Elementary Arabic I", "Credits": "4", "Description": "This course is an introduction to Arabic through a communicative approach. The language is learned in a thematic context, based on real-life situations. Listening comprehension and basic speaking skills are emphasized, but reading and writing the Arabic alphabet are also taught, as well as important elements of Arab culture and civilization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52268", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "ARBC 102", "Name": "Elementary Arabic II", "Credits": "4", "Description": "A continuation of ARBC 101. Emphasis is on extending skills in spoken Arabic within the context of real-life situations. A greater amount of reading and writing is included, based on authentic material from Arab culture and civilization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52270", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed ARBC 101 with a C or better before taking this class or have completed 2 years of high school Arabic."}, {"Course": "ARBC 201", "Name": "Intermediate Arabic I", "Credits": "4", "Description": "A continuation of ARBC 102. The course will include a survey of more advanced grammar; emphasis will be on developing listening comprehension and on increasing conversational fluency in the language. There will be more reading of prose texts reflecting aspects of Arab culture and civilization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52272", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must have completed ARBC 102 with C or better before taking this class or have completed 3 years of high school Arabic."}, {"Course": "ARBC 202", "Name": "Intermediate Arabic II", "Credits": "4", "Description": "This course develops a more precise and coherent use of the Modern Standard Arabic language. It develops the speaking, reading, writing, and listening skills, with more focus on syntax, morphology and grammar. Students will be involved in meaningful, functional communication through interactive activities that might be encountered in real life complex situations. The course will include a variety of reading and writing activities taken from materials representative of cultural topics.", "Grading": "Graded", "Course ID": "52274", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must have completed ARBC 201 with a grade of C or better before taking this class or have completed 4years of high school Arabic."}, {"Course": "ARBC 301", "Name": "Advanced Modern Standard Arabic I", "Credits": "3", "Description": "Arabic 301 is the first part of a third-year sequence in Modern Standard Arabic (MSA). This course is designed to help students reach a high standard of proficiency in Arabic, by strengthening their reading-comprehension skills, expanding their vocabulary repertoire in media and poetry, enhancing their translation skills from Arabic to English and vise versa, refining and rebuilding their knowledge of sentence construction, and finally broadening their knowledge about the history of the Arabic poetry and literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102064", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ARBC 202 with a grade of C or better before taking this class."}, {"Course": "ARBC 302", "Name": "Advanced Modern Standard Arabic II", "Credits": "3", "Description": "Arabic 302 is the second part of a third-year sequence in Modern Standard Arabic (MSA). This course is a continuation to what was learned in the previous semester (Arabic 301). It is designed to help students reach a high standard of proficiency in Arabic, by strengthening their reading-comprehension skills, expanding on their vocabulary repertoire, refining and expanding their knowledge of sentence construction and the Arabic verb system, and finally broadening their knowledge of Arabic and Islamic culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102066", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ARBC 301 with a grade C or better."}, {"Course": "ARBC 325", "Name": "Introduction to Arabic Dialects", "Credits": "3", "Description": "This course gives students a basic understanding of the linguistics of the Arabic dialects, and of the theory and practice of Arabic dialectology; to give them a solid foundation for future in-depth study of Egyptian (Masri), Levantine (Shami), or Moroccan (Darija) Arabic; and to give them the tools to enable them to independently acquire communicative competence in other Arabic dialects they might encounter in the course of their studies and beyond.", "Grading": "Graded/Audit", "Course ID": "102067", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ARBC 202 with a grade of C or better before taking this class."}, {"Course": "ARBC 333", "Name": "Introduction to Arabic Translation", "Credits": "3", "Description": "This course introduces students to the fundamentals of English-Arabic and Arabic-English translation. The course focuses on translating genres related to different disciplines, in order to enrich students’ vocabulary in various topics. This course provides clear explanations, discussion, examples and exercises that enable students to acquire the skills necessary to enhance their translation methods and understand translation issues. Examples are drawn from variety of sources including journalism, literature, politics, business, and law.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102623", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ARBC 202 with a grade of C or better."}, {"Course": "ARBC 350", "Name": "Arabic Media", "Credits": "3", "Description": "This course introduces the language of print and Internet media to students of Arabic aiming to reach the advanced Arabic level. It familiarizes students with media vocabulary and text construction. Students will read and discuss media texts and will focus on meaning and text structure. Activities will include learning vocabulary, discussing text meaning, speaking on topics discussed, presentations, and listening and reading of up-to-date texts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102315", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ARBC 202 with a grade of C or better before taking this class."}, {"Course": "ARBC 355", "Name": "Introduction to Arabic Culture and Civilization", "Credits": "3", "Description": "This course is an introductory survey of Arabic culture and civilization representing works from pre-Islamic to later thinkers and scholars. The course will trace the origins of the Arab people, their distinctive culture and their literature. Specific emphasis will be given to the revelation of the Qur’an to the Prophet Muhammad and to the spread of Islamic civilization during and after his death. Attention will also be given to Islam’s interactions with other cultures and its contributions to literature, art, music, and architecture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102316", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ARBC 202 with a grade of C or better before taking this class."}, {"Course": "ARCH 100", "Name": "Introduction to the Archaeology of the Ancient World", "Credits": "3", "Description": "An introduction to the methods used by archaeologists to excavate and date material of the ancient cultures of the Near East, Egypt, Greece and Rome.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52275", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ARCH 120", "Name": "World Archaeology", "Credits": "3", "Description": "An introductory survey of the development of human culture that includes both Old World and New World archaeology. The major objective is to provide students with a worldwide perspective for the study of important cultural innovations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52277", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ARCH 200", "Name": "Greek Archaeology and Art", "Credits": "3", "Description": "The origins and development of the civilization that provides the basis for Western European culture. Architecture, sculpture and other remains will be examined.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52278", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ARCH 200H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ARCH 200H", "Name": "Greek Archaeology and Art- Honors", "Credits": "1", "Description": "This course is for students who wish to take an honors component in connection with ARCH 200. The student must be enrolled in ARCH 200 to be eligible to take ARCH 200. Various topics will be looked at in more depth via discussion, short papers and work on the Web.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52279", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ARCH 200 "}, {"Course": "ARCH 201", "Name": "Roman Archaeology and Art", "Credits": "3", "Description": "The cultures of ancient Italy - the Romans and the Etruscans - are considered, using the evidence provided by architectural, sculptural and other remains.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52280", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ARCH 201H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ARCH 201H", "Name": "Roman Archaeology and Art- Honors", "Credits": "1", "Description": "This course is for students who wish to take an honors component in connection with ARCH 201. The student must be enrolled in ARCH 201 to be eligible to take ARCH 201H. Various topics will be looked at in more depth via discussion, short papers and work on the Web.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52281", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ARCH 201 "}, {"Course": "ARCH 220", "Name": "Archaeology and Art of Ancient Egypt", "Credits": "3", "Description": "This course explores all aspects of the civilization of ancient Egypt: government, religion, hieroglyphs, daily life, mummification, and the afterlife. With emphasis on art and archaeology, this survey ranges from the predynastic period (5000 BCE) to the death of Cleopatra (30 BCE).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100489", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "ARCH 250", "Name": "Topics in Archaeology", "Credits": "3", "Description": "An introductory course to various aspects of classical archaeology. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52282", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Sport/Leisure Anc Greece"}, {"Course": "ARCH 310", "Name": "The Archaeology of Ancient Egypt", "Credits": "3", "Description": "The way of life of Egypt’s people from 4000 B.C.E. until the Roman period, with emphasis upon the architecture, sculpture and painting of the Old, Middle and New Kingdoms.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52284", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ARCH 320", "Name": "The Archaeology of The Land of Israel", "Credits": "3", "Description": "A study of the history and cultures of the land of Israel from Neolithic to Roman times as revealed through archaeology and ancient writers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52285", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed any ARCH course or ANTH 211 or HIST 453 or HIST 455 or HIST 456 and ENGL 100."}, {"Course": "ARCH 325", "Name": "Life and Death in Pompeii", "Credits": "3", "Description": "The town of Pompeii, buried by the eruption of Mount Vesuvius in 79 CE, has yielded enormous insight into Roman social life. This course will investigate the people who lived and died at Pompeii through the houses, streets, tombs, skeletons, food, and objects they left behind. It will also interrogate how we come by this knowledge, examining the long history of excavation and tourism that makes Pompeii a window onto our relationship with the past. Recommended Preparation: ARCH 201 or ANCS 202", "Grading": "Graded", "Course ID": "102391", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "ARCH 330", "Name": "Archaeology of Prehistoric Aegean", "Credits": "3", "Description": "The history of the Aegean - Crete, Greece and the Cyclades - in the Neolithic and Bronze Ages is studied through archaeological remains. Special emphasis is placed on the Minoan and Mycenean civilizations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52286", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Prerequisite/Corequisite": "Must have completed any ARCH course or ANTH 211 or HIST 453 or HIST 455 or HIST 456 and ENGL 100."}, {"Course": "ARCH 340", "Name": "Cities of the Past", "Credits": "3", "Description": "This course deals with questions such as what is a city; how did cities develop, and what did they look like in antiquity? Material remains excavated by archaeologists in the countries surrounding the Mediterranean, from the early city-states of the Near East to the sophisticated urban settlements of the Roman Empire, will serve as models to answer these questions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52287", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Writing Intensive (WI), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "Must have completed any ARCH course or ANTH 211 or HIST 453 or HIST 455 or HIST 456 and ENGL 100."}, {"Course": "ARCH 350", "Name": "Topics in Archaeology", "Credits": "3", "Description": "Topics may include such subjects as Pompeii and ancient burials. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: One course from the following: any ARCH course, ANTH 211 or HIST 453 or HIST 455 or HIST 456.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52288", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Topics:Buried By Vesuvius, Cities Of The Past, Maritime Archaeology, Pompeii, Arch Chesapeake Region, Hellenistic Archaeology, Rise Of Civilization, Underwater Archaeology, Arch Of Anct Egypt&Israe, Archaeology & The Bible, Balt/Md Archaeology, Applied Physics In Arch., Environmental Archeology, Museum Studies"}, {"Course": "ARCH 360", "Name": "Rise of Civilization", "Credits": "3", "Description": "Our understanding of complex societies has been radically altered as a result of excavations in the Near East and Mesoamerica in the past 30 years. This course deals with the archaeological remains of settlements in these two areas, remains that help explain the causes and results of the change from the nomadic life of hunters and gatherers to the settled life of people who live in complex societies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52291", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "Must have completed any ARCH course or ANTH 211 or HIST 453 or HIST 455 or HIST 456 and ENGL 100."}, {"Course": "ARCH 370", "Name": "Maritime Archaeology", "Credits": "3", "Description": "Analysis of aspects of earlier societies that were connected with seafaring, e.g. trade, shipbuilding, harbors and practices developed by maritime cultures. The focus may be on the ancient Mediterranean, or on other regions, such as the Chesapeake, or on a combination of periods. Case studies will demonstrate methods and theories that archaeologists use to derive meaning from artifacts in their cultural context. Recommended Preparation: One course from the following: any ARCH course or ANTH 211 or HIST 453 or HIST 455 or HIST 456.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52292", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ARCH 380", "Name": "Hellenistic Archaeology and Art", "Credits": "3", "Description": "The course will examine Hellenistic art, architecture, daily life, urbanization, trade and other connections among principalities of mainland Greece, Egypt, Asia Minor, the Near East and Rome from the late fourth to first centuries B.C.E. Together with material, culture, major intellectual and religious developments will be considered, e.g., Epicureanism, the Greeks and the Jews, the literature of Alexandria and mystery religions. Recommended Preparation: One course from the following: ANCS 201 or ARCH 200 or ARCH 201 or HIST 453.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52293", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ARCH 397", "Name": "Field Experience in Archaeology", "Credits": "1", "Description": "Archaeological field work. Students may earn academic credit by arrangement with the ancient studies department by working at an approved excavation, museum, laboratory or field school in the United States or abroad. Written work, in addition to practical experience, may be included. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52294", "Consent": "Department Consent Required", "Components": "Field Studies"}, {"Course": "ARCH 399", "Name": "Advanced Readings in Archaeology", "Credits": "2", "Description": "Selected readings to broaden and deepen the student’s background. This course is repeatable for credit. Students may complete a maximum of 4 credits. Recommended Preparation: Permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52295", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ARCH 404", "Name": "Seminar in Classical Archaeology", "Credits": "3", "Description": "Intensive readings in and discussion of a particular period or problem of ancient civilization. Recommended Preparation: Two archaeology courses and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52296", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ARCH 410", "Name": "Archaeological Methods and Theory", "Credits": "3", "Description": "Methods and theories used in archaeology for reconstructing cultural history and processes of cultural change. Emphasis on historical archaeology in both the Old and New Worlds. Recommended Preparation: One course in ARCH or ANTH, or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52297", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 210", "Name": "Visual Concepts I", "Credits": "3", "Description": "Visual Concepts I introduces the visual art major to two-dimensional basic design principles, various perception and notation techniques, expression and subtractive color theory. Other issues covered include symmetry and asymmetry, formal and informal organization, proportion, perspective, visualization, imagination, illusion, rhythm, typography, narrative (linear/nonlinear), collage and text/image relationships.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52303", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 211", "Name": "Visual Concepts II/Camera Vision", "Credits": "3", "Description": "Visual Concepts II introduces the visual art major to creating still images via a camera. Formal and technical issues connected to camera operation, two-dimensional design, lighting, framing and introduction to the chemistry of photography will be covered. Through assignments, theoretical readings and historical examples, issues connected to the apparatus of the camera as a recording device also will be covered. Emphasis will be placed on developing a vocabulary for talking about images and on the ability to think critically about images. This course also will serve as an introduction to using the computer as a tool for manipulating images.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52305", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 212", "Name": "Visual Concepts III/Three Dimensional Form, Space and Interaction", "Credits": "3", "Description": "Visual Concepts III introduces the visual art major to compositional issues as they relate to real, recorded and virtual space. Basic concepts of three-dimensional design, lighting and fabrication are covered, as are navigation and interaction design principles. The body in space is addressed in the context of installation, architecture and site-specific practices.", "Grading": "Graded", "Course ID": "52306", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have achieved admission through portfolio review process (VA Milestone) and completed ART 210 and ART 211 with a grade of “C” or better to take this class."}, {"Course": "ART 213", "Name": "Visual Concepts IV/Time-Based Media", "Credits": "3", "Description": "Visual Concepts IV introduces the visual art major to time-based media and will focus on the relationship of image and sound in time-based media production. Students will study how sequencing and juxtaposition work in relation to narrative and non-narrative animation, video and film.", "Grading": "Graded", "Course ID": "52307", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have achieved admission through portfolio review process (VA Milestone) and completed ART 210 and ART 211 with a grade of “C” or better to take this class."}, {"Course": "ART 214", "Name": "Drawing I/Beginning Drawing", "Credits": "3", "Description": "Drawing I introduces the visual art major to the visual vocabulary of drawing. Through materials and processes, drawing will be explored as a means of visual thinking, a way to depict what we see and visualize what we think, and a method of communicating ideas. Technical skills will be applied to an exploration of representation and visual invention, including figurative imagery. Recommended Preparation: ART 210 either previously or concurrently.", "Grading": "Graded", "Course ID": "52309", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 215", "Name": "Introduction to Art and Media Studies", "Credits": "3", "Description": "Introduction to Art and Media Studies will introduce the visual art major to the conceptual and historical commonalities shared among photography, film, video, computer and other visual arts. Artists working in these interdisciplinary forms will be viewed and discussed.", "Grading": "Graded", "Course ID": "52310", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "ART 216", "Name": "Studies in Visual Culture (Prehistory through the 1750s)", "Credits": "3", "Description": "This course engages students in a focused study of six or seven specific, momentous periods in the history of world art dating from prehistory to the mid-eighteenth century. The selection of topics will be determined by the particular organizing principle adopted by the course instructor. For example, the organizing principle could be that of medium (architecture, painting, sculpture, decorative arts); of belief systems (religion, philosophy); of patronage; or of prevailing technological inventions and discoveries. By studying selected moments in the history of world art in some depth, students will gain an awareness of how art objects and visual culture both shape and represent societies and their histories. Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "100294", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "ART 216H "}, {"Course": "ART 216H", "Name": "Studies in Visual Culture (Prehistory through the 1750s)", "Credits": "3", "Description": "This course engages students in a focused study of six or seven specific, momentous periods in the history of world art dating from prehistory to the mid-eighteenth century. The selection of topics will be determined by the particular organizing principle adopted by the course instructor. For example, the organizing principle could be that of medium (architecture, painting, sculpture, decorative arts); of belief systems (religion, philosophy); of patronage; or of prevailing technological inventions and discoveries. By studying selected moments in the history of world art in some depth, students will gain an awareness of how art objects and visual culture both shape and represent societies and their histories. Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "100613", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "ART 216", "Prerequisite/Corequisite": "You must have been admitted to the Honors College to take this course."}, {"Course": "ART 305", "Name": "Introduction to Cinematic Arts", "Credits": "3", "Description": "In this production course students explore how digital media can be used as a means for creative expression and how this art form has evolved out of experimental film and video art traditions over the past 75 years. This is a hands-on production course. Students will pursue fundamental characteristics of the digital video medium to complete exercises in shooting and editing digital video and a final project. Note: ART 305 is the gateway course and must be passed with a grade of “B” or better for students to continue onto upper-level Cinematic Arts courses.", "Grading": "Graded", "Course ID": "52327", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have completed ART 213 with a grade of ‘C’ or better and completed the VA Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 314", "Name": "Drawing II", "Credits": "3", "Description": "This is an intermediate drawing course that will continue the study of the visual vocabulary of drawing through its materials and processes. Technical skills will be applied to an exploration of representation and visual invention. Issues addressed will include color and figurative imagery and conceptual approaches to drawing. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "52329", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 210 and ART 214 with a grade of ‘C’ or better and completed the Visual Arts Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 315", "Name": "Intermediate Narrative Production", "Credits": "3", "Description": "This class is designed to encourage an organic exploration of narrative cinema, to strengthen trust in your own ideas and instincts, and heighten your curiosity about experimental modes of storytelling. Though we will cover some areas of technical expertise as they relate specifically to narrative film production, students are expected to have a basic understanding of cameras, lights, microphones, and editing. Students will work independently to produce their own short narratives, as well as engaging in a study of contemporary narrative cinema. Recommended Preparation: ART 324 or ART 325", "Grading": "Graded", "Course ID": "052330", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 305 with a ‘B’ or better and the Visual Arts Milestone (portfolio review) or be a declared Visual Arts Minor."}, {"Course": "ART 318", "Name": "Visual Culture of City and Cinema in South Asia", "Credits": "3", "Description": "South Asian cities are loci of culture, commerce, religion, politics, crime and poverty. This course studies urbanism in contemporary South Asia from two perspectives: through the influential lens of Indian entertainment or ‘Bollywood’ cinema and through an examination of visual cultural forms, derived from the cinema, that pervade urban public spaces in South Asia. Examples include street murals, commercial signage, haute couture, wedding festivities and even the addition of new deities to the Hindu pantheon.", "Grading": "Graded", "Course ID": "102279", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ASIA 318 ", "Prerequisite/Corequisite": "You must complete ART 216 or ASIA 100 "}, {"Course": "ART 319", "Name": "Space and Place in Public Art and Urbanism", "Credits": "3", "Description": "This course studies the production and reception of public art. Through case studies, encompassing a range of public art forms, from ephemeral actions to monumental sculpture, we examine the spatial, social and political impact of public art in urban locations. Investigations of public art are conducted through reviewing theories of space and place as well as through practical experience, whereby teams of students collaborate with Baltimore community leaders to propose and execute public art projects.", "Grading": "Graded", "Course ID": "102302", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 216 or ENTR 200 or ENTR 201 with a C or better."}, {"Course": "ART 320", "Name": "Introduction to Printmaking", "Credits": "3", "Description": "An introduction to a variety of printmaking processes, this course will investigate traditions of printmaking as well as contemporary applications of the medium. The process will be used as a vehicle for exploration of the student’s creative work. Recommended Preparation: ART 214.", "Grading": "Graded", "Course ID": "052331", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $80.00", "Prerequisite/Corequisite": "You must complete ART 210 with a grade of ‘C’ or better and have completed the Visual Arts Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 321", "Name": "From the Enlightenment to the Birth of Modernism", "Credits": "3", "Description": "A study of the visual arts from the Enlightenment era (1750) to the advent of modernism (1880), with an emphasis on the changing social and aesthetic conditions that influenced later art forms. From the Enlightenment to the French Revolution to the impact of photography, the period gave rise to revolution and innovation. Art reflected and responded to these conditions with its own radical shifts in style and content from neo-classicism and romanticism to realism and impressionism. This course will explore how the developments of the 18th and 19th centuries laid the foundation for modernism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52332", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "You must have completed ART 216 or ART 221 with a grade of C or better."}, {"Course": "ART 322", "Name": "Social Entrepreneurship in Place", "Credits": "3", "Description": "This course introduces the students to a range of interdisciplinary community arts, maker culture and examples of entrepreneurial case studies. These examples embrace civic agency-based methods that will be applied to approach projects in this transitional urban/suburban border community. Students, participants and stakeholders will identify and manage logistical problems inherent in budgeting, design, fabrication, testing and implementation of entrepreneurial solutions that can be modeled within the semester time frame.", "Grading": "Graded", "Course ID": "102440", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 215 or ENTR 200 or ENTR 201 with a C or better."}, {"Course": "ART 323", "Name": "Modernism", "Credits": "3", "Description": "A survey of turning points in the development of modernism in the visual arts beginning with European movements in the late nineteenth century (e.g. impressionism and post impressionism) and continuing to artistic movements of the first half of the twentieth century (e.g. cubism, German expressionism, Italian futurism, Russian constructivism, dada and surrealism). The course closes with key developments in American modernism (e.g. the Armory show, the Harlem renaissance, social realism, abstract expressionism) including a brief glimpse at pop art. All art historical developments will be considered in their specific sociopolitical and economic contexts. Note: This course is designated as a gateway course for students concentrating in art history and museum studies and must be passed with a grade of “B” or better.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52333", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ART 216 or ART 221 with a grade of C or better."}, {"Course": "ART 324", "Name": "History of Film: Origins to 1965", "Credits": "3", "Description": "A survey of the motion picture from its “optical toy” origins to 1965. Political, economic, artistic and technical factors in film production will be considered. Topics covered include the development of film language, German expressionism, poetic realism, the Hollywood studio system, Italian Neorealism, the French New Wave, avant-garde and documentary film.", "Grading": "Graded", "Course ID": "52334", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one 200-level Arts and Humanities course with a minimum grade of C."}, {"Course": "ART 325", "Name": "History of Film and Video: 1965 to Present", "Credits": "3", "Description": "A survey of motion pictures and video art from 1965 to the present. Political, economic, artistic and technical factors influencing film and video production will be considered. Topics include: new German cinema, documentary, American independent cinema, political and Third World Cinema, video art, installation, performance, interactive forms and the evolving fusion of production and display technologies in the digital era.", "Grading": "Graded", "Course ID": "52335", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one 200-level Arts and Humanities course with a minimum grade of C."}, {"Course": "ART 326", "Name": "History of Photography I", "Credits": "3", "Description": "A historical overview of the medium of photography from its origins in the early 19th century to the mid-20th century.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52336", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ART 327", "Name": "History and Theory of Photography", "Credits": "3", "Description": "A historical overview of the medium of photography from mid-20th century to the present. Studying images in their historical context, the class will examine social backdrops, public and critical responses, and theoretical texts that have informed or emerged from ideas and practices in photography in a post-modern world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52337", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ART 328", "Name": "Postmodernism", "Credits": "3", "Description": "The period from the 1960s onwards witnessed the almost simultaneous challenge to Modernism in a host of movements in the USA, Europe and, increasingly, around the world. This new phase in art, that some art historians termed Postmodernism, opened up the boundaries of the art world as never before to new practitioners, new media and new centers of contemporary art practice, while the term itself became the subject of great debate. The course will end with a survey of current developments in art of the twenty-first century. All art historical developments will be considered in their specific sociopolitical and economic contexts.", "Grading": "Graded", "Course ID": "100295", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 216 or ART 221 with a grade of C or better."}, {"Course": "ART 329", "Name": "Topics in Art History and Visual Culture", "Credits": "3", "Description": "The topic of this course will be concerned with major currents and stylistic directions in the history of art and media in the nineteenth through the twenty-first centuries. In some instances the course content will focus on a specific art historical period or movement; others will trace a prominent theme through several periods. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded", "Course ID": "52338", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 216 or ART 221 with a grade of C or better."}, {"Course": "ART 331", "Name": "Graphic Design I", "Credits": "3", "Description": "This course is an introduction to methods for creating images, signs and symbols with a priority placed on the use of the grid as a structural device. Emphasis is placed on research, analysis, the design process, image-translation and image-reflection. Note: This course is designated as a gateway course for design majors and must be passed with a grade of B or better to continue in the graphic design sequence.", "Grading": "Graded", "Course ID": "52340", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 332", "Name": "Design and Technology I", "Credits": "3", "Description": "Introduction to Macintosh-based computing and software programs developed for print-based communication including discussion of workflow methods necessary for professional practice. The management and application of type and fonts are addressed. Tools, processes and techniques for print reproduction will be surveyed. Recommended Preparation: ART 331 and ART 333 are to be taken concurrently with ART 332.", "Grading": "Graded", "Course ID": "52341", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 210 and ART 211 with a C or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 333", "Name": "Typography I", "Credits": "3", "Description": "An introductory course in the history and exploration of basic principles of typography. Emphasis is on interrelationships of letter, word, line, page and the logical evolution of the grid as a structural device. The course will emphasize techniques and ideas that influence meaning through the visual design of letterforms and words. The structure of type will be explored through projects in two- and three-dimensional media. Recommended Preparation: You are to be concurrently enrolled in ART 331 and ART 332.", "Grading": "Graded", "Course ID": "52342", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 210 and ART 211 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 334", "Name": "Graphic Design II", "Credits": "3", "Description": "This course provides combined reinforcement of design research and methodologies. Students apply their knowledge of typographic and visual forms to projects that encourage the introduction of word and image with visual hierarchies. The development of multiple solutions is encouraged. Visual organizations and project management are stressed. Projects can be both two- and three- dimensional in analog and digital mediums.", "Grading": "Graded", "Course ID": "52343", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 335", "Name": "Origins and Issues in Design", "Credits": "3", "Description": "This course is a survey of the history of graphic design from the Industrial Revolution through contemporary practice. Lectures illustrate major movements as the role of graphic design in society is explored including its relationship to industrial and architectural design. Both technological and societal changes and their impacts on design in past and present eras are addressed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52344", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must take ART 210, ART 211 , ART 214 and ENGL 100 or equivalent with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 336", "Name": "Design & Technology II", "Credits": "3", "Description": "Introduction to Macintosh-based computing using software programs developed for screen-based communication including discussion of the conceptual and technical issues involved in the design and production of interactive documents and environments. Discussion will focus on authoring, user interface, navigation, content development, user experience and visual application.", "Grading": "Graded", "Course ID": "100094", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 213 (with a grade of ‘C’ or better), ART 331 (with a grade of ‘B’ or better), ART 332 and ART 333 with a grade of ‘C’ or better, and complete the Visual Arts Milestone (Portfolio Review Process) before taking this class."}, {"Course": "ART 337", "Name": "Typography II", "Credits": "3", "Description": "An intermediate exploration of typography and image making as an expressive and functional communication vehicle. Students apply their knowledge of the grid, typographic and visual forms to create projects that require the use of both word and image. The processes and mediums for combining word and image and the limits of visual literacy are explored in experimental and practical projects while addressing the reader’s needs and the communicator’s intent.", "Grading": "Graded", "Course ID": "100095", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 212, ART 213, and ART 333 with a grade of “C” or better and complete the Visual Arts Milestone before taking this class."}, {"Course": "ART 338", "Name": "Motion Design", "Credits": "3", "Description": "ART 338 Motion Design applies the principles of 2-dimensional design and typography practice to timebased media. Students will view and discuss historic and contemporary examples of projected and screen-based work and learn discipline-specific vocabulary as industry standard software is used to explore how effective communication can be created utilizing motion.", "Grading": "Graded", "Course ID": "100548", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 333 with a C or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 339", "Name": "Design Thinking for the Social Entrepreneur", "Credits": "3", "Description": "Through a group-centered structure students will explore, present, debate and write about human-derived systems and their relationship to urban communities. Projects will result in an understanding of system overlap through graphic explorations, sketching, mapping, and model building. Students will gain an understanding of how designers operate within and alongside systems as modern thinkers and organizers of information, people, and political media. A deeper understanding of the crossover of professional disciplines will be reached.", "Grading": "Graded", "Course ID": "102328", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 or ENGL 110 with a C or better."}, {"Course": "ART 341", "Name": "Introduction to Animation", "Credits": "3", "Description": "This course introduces the fundamental principles of animated movement and their applications across all animation techniques. In addition to screenings and analysis of animated films, students will explore production workflow for animation. Students will work individually on projects and learn the skills of effective group collaboration", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52346", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have completed ART 213 with a grade of “C” or better and completed the VA Milestone (portfolio review process) before taking this class."}, {"Course": "ART 342", "Name": "Film/Video Theory and Criticism", "Credits": "3", "Description": "An exploration of media theory and film/video criticism. An investigation of the central issues of the cinematic experience through the ways theorists have explained cinema, television, video and their expanded forms from inception to the present. Through reading how authors have framed media and their makers, students will consider how to create meaning with time-based media. Recommended Preparation: ART 324 or ART 325.", "Grading": "Graded", "Course ID": "52347", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100."}, {"Course": "ART 343", "Name": "History of Animation", "Credits": "3", "Description": "This is a survey course studying the international development of animation. The course will emphasize two major aspects in this evolution: the rise and decline of American studio production and the independent artist/animator.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52348", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 215 with a grade of C or better."}, {"Course": "ART 345", "Name": "16mm Filmmaking", "Credits": "3", "Description": "A project-based introduction to 16mm filmmaking covering 16mm cameras, film stocks, sound recording and the film lab. Students will shoot sync sound 16mm film for in-class projects and their own projects using a variety of 16mm production cameras. Film will be processed at an outside commercial lab and all post-production work will be in digital video.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52349", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 305 and ART 315 both with a grade of C or better and the Visual Arts Milestone (portfolio review process) before you can take this class."}, {"Course": "ART 346", "Name": "Intermediate Documentary Production", "Credits": "3", "Description": "In this class we will immerse ourselves in documentary cinema as both makers and appreciators/critics. Students will familiarize themselves with documentary film-making as both a genre and as a mode of production. Students will have hands-on experiences with all facets of non-fiction film-making and will consider aesthetic and conceptual issues particular to documentary films. Students will leave the class with a completed documentary film of their own making. Recommended Preparation: ART 324 or ART 325", "Grading": "Graded", "Course ID": "52350", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 305 with a ‘B’ or better and the Visual Arts Milestone (portfolio review)"}, {"Course": "ART 347", "Name": "Writing for Media Arts", "Credits": "3", "Description": "An introduction to a range of methodologies for developing ideas, scripts and structural tactics for short films and videos. Emphasis will be placed on traditional storytelling strategies, as well as experimental scripting and alternative notational techniques.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52351", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 plus ART 210 or ART 211 or MCS 222 all with a ‘D’ or better."}, {"Course": "ART 349", "Name": "Black, Queer, and Feminist Film", "Credits": "3", "Description": "This course examines prominent themes in films that fall within the categories “Black,” “Queer,” and “Feminist”. Most of the films are narrative, dealing with issues involving race, gender, and sexuality. This course is not just about watching films. It makes extensive use of critical historical and theoretical texts from the disciplines of psychoanalysis, feminism, literary and queer theory, as well as from film history, art history, and critical theories of race, gender, and sexuality. Prior knowledge of film-making and/or film history/theory is not required.", "Grading": "Graded/Pass Fail", "Course ID": "102175", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 216 or ART 221 with a grade of C or better."}, {"Course": "ART 355", "Name": "The Dao of Intermedia", "Credits": "3", "Description": "This course explores the connection between art and the everyday through lectures, and readings of Asian philosophy. The course consists of discussions about the philosophy and how traditional and contemporary artists/craftspeople have related the philosophy to their work. Students learn traditional arts/crafts such as brushpainting, papermaking, paper/textile decorative arts as well as creating art that is both physical material and performative. No prior visual arts experience needed", "Grading": "Graded", "Course ID": "102317", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "ASIA 330 "}, {"Course": "ART 360", "Name": "Mixed Media Book Arts", "Credits": "3", "Description": "In this studio course, students investigate the book art form as an artistic statement. All elements of this medium: images, text and structure, are integral to the theme of book arts. The multiple dimensions of the artist’s book are analyzed, including its status as a document; its identity as a piece of sculpture; its portability and its function in the contexts of time, space and performance.", "Grading": "Graded", "Course ID": "52362", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $80.00", "Prerequisite/Corequisite": "You must complete either ART 305, ART 320, ART 331, ART 341, or ART 361 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) or be declared Visual Arts Minor."}, {"Course": "ART 361", "Name": "Digital Darkroom", "Credits": "3", "Description": "This course builds on the foundation of ART 211 (Camera Vision), providing an in-depth introduction to digital tools and techniques in photographic practice. Students will learn principles of digital input and output, with an emphasis on the production of high quality images for printing, through assignments, demonstration, readings, writings, and critiques. Issues related to truth in photography will be examined and discussed in relation to the possibilities offered by digital manipulation. Contemporary and historical images will be studied in conjunction with each assignment. This course is designated as a gateway course for photography concentration students and must be passed with a grade of B or better to continue in the photography sequence.", "Grading": "Graded", "Course ID": "52363", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 211 with a grade of “C” or better and the Visual Arts Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 362", "Name": "Black and White Photography", "Credits": "3", "Description": "This course, in conjunction with ART 361 Digital Darkroom serves as a foundation for the photography emphasis and will provide an introduction to black and white photography as a tool for photographic production. In addition to in-depth darkroom production, emphasis will be placed on self-motivation and developing a direction of interest. Darkroom techniques, alternative camera formats, films, methods of presentation, as well as an increased theoretical framework for understanding meaning in relation to images will be introduced through assignments, readings, writings and historical examples.", "Grading": "Graded", "Course ID": "52364", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 211 with a grade of “C” or better and the Visual Arts Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 363", "Name": "Color Photography", "Credits": "3", "Description": "This course focuses on the use of color as an element in photographic expression. The course includes introduction to color temperature and white balance, exposure, lighting, color theory, image capture and output, digital workflow, digital manipulation of color, and color management. Students will develop the ability to think critically about and discuss visual images through assignments, critiques, writings and presentations. Students will also be introduced to a history of color photography and an overview of contemporary artists working with color.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52365", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 361 or ART 362 with a grade of “C” or better and the Visual Arts Milestone before taking this class."}, {"Course": "ART 364", "Name": "Studio Photography", "Credits": "3", "Description": "This course will focus on creative uses of light in the production of photographic images in a variety of settings, both in the studio and on location, leading to an understanding of how light works on various surfaces and materials. Students will be introduced to a variety of lighting sources, modifiers, techniques and post-production methods and will put these into practice through assignment-based challenges.", "Grading": "Graded", "Course ID": "52366", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "ART 361 with a grade of ‘B’ or better and Visual Arts Milestone or Visual Arts Minor."}, {"Course": "ART 365", "Name": "Multimedia Environments", "Credits": "3", "Description": "This course will explore hybrid forms that present still images within multimedia contexts, focusing on the intersection between still and moving images and audio in current digital media environments. Topics explored include still image production from time-based media sources, journalism across photography, video and audio, uses of social media for narrative and non-narrative forms of storytelling, expansions and compressions of time, and image sequencing and juxtaposition. The presentation of still and time-based media in screen-based and installation environments will also be covered. The work of historical and contemporary artists and visual journalists will be studied and discussed in conjunction with particular projects.", "Grading": "Graded", "Course ID": "52367", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "ART 361 with a grade of ‘B’ or better, ART 213 prerequisite or corequisite, and Visual Arts Milestone or Visual Arts minor."}, {"Course": "ART 366", "Name": "Documentary Photography", "Credits": "3", "Description": "This course is based on the camera as an evidentiary and narrative tool, and examines the role of the photographer in social story telling, forensic investigation, and political observation. Photojournalism is the nexus of this course, through which students will learn about story development, acquiring access to locations, shooting for print media and the Internet, location, lighting, editing and sequencing, as well as examining the complexity of related ethical issues. In addition to photographic assignments, students will also participate in field trips, critiques, readings, and writings, and will access historic documentary photographs from UMBC’s Special Collections Archive. ", "Grading": "Graded", "Course ID": "52368", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "ART 361 with a grade of “B” or better and Visual Arts Milestone or Visual Arts Minor."}, {"Course": "ART 367", "Name": "Alternative Processes", "Credits": "3", "Description": "An experimental course dealing with non-traditional photo emulsions. Students will work with cyanotype, Van Dyke Brown, gum bichromate and other non-silver processes in conjunction with developing personal imagery. ", "Grading": "Graded", "Course ID": "52369", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "ART 361 with a grade of ‘B’ or better and Visual Arts Milestone or Visual Arts minor."}, {"Course": "ART 368", "Name": "Digital Alternatives", "Credits": "3", "Description": "This course will introduce use of a variety of substrate materials for creating photographic quality images utilizing flat-bed, pigment ink jet, and direct-digital printers. The course will allow the advanced student to utilize digital technologies to produce ambitious independently developed projects. Topical readings, videos, writings and critiques will provide forum for discussion of techniques and concepts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52370", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 361 with a grade of “B” or better and the Visual Arts Milestone before taking this class."}, {"Course": "ART 369", "Name": "Topics in Photography", "Credits": "3", "Description": "This theme-based studio course will utilize photographic images in combination with other media and techniques. Specific content will be developed by the instructor. Techniques appropriate to content of course will be covered though assignments, readings, writings and critiques. Examples of such themes include performance and images, public art, image transmission and alternative venues for images. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded", "Course ID": "52371", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Pinhole Photography, Still Life in Platinum, Landscape Photography, Collage, Homage & Appropriation, Portraiture, Professional Practices in Photography, Entrepreneurial Practices in Photography, Color Photography, Primitive Photography, Digital Darkroom II, Photographic Possibilities", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "ART 361 with a grade of “B” or better and the Visual Arts Milestone or Visual Arts Minor."}, {"Course": "ART 370", "Name": "Silkscreen Printing", "Credits": "3", "Description": "This studio course introduces a variety of approaches to screenprinting, including stencil techniques, direct markmaking and photographic processes utilizing film positives, digitally generated images, photocopies and drawings. Historical uses of screenprinting as a medium for communication and ornamentation are discussed in the context of contemporary art practice. This course continues the fusing of artistic skills in various media, such as color, pattern, layering, print output and composition, developed during the intermediate level.", "Grading": "Graded", "Course ID": "52372", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $90.00", "Prerequisite/Corequisite": "You must complete either ART 305, ART 320, ART 331, ART 341, OR ART 361 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) or be declared Visual Arts Minor."}, {"Course": "ART 375", "Name": "Photographic/Digital Processes in Printmaking", "Credits": "3", "Description": "This studio course investigates a variety of photographic processes in print media, including digital print methods, photo-printmaking, xerography and manual print processes. Historical and theoretical relationships between the photographic image, appropriation strategies and print practice are discussed as a context for technical explorations in the media. Image and surface manipulations and materials, as well as theoretical concepts related to the subjects of language, installation and performance are applied to the process.", "Grading": "Graded", "Course ID": "52374", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $80.00", "Prerequisite/Corequisite": "You must complete ART 211 or ART 320 with a grade of C or better and the Visual Arts Milestone (portfolio review process) or be a declared Visual Arts Minor before taking this class."}, {"Course": "ART 376", "Name": "Origins and Issues of Print Media", "Credits": "3", "Description": "An intensive seminar discussing topics in print media from pre-history to the present. Subjects may include early forms of printmaking and how print media revolutionized communication and the distribution of information in society. This course will explore the historical framework of print culture and discuss contemporary and future directions in print media.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52375", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Prerequisite/Corequisite": "You must have taken ART 215 or ART 216 or ART 221 with a grade of “C” or better before taking this class."}, {"Course": "ART 378", "Name": "Origins and Issues in Print Media", "Credits": "3", "Description": "This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "52377", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 380", "Name": "History and Theory of Games", "Credits": "3", "Description": "This seminar offers an in-depth treatment of historical, philosophical, and theoretical issues related to game design and play. The course traces the origins of gaming and follows its evolution into the contemporary idiom. Analysis will also cover how multi-person independent decision-making and strategic situations provide insight on political science, anthropology, economics, sociology, and biology.", "Grading": "Graded", "Course ID": "52378", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 215 or CMSC 202 with a grade of “C” or better before taking this class."}, {"Course": "ART 382", "Name": "Introduction to Interactive Media", "Credits": "3", "Description": "This course provides an introduction to the diverse scope and potential of screen-based interactive media. Emphasis is placed on the prodcution and critique of projects that explore interactive navigation, non-linear narrative, interactive animation and sound in 2D environments. Online and internet-based art will be covered. Basic scripting concepts and techniques are introduced to provide students with the necessary skills to begin exploring their own creative approaches to interactivity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52379", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 212 and ART 213 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 383", "Name": "Sound Design", "Credits": "3", "Description": "This course treats sound as an aesthetic equal to image in works of time-based and interactive media. It explores image sound relationships and focuses on designing effective soundtracks by developing students’ skills in field, foley, and studio recording; scoring; mixing; and sound-image synchronization.", "Grading": "Graded", "Course ID": "52380", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have completed ART 213 with a grade of “C” or better and completed the VA Milestone (portfolio review process) before taking this class."}, {"Course": "ART 384", "Name": "Introduction to 3D Animation", "Credits": "3", "Description": "This course will build a foundation for the creation of 3-D computer animation. Students will explore 3-D techniques through a study of modeling, motion, transformation, lighting and texturing. Students will utilize these skills in the context of strengthening their own artistic voice.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52381", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 341 with a grade of C or better and the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 387", "Name": "Animation in the Physical World", "Credits": "3", "Description": "This course focuses on the expressive potential of materials-based animation. Stop motion, cut-paper, and experimental techniques, as well as physical-to-digital production methods, will be explored via screenings of animated works, analysis, and hands-on workshops. Students will work individually on projects and collaboratively in groups.", "Grading": "Graded", "Course ID": "52383", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have completed ART 341 with a C or better, before taking this class."}, {"Course": "ART 388", "Name": "Art on the Internet", "Credits": "3", "Description": "This course provides a thorough introduction to formal, conceptual and technical issues related to the production of Internet-based interactive art. Emphasis is placed on experimental approaches to Web-based interactive navigation, interface and information design", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52384", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 212 with a grade of “C” or better and the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 389", "Name": "Topics in Animation and Interactive Media", "Credits": "3", "Description": "This course offers an investigation of current directions in animation and interactive media. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52385", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Topics": "Top:Advanced Imaging, Synethesia, Art And The Internet, Words In Light Dig Dom, Word & Image, Virtual Space&Narrative, Real Time 3D Animation, Expr.Motion/Char.Animatn, Sound Design, Solid Image Modeling, Image, Time & Projection, Advanced Digital Video, Interactive Sound Art, Imaging/Writing Environ, Real Time 3D, Wireframe Modeling, Topics In Computer Art, Digitial Cinema, Expressions In Motion, Art On Internet, Primitive Cave Art, Comp Art:Landscape Cubed, Digital Composition, Top In Comp Art:3D Anima, Advanced Animation, Art On The Internet, 3d Animation, Networked Video, Expr. In Time & Motion, Algorithmic Art, Digital Cinema II, Multimedia On Internet, Mixing Phys And Dig Proc, Word And Image, Adv Art On The Internet, Landscrape Cubed, Visual Symphony, Anatomy Of A Video Game, Imaging In C, Interactive Cd-Rom, Interactive Multi-Media, Hist Of Graphic Design, Text,Time & Multi-Media, Imaging And Writing Env, Games And Interaction, Digital Cinema, Digital Cinema I, Interactive Multimedia, The Body & Technology, Expression In Motion, Art & Sci In Computer An, Experimental Interfaces, Interactive Art, Computer Art, Youth,Media,Am Politics, Art/Sci Comp Animation, Digital Video, Animation, Imaging Writing Environ, On-line Content", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 390", "Name": "IRC Fellows Topics in Art and Technology", "Credits": "3", "Description": "This seminar style course focuses on aspects of emerging technologies, media criticism and related themes. Topics are developed exclusively for students selected as Fellows in the Visual Arts IRC Fellows Program. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded", "Course ID": "52386", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Preserving Place, Renewable Energy", "Prerequisite/Corequisite": "You must complete ART 212 and ART 213 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 392", "Name": "Topics in Art or Media I", "Credits": "1", "Description": "Topics for this course concern major current and stylistic directions in art and media. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52387", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 395", "Name": "Television Production Techniques I", "Credits": "3", "Description": "Development of skills pertaining to the operation of cameras, recorders, control consoles, lighting instruments and general operating procedures. Each student gains experience as a team member of on-campus TV productions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52388", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MCS 395"}, {"Course": "ART 396", "Name": "Television Production Techniques II", "Credits": "3", "Description": "See ART 395.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52389", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 400", "Name": "Teaching Artist = Change Agent", "Credits": "3", "Description": "This course is designed for interdisciplinary Dance, Music, Theatre, Visual Arts, Individualized Study, Media Communication Studies, and English majors. Students are introduced to the “teaching artist” career path within the K-12 school system, and will gain networking and entrepreneur/ professional skills, including an understanding of the K-12 culture. They will be introduced to various nonprofit agencies that will collaborate with teachers and their students on a capstone project. Students will leave the course with connections and skills to pursue a Teaching Artist career path. Several class sessions will be held off campus at one of the North Anne Arundel County partnerships. Recommended Preparation: ART 215 or ENTR 200 or ENTR 201, passed with a ‘C’ or better.", "Grading": "Graded", "Course ID": "102729", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "ART 423", "Name": "Art Since 1945", "Credits": "3", "Description": "In the post-World War II period, the center of avant-garde artistic activity shifted from Europe to the United States. The period witnessed the peak of Modernism - in movements such as abstract expressionism and color field painting - and Modernism’s almost simultaneous challenge in a host of movements in the USA, Europe and, increasingly, around the world. This new phase in art, that some historians termed Postmodernism, opened up the boundaries of the art world as never before to new practitioners, new media and new centers of contemporary art practice, while the term itself became the subject of great debate. This rich terrain will be traversed in a way that is particular to the instructor’s research specialization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52390", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 323 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 424", "Name": "Contemporary Art of the Non-Western World", "Credits": "3", "Description": "This course examines the visual art produced by selected artists from three broad geographic regions outside the West: Asia, Africa, and the Middle East. Approximately four weeks will be devoted to specific countries in each geographical area. The goal of the course is to examine the visual material produced by contemporary artists from these regions and to discern their overarching critical themes, issues, problems, complications, similarities, etc. within and across cultures. Special attention will be paid to current critical discourses that shape and define a cultural practice or artistic medium (e.g. theories of race, gender and sexuality, postcoloniality or poststructuralism). The course will be conducted as a small seminar with weekly discussions and written assignments culminating in student presentations and research papers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52391", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp Art Non-Western World", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ART 318 or ART 319 or ART 321 or ART 323 or ART 328 or ART 329 or ART 349 all with a grade of C or better."}]