[{"Course": "ENGL 393E", "Name": "Technical Communication for ESL Students", "Credits": "3", "Description": "This course is designed to teach students with diverse backgrounds and interests how to communicate technical information effectively. With the course’s emphases on critical thinking, synthesis and analysis,students learn how to inform and persuade in technical documents that require strategic decisions on content, organization, writing style and document design. These documents are applicable to many disciplines and to the workplace, and they demonstrate how text and visuals work together to reach various audiences with specific needs. Students also work to develop oral communication, technological and visual literacy, and collaborative skills. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54120", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Technical Writing, Technical Writing:Honors", "Prerequisite/Corequisite": "You must complete ENGL 110 and be at a Junior-level standing."}, {"Course": "ENGL 394", "Name": "Technical Editing", "Credits": "3", "Description": "A logical supplement to ENGL 393 - Technical Communication (3), the course provides specialists with tools to refine professional writing. This course continues to focus on various formats, such as abstracts, lab reports, review papers and journal articles. Copy-editing and substantive editing techniques will be learned and applied to technical level, organization, format, style, content and graphics presentation", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54121", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 300 or ENGL 393 with a C or better."}, {"Course": "ENGL 395", "Name": "Internship in Tutoring Writing", "Credits": "4", "Description": "Course work and practical experience in peer tutoring college writing. Students will learn about tutoring writing through class work that includes reading in the fields of tutoring and composition theory, discussion, and written assignments, along with a tutoring practicum at the Writing Center. In addition, students will be analyzing and refining their own writing process. Note: You must have Sophomore standing or higher, recommendation from an instructor in the English Department, a 3.0 cumulative GPA and evidence of strong writing ability to receive permission to enroll in the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54122", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 with a C or better."}, {"Course": "ENGL 396", "Name": "Methods of Teaching English in the Secondary Schools", "Credits": "3", "Description": "This course examines how notions of race and ethnicity are represented, contested, and reconsidered in U.S. literature. Special attention will be paid to how race intersects with gender, sexuality, and class. Course readings are drawn from writers of a range of ethnic backgrounds. Recommended Preparation: Completion of 200-level literature course with a grade of C or better.", "Grading": "Graded/Audit", "Course ID": "50067", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 425 "}, {"Course": "ENGL 397", "Name": "Tutorial in Creative Writing", "Credits": "1", "Description": "An individualized course for advanced students in creative writing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54123", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 371 or ENGL 373."}, {"Course": "ENGL 398", "Name": "Journalism Internship", "Credits": "1", "Description": "Practical experience in professional journalism. Student interns work as staff writers for a local newspaper and report regularly to the department’s journalism advisor. Students gain extensive experience in news writing, layout and publication design, and they are expected to compile a substantial portfolio of published work. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54124", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete ENGL 380 or ENGL 382 or ENGL 383 with a C or better."}, {"Course": "ENGL 399", "Name": "Introduction to Honors Project", "Credits": "1", "Description": "An introduction to research methods and survey of the ways in which literary works can be studied. Designed to help English honors candidates explore topics, authors and procedures to begin shaping the subject and method of the senior honors project. Recommended Preparation: Departmental Honors Candidacy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54125", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "ENGL 400", "Name": "Special Projects in English", "Credits": "1", "Description": "Open to students with special projects - whether in literature, language or writing - on application to the instructor who will supervise the project. Application forms for special projects are available in the department office. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54126", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "ENGL 401", "Name": "Methods of Interpretation", "Credits": "3", "Description": "A course on theory and practice of interpretation. ENGL 401 examines contemporary interpretation theories and the ways in which they may be applied to literature. It introduces students to various approaches to interpretation and helps them to locate the values and methods underlying various interpretive practices, including their own.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54127", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 301 with a grade of C or better."}, {"Course": "ENGL 403", "Name": "Advanced Creative Writing: Non-Fiction", "Credits": "3", "Description": "An advanced course in writing and reading creative non-fiction. With the aim of building a portfolio in creative non-fiction, students will examine and practice such genres as literary travel writing, the personal essay, literary journalism, and memoir.", "Grading": "Graded", "Course ID": "54129", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 303 or ENGL 332H with a C or better."}, {"Course": "ENGL 405", "Name": "Seminar in Literary History", "Credits": "3", "Description": "An examination of some aspect of literature within a historical framework. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits. Recommended Preparation:  ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54131", "Consent": "Instructor Consent Required", "Components": "Lecture", "Topics": "American Women Writer, Seminar In Literary Hist, Romantic Literature, The Renaissance, Literature and Colonization, American Periodicals and the Making of Mass Cultur"}, {"Course": "ENGL 407", "Name": "Language in Society", "Credits": "3", "Description": "In this course, students will study written texts and documents to learn how language actually functions in various social settings. It provides students with essential skills and methods of sociolinguistic analysis in the context of actual discourse communities. Students also will learn the politics of language use in various academic and professional contexts and the crucial role language plays in shaping our physical, cultural and economic realities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54132", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 302 or ENGL 324  with a grade of C or better."}, {"Course": "ENGL 409", "Name": "Advanced Topics in Genre Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54133", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Victorian Novel, The Victorian Novel, Genre Studies, Victorian Mystery Lit., Modernist Novella, The Novel, Boccaccio, Chaucer and the Collective Poem, World Literature", "Prerequisite/Corequisite": "You must complete ENGL 302 with a grade of C or better."}, {"Course": "ENGL 410", "Name": "Seminar in Genre Studies", "Credits": "3", "Description": "An examination of the forms and developments of literary genres (fiction, poetry, drama, autobiography, etc.) or an intensive study of one or two writers in a given genre. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54134", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "ENGL 411", "Name": "Advanced Topics in Literary History", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054130", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 302  with a grade of C or better."}, {"Course": "ENGL 413", "Name": "Advanced Topics in Medieval and Early Modern Literature", "Credits": "3", "Description": "Study of medieval/early modern literary texts, with focus on theoretical approaches to specific topics. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded", "Course ID": "102058", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete any 300-level ENGL with a grade of C or better."}, {"Course": "ENGL 414", "Name": "Adolescent Literature", "Credits": "3", "Description": "A survey of literature written especially for adolescents of school age (12-18 years). Selections read cut across genre and age groups. Emphasis is on understanding the literature from an adolescent’s point of view and on devising teaching strategies to create and enhance an adolescent’s understanding of the works. Attention also is paid to the development of critical skills and criteria for evaluating adolescent literature. Note: Admission to teacher education required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50069", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 414 ", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "ENGL 415", "Name": "Materials for Teaching Reading", "Credits": "3", "Description": "This course is designed to assist pre-service and in-service teachers in understanding literacy acquisition and processes by observing and analyzing children’s language, reading and writing development as well as examining current and historical issues in language and literacy practice and research. It is organized around current, accepted, research-based theoretical models that account for individual differences in reading. Introduction to language structures including spoken syllables, phonemes, graphemes, and morphemes is included in this course. Participants will apply knowledge of the core areas of language to reading acquisition in terms of first and second language acquisition, typical development and exceptionalities. Participants will be introduced to current scientific research.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50070", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 416"}, {"Course": "ENGL 416", "Name": "Advanced Topics in Literature and Other Arts", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54135", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 417", "Name": "Seminar in Literature and Other Arts", "Credits": "3", "Description": "An intensive study of the relationships between literature and music, film and the fine arts. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54136", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Sem:Relativity/Mod Lit, Sem:Lit & Psychoanalysis, Mediated Movies", "Prerequisite/Corequisite": "You must complete ENGL 301 with a grade of C or better and have junior or senior standing."}, {"Course": "ENGL 419", "Name": "Seminar in Literature and the Sciences", "Credits": "3", "Description": "An intensive study of the relationships between literature and some aspect of the physical, natural or social sciences. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54138", "Consent": "Instructor Consent Required", "Components": "Lecture", "Topics": "Darwin And Amer Literatr, Green Writing, Green Writ-Lit & Environ, Discourses Of Happiness"}, {"Course": "ENGL 431", "Name": "Seminar in Contemporary British and American Literature", "Credits": "3", "Description": "Advanced studies in selected works of modern British and/or American literature. The emphasis is on literary developments since World War II. Topics will be published in the Schedule of Classes. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54140", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "ENGL 435", "Name": "Digital Humanities", "Credits": "3", "Description": "This course will provide an undergraduate-level exposure to the digital humanities, covering several distinct areas within the field including humanities computing, critical code studies, and new media studies. It will introduce students to foundational and state-of-the-art humanities computing tools for the analysis and archiving of texts, and expose students to current trends in and criticism of digital literature and interactive fiction/game theory. Students will be expected to work with code and software tools.  This course is repeatable for credit. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "101928", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 387 with a C or better."}, {"Course": "ENGL 442", "Name": "Seminar In Visual Literacy", "Credits": "3", "Description": "This course focuses on the impact of new media on an evolving visual and technological literacy. The course will examine literacy development and expectations in contemporary communication forms. To ground the study we will begin with a solid history of literacy development, both visual and textual, across cultures. The course goal is both to understand how we see and how we communicate in various cultural contexts. Practical applications will include both composing and designing in the computer-mediated classroom. We will explore art history, reading and writing theory, and the evolution and sociological expectations of literacy development. Technology’s impact on our literacy practices is great in scope; only by comparing print literacy with electronic literacy can we truly begin to understand, interpret, and create documents that meet contemporary visual and textual literacy expectations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54142", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 300 with a C or better."}, {"Course": "ENGL 447", "Name": "Online Voice and Community", "Credits": "3", "Description": "The social capital that shapes communities can be strengthened by technology. In fact, online communities, across cultures, have provided the space for disenfranchised and silenced voices - voices for literacy, for freedom, for politics, for support, for justice. The purposes vary, but the design, engagement, and outcome of successful online communities all share the attribute of valued voice. Using Kollack, Powazek and others, students will examine culturally specific online communities, analyzing text, voice, ethics, language, and structure. As well as studying, evaluating, and analyzing aspects of online voice, students will participate in online communities. The course will incorporate online communication as well as traditional writing processes. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "50093", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Lit And Colonization, Joan Of Arc, Adv Top In Lit & Culture, Women, Men & War, Online Voice & Community"}, {"Course": "ENGL 448", "Name": "Seminar in Literature and Culture", "Credits": "3", "Description": "An intensive study of the relationships between literature and culture, with emphasis on literature as a product and manifestation of cultural forces. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54143", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 449", "Name": "Seminar in Genre Analysis", "Credits": "3", "Description": "Taught in an electronic classroom, Genre Analysis will be guided by the theory and methodologies, primarily, of Swales and Bakhtin. Students will conduct what Swales calls textographies or studies of text and situation. In particular, we will examine the rhetoric of academia, science, media and law, both print and electronic. During the course, students will employ multi-methodologies to study text, including observation, discourse analysis, interview, and think-aloud protocols. We will also investigate academic writing and the development of academic language and literacy. The face-to-face course will incorporate online communication, as well as traditional writing processes and will explore rhetorical analysis as compared to genre analysis.", "Grading": "Graded", "Course ID": "50091", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 301 with a grade of C or better and have junior or senior standing."}, {"Course": "ENGL 451", "Name": "Seminar in Major Writers", "Credits": "3", "Description": "An intensive study of one or two major British and/or American writers. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54145", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Samuel Johnson, Toni Morrsion, Johnson Contemporaries, Toni Morrison, Staging Shakespeare Now, Dante and Milton, Virginia Woolf, John Updike, Milton, Walt Whitman"}, {"Course": "ENGL 461", "Name": "Seminar in Minority Literature", "Credits": "3", "Description": "The study of a form, period, major figure or theme in the literature of one ethnic, racial, sexual or social minority group in America or Great Britain. Topics will be published in the Schedule of Classes. Recommended Preparation: ENGL 301 with a grade of C or better and senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54147", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 464", "Name": "Studies in Women and Literature", "Credits": "3", "Description": "The study of literature by or about women with an introduction to feminist literary theory and methods. The course will address questions of canonicity and a female literary tradition. It will examine the relationship between gender and genre, identify patterns of gender representation, and introduce students to key terms and questions in the scholarly study of gender and sexuality. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "101891", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 464 ", "Prerequisite/Corequisite": "You must complete any 300 level English Course with a grade of C or better"}, {"Course": "ENGL 469", "Name": "Studies in Race and Ethnicity", "Credits": "3", "Description": "A focused study of race and ethnicity in literature and the relevant theoretical frameworks that shape the field. This course is not bound to a specific time period or region and may center on a particular author, genre, literary form, historical moment, or critical methodology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "101892", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete any 300 level English Course with a grade of C or better"}, {"Course": "ENGL 471", "Name": "Advanced Creative Writing-Fiction", "Credits": "3", "Description": "An advanced course in writing fiction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54148", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 371 with a grade of C or better."}, {"Course": "ENGL 473", "Name": "Advanced Creative Writing-Poetry", "Credits": "3", "Description": "An advanced course in writing poetry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54149", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 373 with a grade of C or better."}, {"Course": "ENGL 475", "Name": "Special Studies in Creative Writing", "Credits": "3", "Description": "A course in which advanced creative writing students work on collaborative or individual projects that embrace more than one artistic discipline or writing genre. Recommended Preparation: Six credit hours of creative writing in two different genres, or six credit hours in at least two of the following three areas: creative writing, theatre, or visual arts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54150", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 480", "Name": "Seminar in Advanced Journalism", "Credits": "3", "Description": "An intensive study of one or more areas in the field of journalism, such as reporting, editing, newspaper management, mass media and the history of journalism. Topics will be published in the Schedule of Classes. Recommended Preparation: ENGL 380 with a grade of C or better, senior standing, and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54151", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Seminar in Advance, Seminar in Journalism"}, {"Course": "ENGL 481", "Name": "Advanced Topics in Journalism", "Credits": "3", "Description": "This course builds on skills developed in 300-level journalism courses. It will focus on advanced topics in areas of journalism, including subjects with both a literary and historical perspective. Advanced topics may also include an in-depth examination of press law, the history of the press in the United States, the role of women in journalism from an historical perspective and modern developments in a digital news age. Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "101762", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "The Physcian as Writer", "Prerequisite/Corequisite": "You must complete ENGL 380 and ENGL 382 with a C or better."}, {"Course": "ENGL 483", "Name": "Writing in the Sciences", "Credits": "3", "Description": "This course examines scientific writing. Offered with an electronic communication across the curriculum focus, students will hone science writing style and form. Among the texts we will investigate and practice are professional science articles, proposals, abstracts, reports and literature reviews. Students will collect, analyze, and report data on topics ranging from climactic changes, pollution, and deforestation to disease control, genetic research, scientific ethics and medicine. Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "50090", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "The Literature of Addiction and Recovery", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 485", "Name": "The Teaching of Writing", "Credits": "3", "Description": "An introduction to theories and techniques of writing instruction. Current theory and research is applied in the development of a repertoire of approaches to writing instruction and curriculum development. Students examine research that analyzes writing from linguistic, psychological and developmental perspectives. Direct experience in personal writing reinforces theoretical study of the processes of composition and enables prospective teachers to improve their own writing skills. Each student designs a model writing program or course, including a rationale for choices made, that demonstrates how specific features of the course or program will be taught.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50064", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 485 ", "Prerequisite/Corequisite": "You must complete a CLPT course or EDUC course."}, {"Course": "ENGL 486", "Name": "Seminar in Teaching Composition: Theory and Practice", "Credits": "3", "Description": "This course examines our changing understanding of the teaching of composition during the past 30 years by tracing key theories and pedagogies across this period. These sometimes conflicting approaches to the teaching of writing include the following orientations: cognitive, expressivist, social constructivist and political. The course is intended for current and prospective teachers of English at elementary, secondary and post-secondary levels.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54152", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have Junior or Senior standing."}, {"Course": "ENGL 488", "Name": "Seminar in Computer Assisted Writing Instruction", "Credits": "3", "Description": "This course introduces the methods of computer-assisted writing instruction to current and prospective teachers across the curriculum. It allows participants to practice these methods in class and provides opportunities for discussion and investigation. Designed for educators in all disciplines and at all levels, elementary through university, this course invites participants to explore ways of integrating technologies into their own classrooms and curricula. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54153", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Visual/Technological Lit, Computer Assisted Wrting, Visual Literacy, Assisted Writing", "Prerequisite/Corequisite": "You must have Junior or Senior standing."}, {"Course": "ENGL 490", "Name": "Advanced Topics in the English Language", "Credits": "3", "Description": "A historical and linguistic study of the English language from its origins in Old English to World English, as well as language issues in contemporary America. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54154", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 301 with a grade of C or better and have junior or senior standing."}, {"Course": "ENGL 491", "Name": "Seminar in Topics in the English Language", "Credits": "3", "Description": "A historical and linguistic study of the English language from its origins in Old English to World English, as well as language issues in contemporary America. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54155", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 301 with a grade of C or better and have junior or senior standing."}, {"Course": "ENGL 493", "Name": "Seminar in Communication and Technology", "Credits": "3", "Description": "Intensive review of issues and research in communication and technology. Emphasis may vary from historical to contemporary and include various objects of inquiry and research methods. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: Senior standing and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54157", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Copyright Culture, Theories of Communicative Practice and Play, Theories of Creativity & Play, The Rhetoric of Intellectual Property, Infomation Freedom and Resistance, Software Studies"}, {"Course": "ENGL 494", "Name": "American English Structure for ESL/FL Teachers: Syntax and Morphology", "Credits": "3", "Description": "The course examines the syntactical, phonological and morphological systems of modern American English, with particular attention to areas most relevant to teachers of English as a second or foreign language. The systems are examined primarily through the transformational model of grammar. The course includes techniques for teaching specific grammatical structures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54158", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 495", "Name": "Internship", "Credits": "1", "Description": "Practical experience in applying communication and research skills in an actual work setting. Student interns perform six to eight hours of supervised tasks each week for a newspaper, television or radio station, advertising company, publishing house or other similar agency. Internship opportunities are individually arranged by the English department in cooperation with the sponsoring agency. This course is repeatable for credit. Students may complete a maximum of 8 credits. Note: Upper-division status and at least a 3.0 cumulative grade point average overall required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54159", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "ENGL 498", "Name": "Senior Honors Seminar", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54160", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 499", "Name": "Senior Honors Project", "Credits": "4", "Description": "This project enables the honors student to pursue an inquiry of special interest and to gain experience in planning and executing a major project that is historical, critical or creative in nature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54162", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete ENGL 399 with a C or better."}, {"Course": "ENTR 200", "Name": "Introduction to Entrepreneurship", "Credits": "3", "Description": "This course will provide an overview of the basic concepts of entrepreneurship and innovation focusing on the nature, environment, and risks of new venture formation. Topics include the entrepreneurial mindset, opportunity recognition, market assessment, social need, feasibility plan, and structure, costs, and sustainability. Assignment include writing a business or social entrepreneurial proposal.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100555", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENTR 201", "Name": "The Entrepreneurial Mindset", "Credits": "3", "Description": "An introductory course explaining entrepreneurial and innovative thinking. The course encourages the development of personal attributes that foster creative thinking among students from all majors. The course introduces students to the attributes of thinking like an innovative entrepreneur, and guides them, using real-life problems, to acquire personal attributes shared by successful social innovators and business entrepreneurs.", "Grading": "Graded", "Course ID": "100554", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENTR 300", "Name": "Internship in Entrepreneurship", "Credits": "1", "Description": "This course will allow students to earn credit while pursuing an Internship outside the classroom that is directly related to their particular entrepreneurship-related course of study. Students can intern for start-ups and early stage for-profit businesses, as well as for non-profits and other social entrepreneurs. Internships must be approved by the Director of the ENTR Minor. A contract will be required. Students will earn 1 credit hour for every 40 hours they intern. Recommended Preparation: ENTR 200 and ENTR 201 ", "Grading": "Pass/Fail", "Course ID": "101794", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENTR 320", "Name": "Entrepreneurial Marketing", "Credits": "3", "Description": "This course arms student entrepreneurs with an overview and understanding of the new media and marketing landscape. New media have fundamentally changed the way that all businesses approach marketing. Students in this course can expect to develop a high level understanding of the planning and execution of messaging and engagement within new marketing media. This course will include a combination of both individual and team based projects, (such as blogs, pod casts, and E-mail newsletters).", "Grading": "Graded/Pass Fail", "Course ID": "101854", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENTR 330", "Name": "Entrepreneurial Finance", "Credits": "3", "Description": "This course focuses on the finance and start¿up considerations that every entrepreneur must face. It is designed for students with a continued interest in the inter-workings of a start-up. The purpose of this course is to teach how to properly plan, finance, and maintain a healthy entrepreneurial venture, with an emphasis on the single most critical aspect (outside of the idea itself), which is the strength of its financial research, plan, and forecast.", "Grading": "Graded", "Course ID": "102254", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENTR 200 and ENTR 201  with a C or better."}, {"Course": "ENTR 340", "Name": "Innovation, Creative Problem-Solving & the Socialpreneur", "Credits": "3", "Description": "This course explores approaches to solving specific social problems that are too ambiguous, complex, or messy to be addressed directly through traditional strategies. It seeks to increase the students’ understanding of innovation and creative problem solving through readings, guest speakers, and an outside project. Students will work with a local, socially conscious entrepreneur (socialpreneur) and their organization to develop solution to a real-world problem. The course is designed to be approachable for all undergraduate majors.", "Grading": "Graded", "Course ID": "101987", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENTR 200 and (ENTR 201 or AMST 205 or SOCY 205 or POLI 205)"}, {"Course": "FREN 101", "Name": "Elementary French I", "Credits": "4", "Description": "An introduction to French through a communicative approach. Language is learned in a thematic context, based on real-life situations. Listening comprehension and basic speaking skills are emphasized. Aspects of life in French- speaking countries are also presented.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54325", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "FREN 102", "Name": "Elementary French II", "Credits": "4", "Description": "Continuation of FREN 101. Emphasis is on extending skills in spoken French, within the context of real-life situations. A greater amount of reading and writing is included in this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54327", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed FREN 101 with a C or better before taking this class or have completed 2 years of high school French."}, {"Course": "FREN 103", "Name": "Intensive Review of Elementary French", "Credits": "4", "Description": "Open to students who have completed level III in high school and who nevertheless are unprepared for FREN 201 either as the result of an interruption of five years in their study of the language or as a result of a weak language background. This course offers an intensive review of Elementary French I and II as an opportunity to improve the student’s listening, speaking, reading and writing skills. FREN 103 or FREN 102, but not both, may be used toward UMBC’s GFR language/culture requirement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54329", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "FREN 201", "Name": "Intermediate French I", "Credits": "4", "Description": "Further development of listening comprehension and speaking skills and increased emphasis on reading, writing and cultural knowledge. Focus is on everyday life in France and other French-speaking countries.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54331", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "FREN 201H ", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 102 or FREN 103 with a grade of C or better or have completed 3 years of high school French"}, {"Course": "FREN 202", "Name": "Intermediate French II", "Credits": "4", "Description": "A continuation of FREN 201, with deeper emphasis on advanced grammar and discussion in French on social and cultural issues.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54334", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "FREN 202H ", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 201 with a C or better before taking this class or have completed 4 years of high school French."}, {"Course": "FREN 300", "Name": "Special Projects in French Language", "Credits": "1", "Description": "Intensive individualized program of study in French language in an area determined by the student’s particular needs. This course is repeatable for credit. Note: Credits earned in FREN 300 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of French studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLL.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54339", "Consent": "No Special Consent Required", "Components": "Independent Study", "Topics": "Spec Proj Fren Lang, Independent Study"}, {"Course": "FREN 301", "Name": "Advanced French I", "Credits": "3", "Description": "An advanced French language course offering practice in the four language skills (listening, reading, speaking and writing) primarily through the use of French films. In addition to regular speaking practice, the course will include formal oral presentations and expository writing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54341", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "FREN 301H ", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 202 with a grade of C or better before taking this class."}, {"Course": "FREN 302", "Name": "Advanced French II", "Credits": "3", "Description": "A continuation of FREN 301, with more attention devoted to the development of reading and writing skills.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54343", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 301 or FREN 301H with a grade of C or better before taking this class."}, {"Course": "FREN 310", "Name": "Interconnections: Language", "Credits": "3", "Description": "This course is an introduction to language history and use in the French-speaking world. Among the topics covered are style and register, the origins of French, dialect diversity, language attitudes, and language policy. Lectures, readings and activities will focus on a number of different Francophone societies and will emphasize connections and contrasts with North American habits and practices. Taught in French. Recommended Preparation: MLL 190 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54349", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302  with a grade of C or better."}, {"Course": "FREN 315", "Name": "French Phonetics", "Credits": "3", "Description": "Detailed analysis of problems in diction; the use of the international phonetic alphabet; functions of the human vocal apparatus; the essentials of an authentic French accent through systematic exercises in pronunciation, intonation and rhythm. Extensive use of the Media Center.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54356", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 202 with a grade of C or better before taking this class."}, {"Course": "FREN 319", "Name": "French Translation", "Credits": "3", "Description": "Instruction and practice in translating from French to English. Students work with various written materials covering many fields. Recommended Preparation: FREN 310 and MLL 190.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54357", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "FREN 320", "Name": "Interconnections: Trade, Technology, and Globalization", "Credits": "3", "Description": "This course focuses on France’s role within the European Union and in the world economy. It will examine how economic and technological developments are shaping France’s sociopolitical landscape while raising new questions about French identity. Globalization trends and the anti-globalization movement will be studied from a French point of view. Taught in French. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54359", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "FREN 330", "Name": "Interconnections: Ideas, Literature and the Arts", "Credits": "3", "Description": "This course examines major moments in French intellectual, literary and artistic history and their interactions with other cultures. Emphasis will be on those movements that have left their mark on present-day cultures, such as medieval religious, courtly and architectural ideals; renaissance humanism, rationalist and classical appeals to moral and aesthetic balance; the Enlightenment belief in progress and human rights; romantic and realist concerns with the environment and social justice; impressionism; surrealism; existentialist and post-structuralist thought; feminisms; and francophone post-colonialism and post-modernism. Taught in French.  This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54369", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "FREN 339", "Name": "Exploration in Ideas, Literature and the Arts", "Credits": "3", "Description": "This course will examine a selected topic in French and Francophone literature, arts and ideas. Topics could include a movement, such as classicism, romanticism or post colonialism; a genre, such as drama or the novel; a theme; or individual authors. Emphasis will be placed on artistic and intellectual interconnections between French-speaking countries and other cultures. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54372", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete FREN 301 and FREN 302 and one upper level French course with a grade of C or better before taking this class."}, {"Course": "FREN 340", "Name": "Interconnections: Social and Historical Confluences", "Credits": "3", "Description": "This course treats key historical events and social movements in France and French-speaking lands and their connections with the rest of the world. These include: exploration in the New World, the Great Revolution of 1789, nationalism, the Napoleonic legacy, socialism and communism, the World Wars, imperialism and decolonization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100494", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "FREN 349", "Name": "Explorations in History and Society", "Credits": "3", "Description": "An examination of modern French or Francophone society and culture. Topics may include politics, youth and the education system, feminism, immigration issues, cultural practices and policies, and intellectual and daily life. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54373", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 301 and FREN 302 and one upper level French course with a grade of C or better before taking this class."}, {"Course": "FREN 399", "Name": "Experiential Learning in French", "Credits": "3", "Description": "Intensive language practice in a French-speaking environment. This course is most effectively completed through study abroad or through a work or community service placement in a French-speaking milieu This course is repeatable for credit. Recommended Preparation: FREN 302 and the Area Coordinator’s permission.", "Grading": "Pass/Fail", "Course ID": "54374", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Experiential Lrning Fren, Experiential Learning, Experiential Learning Fr", "Prerequisite/Corequisite": "You must complete FREN 302 with a grade of C or better."}, {"Course": "FREN 400", "Name": "Special Topics in French", "Credits": "1", "Description": "This course is open to students on application to the instructor who will supervise the particular project. This course is repeatable for credit. Note: Credits earned in FREN 400 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of French studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLL. Request for permission to register in the course must be in writing and must specify the number of credits sought.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54375", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "FREN 410", "Name": "Studies in French Language and Linguistics", "Credits": "3", "Description": "Advanced work in French language and linguistics. Topics may include intensive work on prose style, study of a particular sociolinguistic problem, or analysis of some aspect of the French language. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54379", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 310 with a grade of C or better before taking this class."}, {"Course": "FREN 430", "Name": "Studies in French Literature", "Credits": "3", "Description": "Selected topics in French and Francophone literature may include the study of a century, movement, genre, theme or individual author. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54381", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "North African Literature, Stars of French Cinema, Stars of French Film, Francophone Caribbean Lit", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete FREN 330 and FREN 340 with a grade of C or better."}, {"Course": "FREN 440", "Name": "Studies in French Speaking Culture and Society", "Credits": "3", "Description": "Selected topics will deal with French-speaking societies of the present or past, both in Europe and elsewhere. Among the recent offerings: contemporary French cinema, the dark side of the Classical period, Senegal and the French experience, and French public memory and national identity. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54383", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete FREN 330 and FREN 340 with a grade of C or better."}, {"Course": "FREN 450", "Name": "Seminar in French", "Credits": "3", "Description": "Topics will cover some aspect of French language, literature or civilization. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54384", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "New Rebels Film, Society, Occupation & Aftermath", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed 12 credits in FREN courses higher than FREN 302 all with a grade of C or better."}, {"Course": "FYS 101", "Name": "First Year Seminar (AH)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054403", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "FYS 101Y ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "FYS 101Y", "Name": "First Year Seminar (AH)", "Credits": "4", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "102228", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "FYS 101 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "FYS 102", "Name": "First Year Seminar (SS)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054419", "Consent": "No Special Consent required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "FYS 103", "Name": "First Year Seminar (S)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054429", "Consent": "No Special Consent required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "FYS 104", "Name": "First Year Seminar (C)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054440", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GFR)"}, {"Course": "FYS 106", "Name": "First Year Seminar (SS/C)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054447", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "additional": ","}, {"Course": "FYS 107", "Name": "First Year Seminar (AH/C)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "054449", "Consent": "No Special Consent required", "Components": "Lecture", "Topics": "Happy Birthday, Don Quixote!, Latin America and the United States in the World Today, Love’s Philosophy, American Orientalism", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "FYS 108", "Name": "First Year Seminar (M)", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes.", "Grading": "Graded", "Course ID": "101956", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Computation as an Experimental Tool, Dynamics of Problem Solving, Crimebusting with Mathematics and Statistics, Mathematics in Literature", "Attributes": "Mathematics (GEP)"}, {"Course": "GWST 099", "Name": "Women’s Self-Defense", "Credits": "0", "Description": "Drawing on feminist, queer, social, and critical race theory, this course examines the status of the body in both historical and contemporary debates about identity, representation, and politics. We tend to take the body for granted as the ground of experience and knowledge, but this course challenges that common sense, asking how the body is produced, managed, and deployed in a various ways to discipline and manage populations. We will also investigate the political possibilities of body work to resist and reshape these same disciplinary practices, paying particular attention to “queer” forms of embodiment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51367", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 100", "Name": "Introduction to Gender and Women’s Studies", "Credits": "3", "Description": "This course introduces students to the interdisciplinary field of gender and women’s studies, feminist scholarship, and feminist activism. We will examine the relationship between gender, power, and the production of feminist knowledge in a variety of fields, including psychology, sociology, literature, media studies and history. The course provides critical perspectives on the social construction of gender and sexuality, social inequalities based on gender and sexuality, and how those norms function interactively with categories of difference such as race, class, nation, ability and age.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51014", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 100H, GWST 100Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "GWST 100H", "Name": "Introduction to Gender and Women’s Studies", "Credits": "3", "Description": "This course introduces students to the interdisciplinary field of gender and women’s studies, feminist scholarship, and feminist activism. We will examine the relationship between gender, power, and the production of feminist knowledge in a variety of fields, including psychology, sociology, literature, media studies and history. The course provides critical perspectives on the social construction of gender and sexuality, social inequalities based on gender and sexuality, and how those norms function interactively with categories of difference such as race, class, nation, ability and age.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100129", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 100, GWST 100Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "GWST 100Y", "Name": "Introduction to Gender and Women’s Studies", "Credits": "4", "Description": "This course introduces students to the interdisciplinary field of gender and women’s studies, feminist scholarship, and feminist activism. We will examine the relationship between gender, power, and the production of feminist knowledge in a variety of fields, including psychology, sociology, literature, media studies and history. The course provides critical perspectives on the social construction of gender and sexuality, social inequalities based on gender and sexuality, and how those norms function interactively with categories of difference such as race, class, nation, ability and age.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102640", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 100 , GWST 100H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "GWST 200", "Name": "Studies in Feminist Activism", "Credits": "3", "Description": "This course examines theories of civic agency and social change in both historical and contemporary contexts. Particular attention is paid to the intersections of gender, race, class, and sexuality in feminist and anti-racist social movements. Students then connect theory and praxis through the group planning and implementation of activist projects on campus and/or in the wider community.", "Grading": "Graded", "Course ID": "51060", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "GWST 210", "Name": "Introduction to Critical Sexuality Studies", "Credits": "3", "Description": "This course introduces students to the field of critical sexuality studies. Using an interdisciplinary approach, the course conducts a critical inquiry into the historical precedents and theoretical frameworks necessary to understand the role of sexuality in shaping personal, social, economic, and political life. The course focuses on patterns of subordination and exclusion based on individuals¿ sexual practices and identities, explains the origins and persistence of those patterns, and considers ways of challenging them. Throughout the course, special attention will be given to intersections of sexuality with gender, race, ethnicity, religion, class, and disability.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50032", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 210H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AMST 210 "}, {"Course": "GWST 210H", "Name": "Introduction to Critical Sexuality Studies", "Credits": "3", "Description": "This course introduces students to the field of critical sexuality studies. Using an interdisciplinary approach, the course conducts a critical inquiry into the historical precedents and theoretical frameworks necessary to understand the role of sexuality in shaping personal, social, economic, and political life. The course focuses on patterns of subordination and exclusion based on individuals¿ sexual practices and identities, explains the origins and persistence of those patterns, and considers ways of challenging them. Throughout the course, special attention will be given to intersections of sexuality with gender, race, ethnicity, religion, class, and disability.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101887", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 210 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AMST 210 "}, {"Course": "GWST 220", "Name": "Introduction to Transgender Studies", "Credits": "3", "Description": "Drawing on historical and contemporary sources, this course is an introduction to and survey of the field of transgender studies with a particular emphasis on the intersection of the field with feminist and LGBTQ studies. While seeking to understand the emergence and varied lived experiences of transgender identities, the course also aims to teach students to think critically about the political, economic, ideological, and transnational lives of “transgender” as a concept.", "Grading": "Graded", "Course ID": "102479", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 245", "Name": "Arab and Muslim Experiences in the United States", "Credits": "3", "Description": "This course introduces students to Arab and Muslim experiences in the U.S. via the study of literature, film, and art created by Arab and Muslim Americans. The course takes a historical approach and looks at texts that concern major historical events in Arab and Muslim American history. It will discuss how Arab and Muslim artists and writers are responding to and refusing racism and Orientalism while challenging gendered, sexual, and cultural norms within their communities. Recommended Preparation: GWST 100 or AMST 200 or GLBL 100 ", "Grading": "Graded/Pass Fail", "Course ID": "102622", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AMST 245 "}, {"Course": "GWST 250", "Name": "Gender Roles in Economic Life", "Credits": "3", "Description": "This course will investigate the influence of gender roles in paid and unpaid work. Topics to be covered include gender in the labor market (job segregation, pay equity, affirmative action), the economics of housework and family care, women in poverty and the role of government. Recommended Preparation: An introductory course in economics, sociology or gender and women’s studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50063", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ECON 250 "}, {"Course": "GWST 255", "Name": "Intercultural Paris", "Credits": "3", "Description": "This culture course aims to introduce students to the field of French studies by examining France’s capital city in both historical and contemporary contexts and the numerous, marginalized, and multicultural populations it has been home to: women, gays and lesbians, North-and Western African immigrants, Jews, and undocumented workers. The course adopts an interdisciplinary approach informed by cultural studies, history, anthropology, linguistics, urban studies, and gender and women’s studies.", "Grading": "Graded", "Course ID": "100973", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "MLL 255 "}, {"Course": "GWST 258", "Name": "Introduction to Feminist Philosophy", "Credits": "3", "Description": "Drawing on historical and contemporary sources, this course critically examines the ways in which women and women’s experiences have been ignored and explicitly and implicitly devalued in Western philosophy. It also seeks to uncover what, if anything, about the methods and central concepts of Western philosophy account for such exclusion and (apparent) contempt. More positively, we will evaluate new feminist approaches to old philosophical questions, such as: What is knowledge? What is justice?", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50133", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "PHIL 258"}, {"Course": "GWST 290", "Name": "Issues in Gender and Women’s Studies", "Credits": "3", "Description": "An examination of important issues in gender and women’s studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51368", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Latin American Societies, Issues In Gwst, Issues and Phases in Women’s Health, Women of the Hebrew Bible"}, {"Course": "GWST 292", "Name": "Issues in Critical Sexuality Studies", "Credits": "3", "Description": "An introductory examination of important issues in critical sexuality studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102084", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "GWST 300", "Name": "Methodologies in Gender, Women’s, and Sexuality Studies", "Credits": "3", "Description": "This writing intensive seminar introduces students to the theory and practice of interdisciplinary research in the field of gender, women’s, and sexuality studies. The course examines the distinguishing features of feminist methodologies that draw from the social sciences and the humanities. By reading and discussing examples of excellent and innovative research, students will become acquainted with the practical details, intellectual challenges, and the ethical dilemmas involved in doing research about women, gender, and sexuality. The course also explores the connections between research and community activism.  Recommended Preparation:  GWST 100, GWST 210 , GWST 310 and/or GWST 200.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54592", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "GWST 310", "Name": "Gender and Inequality in America", "Credits": "3", "Description": "An examination of the ways in which gender roles and gender relations are constructed and experienced in American society. The course explores the development of a woman’s “sphere” denoting women’s position in the family and home; cultural definitions of femininity and masculinity through mass media, education and other agencies of socialization; the relationship between wage-earning and household work; and feminist consciousness and politics. Special attention is paid to the ways in which gender-based experiences are divided by other social relations, particularly those of class, race and age. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50033", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 310H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AMST 310 "}, {"Course": "GWST 310H", "Name": "Gender and Inequality in America - Honors", "Credits": "3", "Description": "An examination of the ways in which gender roles and gender relations are constructed and experienced in American society. The course explores the development of a woman’s “sphere” denoting women’s position in the family and home; cultural definitions of femininity and masculinity through mass media, education and other agencies of socialization; the relationship between wage-earning and household work; and feminist consciousness and politics. Special attention is paid to the ways in which gender-based experiences are divided by other social relations, particularly those of class, race and age. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51369", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "GWST 310 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AMST 310 , AMST 310H "}]