[{"Course": "POLI 371", "Name": "Comparative Asian Politics", "Credits": "3", "Description": "Comparative study of the politics of Asian regimes with emphasis on the origins and impact of democratic versus authoritarian regimes and the problems of modernization in such countries as Japan, India, Indonesia and China. Recommended Preparation: Junior standing or POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56282", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 372", "Name": "Transitioning States and Nations: Study Abroad in Poland", "Credits": "3", "Description": "In this course, students will study transitioning societies from a historical/cultural perspective. We will look at how Polish values and attitudes have been shaped by distinct political, geographical and cultural components. This, in turn, will help us grasp the political dimensions of ethnicity and nation in Poland, but also in a broader context. Recommended Preparation: POLI 260 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102367", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "POLI 373", "Name": "Comparative Middle Eastern and North African Politics", "Credits": "3", "Description": "Comparative study of the politics of the Middle Eastern and North African states, including the relationship between development, political organization and social structure. Recommended Preparation: Junior standing or POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56283", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 374", "Name": "European Politics", "Credits": "3", "Description": "First, the course offers an examination of classical concepts in comparative and European politics, such as electoral systems, political parties, federalism, and the welfare state. Next, we study the European Union, its history, institutions, and effects on European politics. Finally, at the very end of the semester we turn to the former Communist countries of Eastern Europe, discuss the recent regime transition that has occurred in many countries and consider the impact of the most recent enlargement on the European Union. Recommended Preparation: Junior standing or POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56284", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 377", "Name": "Latin American Politics", "Credits": "3", "Description": "In this course, students critically analyze the politics of Latin America from multiple perspectives and discuss approaches to political issues faced by the region. The course starts with the historical background of Latin American politics but emphasizes the contemporary period. Students examine the interplay of national, regional, hemispheric and global forces operating in Latin American politics, which contributes to their skills in comparative politics, international relations and global studies. Topics examined include democratic governance, populism, economic policy, regional integration and immigrant political transnationalism.  Recommended Preparation: POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56285", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 378", "Name": "Contemporary African Politics", "Credits": "3", "Description": "Nationalism and the struggle for independence. The evolution of post-independence systems and institutions. Examination of problems and trends since independence, including development administration, territorial and ethnic conflicts, nation-building and the role of the military, decolonization and neocolonialism, and Africa in world affairs. This course is repeatable for credit. Recommended Preparation: AFST 211 or HIST 242 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50020", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp African Politics", "Same as Offered": "AFST 320 "}, {"Course": "POLI 379", "Name": "War and Film", "Credits": "3", "Description": "This course explores the history of interaction between war and film to understand the impact of these two powerful technologies on each other and on human life. Students taking the course can expect to develop a culturally differentiated understanding of meanings of war in film. We will watch and critically review films, audio, and other media and tie intellectual developments with the representation of war in film. Recommended Preparation: POLI 280 ", "Grading": "Graded", "Course ID": "100970", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "POLI 380", "Name": "International Relations Theory", "Credits": "3", "Description": "An intensive overview of the central schools of thought in the study of international relations (IR). We will read, discuss and write about theories rooted in realism, liberalism, Marxism, constructivism and other IR paradigms. Emphasis is on the purposes of theory, the main perspectives in IR theory and how IR theory has developed in conjunction with the evolution of international relations itself. Students should be prepared for careful reading, critical discussion and analytical writing. Recommended Preparation: POLI 280  or POLI 281.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56286", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 381", "Name": "International Relations of the Asia-Pacific Region", "Credits": "3", "Description": "Theoretical and historical examination of international relations in the Asia-Pacific region since 1945. Topics will include: the Cold War in Asia; regional great-power rivalries; contemporary flashpoints such as the Korean peninsula and Taiwan; transnational terrorism; the U.S.-led regional alliance system; and multilateral groupings, such as APEC and ASEAN. Throughout the course, we will pay close attention to how history has shaped theory and how theory, in turn, has shaped history. Recommended Preparation: POLI 280.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56287", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 382", "Name": "Politics of Climate Change", "Credits": "3", "Description": "In this course, students are introduced to some of the major hurdles presented by climate change. We ask questions that include: How will global populations be impacted by climate change? To what degree are state and non-state actors attempting to mitigate or adapt to these challenges? What determines the likelihood of action and inaction? This class focuses on the political dimensions of climate change from both global and local perspectives. Recommended Preparation:  POLI 260 , POLI 260Y , POLI 280 ", "Grading": "Graded", "Course ID": "102681", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 383", "Name": "Global Citizenship", "Credits": "3", "Description": "In this seminar course, students critically examine theories of global citizenship, explore how global citizenship has been enacted on multiple levels, and investigate key issues of global citizenship, such as international migration, public health, world poverty and climate change. Students also engage in experiential learning through service in local community organizations that tackle global problems. Recommended Preparation: GLBL 100 or POLI 100.", "Grading": "Graded", "Course ID": "102732", "Consent": "Instructor Consent Required", "Components": "Lecture", "Same as Offered": "GLBL 383"}, {"Course": "POLI 384", "Name": "International Organizations", "Credits": "3", "Description": "One characteristic of the increasingly globalized international environment is the proliferation of intergovernmental organizations (IGOs, such as the U.N., the World Bank, IMF, WTO) and non-governmental organizations (NGOs, such as Amnesty International, Doctors Without Borders, Greenpeace and the International Red Cross). This course examines what it means to organize internationally, both in theory and in practice. It considers the future of IGOs and NGOs and their likely impact on the dynamics of world politics. Recommended Preparation: POLI 280  or POLI 281.", "Grading": "Graded", "Course ID": "56290", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 384L", "Name": "Model United Nations", "Credits": "1", "Description": "Open to students attending fall or spring Model United Nations conferences. Students will attend collegiate conferences to serve as a nation’s expert on assigned committees to negotiate United Nations resolutions. Students will be graded on their research on issues, completeness of position papers and draft resolutions prepared for the conference. This course is repeatable for credit. Students may complete a maximum of 4 credits or 4 attempts. Recommended Preparation: POLI 384. (Fall/Spring)", "Grading": "Graded", "Course ID": "56291", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 385", "Name": "International Security", "Credits": "3", "Description": "This course is both an introduction to the scholarly discipline of security studies and a broad survey of contemporary international security issues. Topics will include core concepts in security studies; strategy during the Cold War; post-Cold War international security issues, such as nuclear dangers and arms control; major-power relations in Europe and Asia; and so-called new security issues, such as sub-state conflicts, transnational terrorism, refugee and migration flows, the problem of failed states and environmental degradation. Recommended Preparation: POLI 280.or POLI 281 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56292", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 386", "Name": "The Politics of Development", "Credits": "3", "Description": "This course examines the interaction of politics (the making and implementation of collective decisions for a society) and human development (the improvement of living conditions in a society). Various theoretical approaches are used to study the role of politics in the multiple dimensions of development, including economic growth, environmental sustainability and human rights. Recommended Preparation: 3 Social Sciences GEP courses.", "Grading": "Graded", "Course ID": "102074", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GLBL 386"}, {"Course": "POLI 387", "Name": "The Basics of Political Economy", "Credits": "3", "Description": "In a world of scarcity, societies use both political and economic means to determine ‘who gets what, where, when, why, and how.’ The political-economic ‘mix’ employed, reflects each society’s basic values and beliefs about what constitutes ‘the good society.’ In this course, we will examine concepts, institutions, and instruments associated with the domains of politics (e.g., power/governance) and economics (e.g., exchange/ markets). We will consider their relative strengths and weaknesses as these relate to motivating behavior and organizing collective activity in order to address the great social challenges of our day. Topical case studies will vary from semester to semester, but case study topics are likely to include climate change, affordable health care, entitlements, governing/regulating the Internet.", "Grading": "Graded", "Course ID": "56294", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "POLI 388", "Name": "International Conflict and Cooperation", "Credits": "3", "Description": "The course introduces game theory at an elementary level. Simple models of strategic interaction and conflict will be presented to analyze the strategy and tactics of international (and other) deterrence, coercion, bargaining and cooperation. Attention will be given to doctrines of nuclear strategy and arms control and to the changing strategic balance between the United States and the Soviet Union during the Cold War period. Recommended Preparation: Junior standing or POLI 280.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56295", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 390", "Name": "American Foreign Policy", "Credits": "3", "Description": "This course provides an overview of American foreign policy with a focus on the post-World War II period. It combines a chronological overview of seminal events with a topical survey of strategic eras from Cold War containment to the war on terror. Competing sources of foreign policy - institutional, bureaucratic and social psychological are also considered. Recommended Preparation: POLI 280 or POLI 281 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56296", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 395", "Name": "National Security Policy of the United States", "Credits": "3", "Description": "An overview of the problems of policy, organization and implementation involved in providing for the national security of the United States. Issues of threat perception, crisis management and intelligence analysis are examined. Focus is also placed on evolving threats, including cyber security and human security issues. Recommended Preparation: POLI 280  or POLI 281 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56301", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "POLI 401", "Name": "Individual Study in Political Science", "Credits": "1", "Description": "Independent reading and research supervised by a member of the political science faculty. Intended for students who desire to study independently an aspect of political science not covered by regular course offering. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56303", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "POLI 402", "Name": "Honors Research", "Credits": "1", "Description": "Research leading to honors thesis under supervision of a member of the political science faculty. This course is repeatable for credit. Students may complete a maximum of 6 credits. Note: Admission into the departmental honors program required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56304", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "POLI 403", "Name": "Research Internship", "Credits": "1", "Description": "Student applicants selected by the department will work closely with a faculty member in the conduct of research or the preparation of publications. Intended for advanced students who are seriously interested in entering graduate study in political science or a related field. This course is repeatable for credit.", "Grading": "Graded/Pass Fail", "Course ID": "56305", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "POLI 405", "Name": "Seminar in Political Science", "Credits": "1", "Description": "An advanced seminar on some topic within political science. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56306", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Community And Politics, Identity Politics & American Democracy, Globalization and Transitional Justice, The Political Theory of the American Framing, Cultural Identity and American Democracy"}, {"Course": "POLI 406", "Name": "Seminar in Political Psychology", "Credits": "3", "Description": "A seminar covering those areas of politics in which a psychological perspective can enhance understanding of the political process. No background in psychology will be assumed. Under the guidance of the instructor, students will pursue individual research projects, as well as discuss and evaluate generally assigned readings. Recommended Preparation: Junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56307", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 407", "Name": "Political Writing", "Credits": "3", "Description": "Political Writing introduces students to writing within the professions of politics, public policy and political communications. Students learn to write both as surrogates on behalf of principals as well as in their own voice. Among other assignments, students learn how to write op-eds, campaign ads, policy papers, and campaign speeches. Recommended Preparation: Completion of the Writing Intensive (WI) Requirement.", "Grading": "Graded", "Course ID": "102694", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MCS 407 "}, {"Course": "POLI 409", "Name": "Selected Topics in Political Science", "Credits": "1", "Description": "Study of a particular topic that overlaps two or more areas of political science. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56308", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "POLI 410", "Name": "Seminar in Political Theory", "Credits": "3", "Description": "Advanced study of selected texts in political theory that address important issues, problems, and debates in political life.  Emphasis is placed on applying American political theories to political practice.  Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: POLI 210  or another POLI course in political theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56310", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 412", "Name": "Ethics and Public Policy", "Credits": "3", "Description": "Moral issues facing people individually and collectively in their professional or public roles, such as government officials, corporate managers, scientists, doctors and citizens. Clarification of value concepts such as freedom, equality, justice, the public interest and community. Exposition of these values as they pertain to actual cases of decision-making and policy debates. Issue areas examined include personal integrity in public and private organizations, corporate social responsibility, government regulation of technology and the ethics of income redistribution. This is a seminar course intended for upper-level students with some background in ethics and/or political philosophy. Recommended Preparation: Permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56312", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 419", "Name": "Advanced Selected Topics in Political Theory", "Credits": "3", "Description": "Study of a particular topic within the area of political philosophy and theory. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: POLI 210 or another POLI course in political theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56316", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Biol & Pol Consios, After The Age Of Reason, Hobbes Origin Of Modern, Crisis Of Poli Origins, Top:Ethics/Public Policy, Political Phil Today, Biol Thry& Pol Conscious, Topics In Political Thry, Topics:Political Theory, Political Phil & Lit, Af/Am Political Thought, Humane Warfare?, Political Education, Islam, Law, and Politics, Global Political Theories, Political Philosphy of War and Peace, Globalization"}, {"Course": "POLI 421", "Name": "Baseball, American Politics, and the Law", "Credits": "3", "Description": "Sports provide Americans with a common language to grapple with important political concepts: equality, justice, the rule of law, the power of informal norms, and the role of the individual in seeking the common good for a community. This course serves two goals. First, it explores how baseball is a reflection of and an influence on American political development. Second, it uses the rules of baseball as a lens to analyze important debates in legal theory and constitutional interpretation.   Recommended Preparation: POLI 100 , POLI 230 ", "Grading": "Graded/Audit", "Course ID": "102695", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 423", "Name": "Presidential Elections", "Credits": "3", "Description": "This course examines U.S. presidential elections and the campaigns waged to win the White House. Topics include the presidential nomination process and history; the creation, evolution and contemporary structure of Electoral College and its implications; electoral strategies and tactics utilized by candidates and campaign; and results and voting patterns from presidential nomination and general election contests.  Recommended Preparation: POLI 323 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56319", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 425", "Name": "U.S. Campaigns and Elections", "Credits": "3", "Description": "This course investigates American elections and the political campaigns waged to win federal and state offices. Topics include the structural and systemic dynamics of suffrage, voting rules and electoral results; the strategic and tactical conduct of campaigns by candidates, consultants, parties and other groups; and the patterns of electoral behavior, including turnout rates and partisan, demographic and geographic voting trends.  Recommended Preparation: POLI 325 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56320", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 427", "Name": "African American Politics", "Credits": "3", "Description": "An examination of the unique history, content and forms of African American political participation, with a particular emphasis on the nature and consequences of African-American influence within, or exclusion from, the workings of various political institutions. Attention is focused on the attitudinal and structural dimensions of participation, the socio-economic conditions of African Americans and on selected attempts by African Americans to use the political process for ameliorating said conditions. Upon completion, students will be familiarized with issues affecting contemporary discussions within African-American politics and democratic theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56322", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "POLI 325 "}, {"Course": "POLI 429", "Name": "Selected Topics in American Government and Politics", "Credits": "3", "Description": "Study of a particular topic within the area of American politics. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56325", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "POLI 430", "Name": "The Law of War", "Credits": "3", "Description": "Can law constrain the use of force and the waging of war? Can law be used to control the response to insurgencies and other internal armed conflict? Can law cool vengeance and violence into process and peace? In this course we examine how law, lawyers and courts respond to war and armed conflict. We immerse in the legal, political, philosophical and historical aspects of applying the rule of law to the carnage of war and armed conflict.", "Grading": "Graded", "Course ID": "102140", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 431", "Name": "Spies, Assassins, and Cyber-Warriors - Modern National Security Law", "Credits": "3", "Description": "Are modern national security operations such as drone strikes, cyber warfare, indefinite detention, and mass surveillance legal under domestic and international law? To what extent can officials be held accountable for abuses committed in these operations?  Through this course, students will understand how various laws, treaties, cases, and legal principles influence modern national security and counter-terrorism operations. It will equip students to critically analyze these policies - and to work for the changes they deem appropriate. Recommended Preparation: POLI 220 , POLI 230 ,POLI 233 , POLI 260 , POLI 280 , POLI 281 , POLI 318 , POLI 334 , or POLI 337 .", "Grading": "Graded", "Course ID": "102621", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 432", "Name": "Civil Rights", "Credits": "3", "Description": "Examination of the due process and equal protection rights of Americans as articulated in judicial decisions and statutes. Among issues studied are affirmative action, abortion, equality in education and housing.  Recommended Preparation: POLI 230.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56327", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 433", "Name": "First Amendment Freedoms", "Credits": "3", "Description": "The freedoms of speech, press, religion and assembly as defined in important Supreme Court decisions. The problem of liberty versus authority in a democratic regime. The competing theories of First Amendment interpretation by courts. Recommended Preparation: POLI 230 or junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56328", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 435", "Name": "Legal Reasoning", "Credits": "3", "Description": "Designed to give students advanced understanding of the ways in which American lawyers and judges think about legal questions and issues. The course will be devoted to intensive practice in the process of legal analysis. Students will study a series of cases and related materials that address the basic tools of legal reasoning and the special characteristics of reasoning in the specific areas of American law. Recommended Preparation: Permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56330", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 436", "Name": "Health Law", "Credits": "3", "Description": "Topics include an overview of major issues in health law, such as definitions of life, the Good Samaritan concept, client rights, privacy, professional licensing, liability and malpractice. Recommended Preparation: Junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56331", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AFST 385, POLI 340 "}, {"Course": "POLI 437", "Name": "International Human Rights Law", "Credits": "3", "Description": "In this course we study human rights law and the many actors and institutions struggling with its enforcement. In it we use the case method to master the legal contours of human rights and explain their limits and possibilities. To understand contemporary human rights law, one has to have a good grounding in the philosophical, political and legal concepts that form the basis of international human rights. We also focus our study on efforts to find domestic and international justice, and the relationship between human rights and international law. We introduce the legal elements of various human rights provisions and take into account the role that NGOs play in the protection and sustenance of human rights regimes. Finally, we examine several specific rights through efforts to enforce them in domestic and international courts. Recommended Preparation: POLI 230, POLI 233, POLI 280, POLI 337, POLI 432, POLI 433 OR POLI 482.", "Grading": "Graded", "Course ID": "100676", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 438", "Name": "Legal Internship", "Credits": "4", "Description": "Student applicants selected by the department intern under lawyers and judges. The internship program includes supervised public service, directed reading and research, and classroom and seminar instruction. Intended for non-majors as well as majors. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56332", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "POLI 439", "Name": "Selected Topics in Public Law", "Credits": "3", "Description": "Study of a particular topic within the area of public law, such as the relationship between private law and public justice, the role of the judicial process in social change or a particular area of constitutional law. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Note: See Schedule of Classes for section prerequisites.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56334", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 440", "Name": "Urban Politics", "Credits": "3", "Description": "An examination of problems, politics and policies relevant to state, county, city and other forms of local government organizations. Problems of the city in an age of urbanization and trends in metropolitan and suburban politics are considered,with particular reference to the Baltimore area. Recommended Preparation: Junior standing plus POLI 240 or POLI 250.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56335", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 442", "Name": "Intergovernmental Relations", "Credits": "3", "Description": "An examination of the American federal system, with emphasis on processes of conflict and coordination between local governments, state governments and national government. Attention is focused on the allocation of responsibilities to different levels of government and the use of intergovernmental tools (such as grants, mandates, and cooperative agreements) to implement domestic policies. Recommended Preparation: POLI 240 or junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56336", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 452 "}, {"Course": "POLI 443", "Name": "Urban Problems and Policy Analysis", "Credits": "3", "Description": "This course is designed to provide students with an understanding of the nature and causes of urban problems and the ability to analyze and understand the problems and policies addressed to them. This course is repeatable for credit. Recommended Preparation: Permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56337", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 445", "Name": "Law, Politics and American Educational Policy", "Credits": "3", "Description": "Examination of the way in which the political process creates and implements educational policy. Topics include school integration, students’ rights and academic freedom, religion and education, federal legislation and regulation, politics of higher education, school finance, collective bargaining, urban school governance and school choice.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56338", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "POLI 446", "Name": "The Politics of Poverty and Social Welfare Policy", "Credits": "3", "Description": "Study of liberal, conservative and radical views of the welfare state. How politics in Congress, the bureaucracy, interest groups and federal-state relations affect the formulation and implementation of social welfare policies. Comparisons of American policies and politics with those of other nations. Recommended Preparation: Junior standing or two courses in American politics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56339", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "POLI 448", "Name": "Internship in Policy, Politics, and Administration", "Credits": "4", "Description": "Students selected by the department intern in the offices of elected officials, political parties, advocacy groups, think tanks, government agencies, public administrators, or other institutions in the policy process. Supervised reading and research programs and seminars with other interns develop relevant professional skills and situate the internship experience within the broader study of efforts to shape public policy.", "Grading": "Graded", "Course ID": "100367", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 449", "Name": "Politics of Environmental Policy", "Credits": "3", "Description": "This course explores how political beliefs, behaviors, and institutions produce public policies intended to protect the natural environment and the humans that depend on that environment. Emphasis is placed on how environmental and other advocacy organizations attempt to affect legislative, administrative, and judicial decisions. Recommended Preparation: POLI 100 or GES 120.", "Grading": "Graded", "Course ID": "101932", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 450", "Name": "Seminar in Public Administration and Policy", "Credits": "3", "Description": "An integrative seminar for advanced students in public administration and policy. The course applies theories of administrative capacity, organizational leadership, policy design and political feasibility to current policy problems. Students prepare research papers with special attention paid to improving information gathering and writing skills. Recommended Preparation: POLI 350, POLI 353 and POLI 354 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56341", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 452", "Name": "Politics of Health", "Credits": "3", "Description": "This course examines how health policies reflect the political system in which they are enacted and implemented. It introduces concepts, theories and literature concerning the development of the U.S. healthcare system and the contemporary agendas and actions of the federal and state governments. It applies political dimensions to policy issues such as access to insurance and health services, cost containment, disease and injury prevention, and initiatives for health care reform. Recommended Preparation: Junior standing and POLI 100 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56342", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 442 "}, {"Course": "POLI 459", "Name": "Selected Topics In Public Policy", "Credits": "3", "Description": "Study of a particular topic within the area of public policy. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Note: See Schedule of Classes for section prerequisites.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56345", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Public Admin And Policy, An International Perspec, Urban Management, Social Policy Reform"}, {"Course": "POLI 460", "Name": "Comparative Institutional Development", "Credits": "3", "Description": "Institutions are the rules that guide human interaction. Whenever we come into contact with other humans, institutions are involved. But where did our social, political and economic institutions come from? How did they become so firmly entrenched in our societies? This class attempts to answer these profound and often abstract questions by reading influential books on the subject and by generating our own ideas in class discussions. Recommended Preparation: POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56346", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 461", "Name": "Comparative Legislatures", "Credits": "3", "Description": "This class will present an analysis of various democratic legislatures around the globe. Each student will be assigned a specific legislature and will be responsible for gathering and analyzing information for that legislature during the semester. Topics for class discussion will include each legislature’s history, broad institutional structures (procedures and rules), and main political features (parties and politicians). Recommended Preparation: POLI 260 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56347", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 462", "Name": "Comparative Electoral Systems and Representation", "Credits": "3", "Description": "This course examines the great variety of election methods used around the world and their consequences for the representation of parties, interests and groups - especially those with minority status - in legislatures, governments and policy outcomes. Recommended Preparation: POLI 260 or POLI 325.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56348", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 472 "}, {"Course": "POLI 464", "Name": "Comparative Political Economy", "Credits": "3", "Description": "An examination of the political and policy responses of the advanced industrial states in Western Europe, North America and Japan to past and present economic challenges. The course will focus on how ideology, political, social and economic institutions, and socioeconomic interests in each area shape its response to the rise of the new competitors in other parts of the world, changes in technology and production, and the globalization of markets and finance. Recommended Preparation: POLI 260 or junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56350", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 467", "Name": "Comparative Foreign Policy", "Credits": "3", "Description": "This course focuses on the intersection of two important subfields in Political Science, foreign policy and comparative politics. Initial work centers on an examination of the conceptual and methodological tools for the analysis of foreign policy formulation and implementation. Students explore commonalities and differences in the behavior of states from both a regional comparative basis as well as a topical one. The latter includes decision-making theory, two-level game analysis, and an intercultural dissonance hypothesis. Recommended Preparation: POLI 260 and (POLI 280 or POLI 281)", "Grading": "Graded", "Course ID": "56353", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 468", "Name": "Disaster Politics", "Credits": "3", "Description": "This course is designed to introduce students to the political and policy dimensions of disaster. The course will explore how disaster affects the social/political landscape, as well as how that social/political landscape affects the state’s ability to deal with disaster. Topics covered include state institutional adaptation and policy learning; special cases of vulnerability; the impact of disaster on local and international conflicts; and humanitarian assistance. Recommended Preparation: POLI 250 , POLI 260 , POLI 260Y ", "Grading": "Graded", "Course ID": "102683", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 469", "Name": "Selected Topics in Comparative Politics", "Credits": "3", "Description": "Study of a particular topic chosen from within the area of comparative politics. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56355", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "POLI 470", "Name": "Politics of Human Rights", "Credits": "3", "Description": "The term “human rights” has become an incredibly powerful one in international relations, used as everything from a justification for support of a given country to an excuse for war against one. But “human rights” is more than a catch-all phrase differentiating the “good” from the “bad” in this world. It is a set of commonly recognized norms and laws that have evolved over hundreds of years. It is a system of international, regional and domestic enforcement mechanisms. And it is an increasingly important part of Western states’ self-identities and foreign policies. The purpose of this course is to explore what human rights are, how they have evolved, and how they influence the international and domestic political arenas. Recommended Preparation: POLI 260, POLI 280 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101873", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade of ‘C’ or better"}, {"Course": "POLI 471", "Name": "Globalization and Transitional Justice", "Credits": "3", "Description": "In this course we analyze transitional justice, the process by which political elites in post-repressive states account for human rights violations orchestrated by their predecessors. When and under what conditions do newly empowered political leaders choose to confront past abuses and what are the mechanisms they have at their disposal? Why do some new leaders choose to close the past with a one-line condemnation, while others establish a year-long truth commission and still others initiate a decade of criminal prosecutions? This class focuses on the political, rather than judicial, side of transitional justice, taking into account the elite calculus of risk and advantage inherent in the variety of policies political leaders have at their disposal. Recommended Preparation: POLI 260, POLI 280 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101872", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "POLI 472", "Name": "Modern Indian Politics", "Credits": "3", "Description": "This course examines modern nation-building and self-government in a traditional society. Other topics discussed include: the secular state; political parties, economic development, the transformation of caste, the rise of revolutionary movements and of ethnic and religious nationalism, the development of nuclear weapons, and the continuing conflict with Pakistan. Recommended Preparation: POLI 260 and (POLI 280  or POLI 281).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56356", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 462 ", "Attributes": "Culture (GFR)"}, {"Course": "POLI 473", "Name": "Mahatma Gandhi’s Political Experiments with Truth", "Credits": "3", "Description": "A study of Gandhi’s effort to gain national independence and to reform India by non-violent vindication of truth. A reflection on Gandhi’s sexual asceticism, civil disobedience, and politicization of women. A comparison and contrast of Gandhi with Socrates, Henry Thoreau and Rev. Martin Luther King Jr. Intended for non-majors as well as majors. A seminar presentation, a research paper, and regular class attendance are all required. Recommended Preparation: Junior standing or a grade of C or better in POLI 200 or POLI 301 or a writing class beyond ENGL 100 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50224", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)", "Same as Offered": "RLST 473 "}, {"Course": "POLI 474", "Name": "Democratization", "Credits": "3", "Description": "In this course, we explore the theory behind, and the policy questions surrounding, democratization. We begin this class by considering the outstanding traits of democracies and their alternatives, and looking at various theories that help account for why some states democratize and others do not. Next, we consider democratization from the viewpoint of the citizen in non-democratic states. In this section, we look both at the role of the masses and that of counter-elite activists as they seek to weaken the non-democratic state and replace it with a democratic alternative. Since these actors are frequently assisted by outside states, and especially the United States, we subsequently consider the pros and cons of democracy assistance. Finally, this class looks at the various conundrums common to democratizing states, ranging from choosing appropriate institutional mechanisms to the process of dealing with past human rights abuses and abusers.  Recommended Preparation: POLI 260, POLI 280 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101993", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 475", "Name": "Russian Politics", "Credits": "3", "Description": "This seminar is designed to introduce the student to the politics and government of the countries that occupy the territory of the former Soviet Union. It will cover both the history and the current political status of these countries with particular reference to the influence of the Soviet experience on their internal politics and international relations. Recommended Preparation: POLI 260 and POLI 360", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56357", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 480", "Name": "World Order", "Credits": "3", "Description": "This course considers the problem of achieving order in an international system that lacks a central organizing authority. In seminar format, we explore alternative perspectives on the nature, source, and scope of order in world politics in the context of both historical and contemporary examples. Recommended Preparation: (POLI 280 or POLI 281) and POLI 380", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56358", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 481", "Name": "Nuclear Weapons in World Politics", "Credits": "3", "Description": "This course examines nuclear weapons issues in contemporary international relations, with an emphasis on deterrence and strategic stability. It covers great-power nuclear politics (United States, China, Russia), regional nuclear powers (Britain, France, India, Pakistan Israel, North Korea), nuclear proliferation and nonproliferation, arms control and disarmament, and the possibility of nuclear terrorism. Recommended Preparation: POLI 280  or POLI 281 ", "Grading": "Graded/Pass Fail", "Course ID": "102691", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 482", "Name": "International Law", "Credits": "3", "Description": "This course is designed to introduce students to the complexities of law in the international environment. The course begins by familiarizing students with the American legal system, a brief overview of the international system and how cases are reported in the U.S., as well as the nature of international law. The first half of the class deals with how international law is created by examining treaties, the role of custom, general principles of law and judicial opinions. The second half of the class deals with the United Nations, nonofficial sources of law and the application of international law in specific instances, including a brief review of human rights. Recommended Preparation: POLI 280 and any law course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56360", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 483", "Name": "International Negotiation", "Credits": "3", "Description": "This course presents the principles of international negotiation. Using the case study method and a multiparty negotiation simulation, students will learn in hands-on fashion about the theory and practice of negotiation. Key conceptual notions include game theoretic models of strategic situations and mediation approaches. Special topics include the role of the media in agenda-setting, the importance of non-state actors in the 21 st century diplomatic arena, and the challenges of public goods issues in international and transnational negotiations. Recommended Preparation: POLI 280.", "Grading": "Graded", "Course ID": "102083", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GLBL 483"}, {"Course": "POLI 484", "Name": "Politics and International Relations of Iran", "Credits": "3", "Description": "Examines Iranian politics and foreign affairs over the last century. Covers the constitutional revolution of 1905-06; modernization under Reza Shah; the 1951 nationalization of Iran’s oil industry and 1953 coup; the reign of the Shah, Iran’s role in the Cold War; the 1978-1979 Islamic revolution; and the Iran-Iraq war. Focuses intensively on post-revolutionary Iran, especially its aspirations for great-power status, pursuit of nuclear weapons, and contentious relations with the United States. Recommended Preparation:  POLI 260 and (POLI 280 or POLI 281).", "Grading": "Graded", "Course ID": "100188", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 485", "Name": "Dynamics of the Arab-Israeli Conflict", "Credits": "3", "Description": "The course starts with a focus on the development of the Arab-Israeli conflict from its beginnings in the period when Palestine was controlled by the Ottoman Empire. The growth of Arab nationalism and Zionism will be compared, as will the conflicting promises made by the British to both Zionists and Arab nationalists during World War I. Next is a review of British rule over both Arabs and Zionists during the Palestine Mandate. The second half of the course is an examination of the Arab-Israeli wars since 1948, the Camp David and Oslo peace processes, the Al-Aksa Intifadah and developments since then. The conflict is analyzed against the background of great powers intervention in the Middle East, and the dynamics of intra-Arab politics, political Islam and oil. Recommended Preparation: One of the following: JDST 274, JDST 310, POLI 280 or POLI 373 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50185", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "JDST 410 "}, {"Course": "POLI 486", "Name": "Middle East International Relations.", "Credits": "3", "Description": "This course focuses on the world politics of the Middle East - a region crucial to international stability, given its geostrategic importance. The emphasis is on post-colonial international relations and on the importance of identity, conflict, nationalism, transnationalism and political economy to the prevailing regional system.  Recommended Preparation:  POLI 280  or POLI 281 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56361", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 487", "Name": "International Political Economy", "Credits": "3", "Description": "The course focuses on the basic analytical tools and knowledge of economics needed to develop an understanding of important international economic problems with which political actors must cope. The course explores the challenges for policy-makers stemming from the globalization of finance, markets and production. Recommended Preparation: POLI 280 or POLI 281  or POLI 387   ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56362", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 488", "Name": "Politics and International Relations of South Asia", "Credits": "3", "Description": "Overview of the politics and international relations of South Asia, a region that includes India, Pakistan, Bangladesh, Afghanistan, Sri Lanka, Nepal, Bhutan and the Maldives. Topics covered include the history of the region, covering the British colonial period, the awakening of nationalism in the late 19th century, the independence movements of the early 20th century and the formation of newly independent polities at midcentury; processes of political and economic development; significant issues in South Asia’s international politics, including India-Pakistan relations, Kashmir, the foreign policies of regional actors, nuclear proliferation, Afghanistan’s long war, ethnic conflict, transnational terrorism, and U.S. foreign policy in the region. Recommended Preparation: POLI 260 and (POLI 280 or POLI 281).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56363", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 489", "Name": "Selected Topics in International Relations", "Credits": "3", "Description": "Study of a particular topic in international relations. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56364", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "POLI 490", "Name": "Political Violence", "Credits": "3", "Description": "This course examines the causes, character, and consequences of political violence as opposed to interstate war. We will ask why political violence occurs in one location and at a particular time. What structural conditions make political violence likely? How do agents contribute to violence? What are the patterns of political violence? How problems of collective action are resolved in the conduct of violence? How do competing groups and states respond? What conditions make peace likely? Recommended Preparation: POLI 385 and POLI 388 ", "Grading": "Graded", "Course ID": "100971", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade of ‘C” or higher"}, {"Course": "POLI 492", "Name": "Contemporary American Foreign Policy", "Credits": "3", "Description": "This course is designed for students with a basic understanding of foreign policy and the foreign policy apparatus in the United States. The course examines present-day issues that confront the United States in the foreign policy arena. Students will explore American foreign policy as it relates to other key states in world politics. Group work and class participation will be an integral part of the course. Recommended Preparation: POLI 280 and junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56365", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 499", "Name": "Selected Topics in American Foreign Policy", "Credits": "3", "Description": "Study of a particular topic within the area of foreign policy. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56367", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Cit Educ In Inter Relat, Foreign Policy, Amer Defense Policy"}, {"Course": "PSYC 100", "Name": "Introduction to Psychology", "Credits": "4", "Description": "Introduction to the basic concepts of psychology. Emphases on interpretation of psychological data, biological bases of behavior, perception, learning, individual differences, personality, behavior pathology and social psychology. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56460", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 100H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "PSYC 100H", "Name": "Introduction to Psychology - Honors", "Credits": "4", "Description": "Introduction to the basic concepts of psychology. Emphases on interpretation of psychological data, biological bases of behavior, perception, learning, individual differences, personality, behavior pathology and social psychology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56461", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 100 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "PSYC 200", "Name": "Child Developmental Psychology", "Credits": "3", "Description": "The study of age-related cognitive, social and emotional behavior focusing on theories of development during infancy and childhood. This course is recommended for students planning to teach in elementary or secondary schools.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56464", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 205", "Name": "Before We Were Born", "Credits": "3", "Description": "A multidisciplinary analysis of prenatal human development, including psychological and biological theories of human development; neural development; prenatal behavior, perception and learning; developmental and genetic disorders; effects of maternal conditions on prenatal development.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56466", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PSYC 210", "Name": "Psychology of Learning", "Credits": "3", "Description": "Basic problems in the psychology of learning: reinforcement and patterns of reinforcement, extinction, generalization and discrimination, verbal learning, transfer of training, retention and forgetting, and concept learning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56467", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 210H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 210H", "Name": "Psychology of Learning", "Credits": "3", "Description": "Basic problems in the psychology of learning: reinforcement and patterns of reinforcement, extinction, generalization and discrimination, verbal learning, transfer of training, retention and forgetting, and concept learning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100346", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 210 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete PSYC 100 with a ‘C’ or better."}, {"Course": "PSYC 215", "Name": "Paraprofessionals in the Residential Community", "Credits": "3", "Description": "This course is for students who are paraprofessionals in the Residential Life Office. The course will examine developmental tasks and critical issues facing college students. College student development theory, helping and peer counseling skills, examination of personal ethics and responsibility, conflict resolution and group development will be the focus of this course. Note: This course requires special permission from the Residential Life Office for registration.", "Grading": "Graded", "Course ID": "56468", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "PSYC 216", "Name": "Foundations of Leadership Development", "Credits": "3", "Description": "This course is designed to help develop effective, ethical leaders. The principles and practices of leadership will be addressed, incorporating opportunities to implement what is learned. It is a highly interactive course that requires extensive in-class discussion. The main goals are to help students better understand themselves, develop intercultural competence, communicate effectively in group settings, develop an ethical decision-making process, value civic engagement and actively apply leadership skills.", "Grading": "Graded", "Course ID": "50065", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 216 ", "Prerequisite/Corequisite": "You must complete PSYC 100 with a C or better."}, {"Course": "PSYC 230", "Name": "Psychology and Culture", "Credits": "3", "Description": "Building on students’ familiarity (from PSYC 100) with basic concepts and research methods in contemporary American psychology, this course explores the ways in which these ideas are related to cultural variation, both internationally and within the United States. The findings of cross-cultural research are examined in four major fields of psychology: cognitive, developmental, personality and social. Implications are considered for interpretation of personal experience and for applications of psychology in professional practice and public policy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56470", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 230H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 230H", "Name": "Psychology and Culture - Honors", "Credits": "3", "Description": "Building on students’ familiarity (from PSYC 100) with basic concepts and research methods in contemporary American psychology, this course explores the ways in which these ideas are related to cultural variation, both internationally and within the United States. The findings of cross-cultural research are examined in four major fields of psychology: cognitive, develop- mental, personality and social. Implications are considered for interpretation of personal experience and for applications of psychology in professional practice and public policy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100329", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PSYC 230 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "PSYC 255", "Name": "Psychology of the Black Experience in the United States", "Credits": "3", "Description": "A survey of selected psychological theories and research pertaining to black people. Includes an introduction to black psychology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50001", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "AFST 255, SOWK 255 "}, {"Course": "PSYC 285", "Name": "Abnormal Psychology", "Credits": "3", "Description": "Mental, emotional and personality disorders. Classification of abnormal behavior, its causes and treatment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56475", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 292", "Name": "Special Topics in Psychology", "Credits": "1", "Description": "Students should refer to the course description(s) appearing in the Schedule of Classes. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56476", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 300", "Name": "Psychology Takes on the Media", "Credits": "3", "Description": "This survey course will deconstruct the ways that psychological issues, causes, interventions, and treatments are presented in some of today’s most popular shows. It is designed to introduce you to how psychology and psychological science are integral to all of our lives, debunk some of the incorrect ways it’s portrayed in media, but also provide examples of when TV and streaming get it right. Throughout we’ll also attend to the ways that media represent narratives about race, culture, mental health, gender, and other forms of diversity that impact attitudes, beliefs and behaviors. We’ll also touch on the ways that psychology is used to influence our interest in watching particular shows. Additionally, we will discuss careers in psychology, psychological careers in the entertainment industry, and accurate depictions of these psychologists in real life situations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102914", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete ANTH 101, MCS 101, PSYC 100, PSYC 100H, or SOCY 101 with a grade of ‘C’ or better."}, {"Course": "PSYC 304", "Name": "Adolescent Psychology", "Credits": "3", "Description": "Concerned with the period of human development from puberty to maturity. Topics include theoretical perspectives, cross-cultural differences, physiological growth and cognitive development, selected social issues and selected problem areas, including drug abuse, sexual behaviors and delinquency. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56479", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed PSYC 100 and one other PSYC course both with a ‘C’ or better."}, {"Course": "PSYC 305", "Name": "Children with Exceptionalities", "Credits": "3", "Description": "This course will examine development and behavior of various types of children with exceptionalities. Consideration is given to children with intellectual and developmental disabilities, autism spectrum disorders, learning disabilities, attention deficit/hyperactive disorders, emotional and behavioral disorders, communication, language, and speech disorders, children who have special gifts and talents, are deaf or hard of hearing, are visually impaired, and children with physical disabilities, health impairments, and multiple disabilities.", "Grading": "Graded/Pass Fail", "Course ID": "56480", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PSYC 100 and either (PSYC 200 or PSYC 306) both with a grade of ‘C’ or better."}, {"Course": "PSYC 306", "Name": "Lifespan Human Development", "Credits": "3", "Description": "This course is an introduction to human development through the lifespan. The course is designed for both allied health and psychology majors covering the theoretical perspectives and empirical research on development from the prenatal period through senescence, with consideration of practical implications. Issues in physical, social, cognitive and affective development are examined at every age. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website. (Fall/Spring/Summer)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50066", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete PSYC 100 with a ‘C’ or better before you can enroll in this course."}, {"Course": "PSYC 307", "Name": "Psychology of Aging", "Credits": "3", "Description": "An examination of psychological changes associated with aging. Topics include physiological, cognitive, affective, behavioral and social changes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56481", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PSYC 100 and one other PSYC course both with a ‘C’ or better."}, {"Course": "PSYC 308", "Name": "Child Maltreatment", "Credits": "3", "Description": "Psychological aspects of child maltreatment will be covered. Issues to be discussed include history, definitions, causes and correlates, prediction, treatment, prevention and developmental effects of abuse of children.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56482", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PSYC 100 and either (PSYC 200 or PSYC 285 or PSYC 306) both with a grade of ‘C’ or better."}, {"Course": "PSYC 309", "Name": "Psychology: Exploring the Discipline and Careers", "Credits": "3", "Description": "This course develops the conceptual and methodological skills necessary for success in the Psychology major, including an understanding of the breadth and scientific basis of the discipline, critical reasoning skills, information literacy, quantitative reasoning, ethical and social awareness, and basic writing skills in the discipline. Students will learn about the generalizable skills acquired via the Psychology major and their applicability to a variety of career paths; the importance of academic planning; and availability of co-curricular experiences, research and support resources.", "Grading": "Graded", "Course ID": "102414", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PSYC 100  and ENGL 100  all with ‘C’ or better."}, {"Course": "PSYC 310", "Name": "Psychology: Exploring the Discipline and Careers", "Credits": "3", "Description": "Intended for newly-declared Psychology majors with 45+ credits and at least two PSYC  courses beyond PSYC 100 , this course develops the conceptual and methodological skills necessary for success  in the Psychology major, including an understanding of the breadth and scientific basis of the discipline, critical reasoning skills, information literacy, quantitative reasoning, ethical and social awareness, and basic writing skills in the discipline.  Students will learn about the generalizable skills acquired via the Psychology major and their applicability to a variety of career paths; the importance of academic planning; and availability of co-curricular experiences and support resources.  Note: Students cannot receive credit for both PSYC 211 and PSYC 310, cannot be used as upper-level PSYC elective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "001038", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 100, PSYC 100, two additional courses in PSYC all with grade of ‘C’ or better and at least 45 credits."}]