[{"Course": "PHED 201", "Name": "Varsity Sports", "Credits": "1", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "56001", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Var Sports - Volleyball, Vars Sports-Tennis, Vars Sports-Indoor Track, Varsity Sports-Track, Tennis, Vars Sports-Swimming, Var Sports Basketball, Var Sports Assistant, Track, Vars Sports-Basketball, Var Sports-Outdoor Track, Vars Sports-Sports Med, Var Sports Tennis, Var Sports Cheerleading, Cross Country, Softball, Sports Medicine, Golf, Var Sports-Cr Country, Vars Sports - Club Rugby, Var Sports Volleyball, Var Sports Soccer, Var Sports Softball, Cheerleading, Volleyball, Assistant, Varsity Sports-Tennis, Vars Sports-Cheerleaders, Var Sports Baseball, Basketball, Baseball, Vars Sports-Baseball, Varsity Sports/Assistant, Var Sports Track, Var Sports Golf, Lacrosse, Vars Sports-Assistant, Vars Sports-Gymnastics, Var Sports Swimming, Var Sports Sports Med, Var-Sports Fld Hockey, Varsity Sports-Soccer, Vars Sports-Lacrosse, Var Sports-Fld Hockey, Var Sports Cross Country, Var Sports Lacrosse, Soccer, Swimming, Field Hockey"}, {"Course": "PHED 202", "Name": "Introduction to Health Behaviors", "Credits": "3", "Description": "This course will provide the student with an opportunity to study and apply the principles of social and behavioral sciences to health. Emphasis will be placed on examining relationships between human behavior and subsequent health outcomes. This is a required course for incoming student-athletes. (As per NCAA requirements, this course is open to varsity student athletes only.) Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56002", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHED 249", "Name": "Advanced Sailing", "Credits": "1", "Description": "Designed to expose students to the world of sailboat racing and cruising. This course includes such topics as advanced sail trim, spinnaker sailing, racing tactics, basic navigation, right-of-way rules and anchoring techniques. This course is repeatable. Recommended Preparation: PHED 149. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "56003", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHYS 100", "Name": "Ideas in Physics", "Credits": "3", "Description": "A one-semester, general-interest course for the non-science major, introducing concepts of classical physics such as mechanics, electromagnetism, thermo-dynamics and optics, along with how a physicist views the world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56120", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 100H, PHYS 100Y ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 100H", "Name": "Honors Ideas In Physics", "Credits": "3", "Description": "A one-semester, general-interest course for the non-science major, introducing concepts of classical physics such as mechanics, electromagnetism, thermo-dynamics and optics, along with how a physicist views the world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100115", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 100, PHYS 100Y ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 100Y", "Name": "Ideas in Physics", "Credits": "4", "Description": "A one-semester, general-interest course for the non-science major, introducing concepts of classical physics such as mechanics, electromagnetism, thermo-dynamics and optics, along with how a physicist views the world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100156", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHYS 100, PHYS 100H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 101", "Name": "Ideas in Modern Physics", "Credits": "3", "Description": "A one-semester, general interest course for the non-science major, introducing concepts of modern physics such as relativity, quantum mechanics, and atomic and nuclear physics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56121", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 101H ", "Attributes": "Science (non-lab) (GFR)"}, {"Course": "PHYS 101H", "Name": "Ideas in Modern Physics", "Credits": "3", "Description": "A one-semester, general interest course for the non-science major, introducing concepts of modern physics such as relativity, quantum mechanics, and atomic and nuclear physics. Note: Suitable for students who have taken PHYS 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100218", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 101 ", "Attributes": "Science (non-lab) (GFR)"}, {"Course": "PHYS 105", "Name": "Ideas in Astronomy", "Credits": "3", "Description": "A general-interest course that covers observations, models and theories of the solar system, the stars and the galaxies. Students also will become acquainted with the history of astronomy. Recommended Preparation: Mathematical ability at the level of high school algebra, geometry and trigonometry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56124", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 106", "Name": "Introduction to Astrobiology", "Credits": "3", "Description": "The prospect of extraterrestrial life is considered in the context of the evolution of the Universe and of life on Earth. Course material is taken largely from astronomy, planetology, and biology although the multidisciplinary nature of this topic also requires basic information in chemistry, geology, and physics. While a broad overview is stressed, some topics will be treated in depth. While no formal experience in physics or astronomy is required, some familiarity with basic concepts in astronomy is helpful.", "Grading": "Graded", "Course ID": "56125", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 111", "Name": "Basic Physics I", "Credits": "4", "Description": "Three lectures and one two-hour laboratory period a week. A general physics course intended primarily for students in psychology, biology and health related sciences. Topics include mechanics, heat and sound. Recommended Preparation: High school mathematics, including trigonometry or MATH 150. Note: This course satisfies the minimum requirements of medical and dental schools.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56126", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Science Plus Lab (GEP), Science Plus Lab (GFR)"}, {"Course": "PHYS 112", "Name": "Basic Physics II", "Credits": "4", "Description": "Continuation of PHYS 111. Topics include electricity, magnetism, optics and modern physics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56127", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Science Plus Lab (GEP), Science Plus Lab (GFR)", "Prerequisite/Corequisite": "You must complete PHYS 111  with a ‘C’ or better."}, {"Course": "PHYS 121", "Name": "Introductory Physics I", "Credits": "4", "Description": "This course emphasizes classical mechanics. Topics include force, particle kinematics and dynamics, equilibrium, Newton’s laws of motion and gravitation, rotational motion, collisions, momentum, energy and conservation laws. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56129", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHYS 121H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete MATH 151 or MATH 151H with a “C” or higher or be concurrently enrolled in MATH 151 or MATH 151H."}, {"Course": "PHYS 121H", "Name": "Introductory Physics I - Honors", "Credits": "4", "Description": "This course emphasizes classical mechanics. Topics includes force, particle kinematics and dynamics, equilibrium, Newton’s laws of motion and gravitation, rotational motion, collisions, momentum, energy and coservation laws. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56130", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHYS 121 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "PHYS 122", "Name": "Introductory Physics II", "Credits": "4", "Description": "This course emphasizes electricity, magnetism, heat and thermodynamics. Topics include Coulomb’s law, Gauss’s law, electric fields and electric potential, currents, simple circuits and Kirchhoff’s laws, generation of magnetic fields by charges in motion, electromagnetic induction, magnetic materials, oscillatory circuits, temperature, heat and the laws of thermodynamics. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56131", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHYS 122H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete (MATH 152 or MATH 152H) and (PHYS 121 or PHYS 121H) both with a grade of C or better MATH 152 or MATH 152H can be taken concurrently."}, {"Course": "PHYS 122H", "Name": "Introductory Physics II", "Credits": "4", "Description": "This course emphasizes electricity, magnetism, heat and thermodynamics. Topics include Coulomb’s law, Gauss’s law, electric fields and electric potential, currents, simple circuits and Kirchhoff’s laws, generation of magnetic fields by charges in motion, electromagnetic induction, magnetic materials, oscillatory circuits, temperature, heat and the laws of thermodynamics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100116", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "PHYS 122 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "PHYS 122L", "Name": "Introductory Physics Laboratory", "Credits": "3", "Description": "This lab course is based on the physical phenomena associated with the PHYS 121-PHYS 122 lecture-course sequence. The laboratory includes planning a measurement, setting up and working with equipment, and recording data. Students will learn to analyze data, compare theory with experiment, and estimate and report errors. Students will learn to present results in a complete, concise, and clearly written report. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56132", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H with a grade of C or higher or be concurrently enrolled in PHYS 122 or PHYS 122H."}, {"Course": "PHYS 220", "Name": "Introduction to Computational Physics", "Credits": "3", "Description": "An introduction to the computational software packages MATLAB and Mathematica,with particular emphasis on their use in solving physics problems and analyzing experimental data taken in physics laboratory experiments. Applications to problems in mechanics, electromagnetics and wave propagation will be stressed. The course will end with a comparison of the strengths and limitations of these languages and a compiled language such as C. (Spring)", "Grading": "Graded", "Course ID": "56136", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed PHYS 122 or MATH 152 and CMSC 104 or CMSC 201 all with a grade of C or better."}, {"Course": "PHYS 224", "Name": "Vibrations and Waves", "Credits": "3", "Description": "This course emphasizes vibrations, wave motion and optics. Topics include mathematical characterization of vibrations and waves, sound, superposition of standing waves, geometrical and physical optics, diffraction, interference and polarization of light. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56138", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H. with a ‘C’ or better."}, {"Course": "PHYS 299", "Name": "Directed Research", "Credits": "1", "Description": "Laboratory or theoretical investigation conducted in consultation with a faculty member. Registration with the consent of the faculty member with whom the research is to be carried out. One credit hour is equal to a minimum of three hours of work per week. Grading method must be approved by the faculty member prior to the start of the semester. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "101950", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122L  and PHYS 224 with a ‘C’ or better."}, {"Course": "PHYS 303", "Name": "Thermal and Statistical Physics", "Credits": "3", "Description": "Thermodynamic description of systems and statistical interpretation of thermodynamic quantities. The first and second laws of physics, temperature, entropy and thermodynamics, and their relationship to a statistical description of many-particle systems. Applications to magnetic systems, gases and liquids, and radiation are discussed. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56140", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324 and MATH 251 both with a grade of ‘C’ or better."}, {"Course": "PHYS 304", "Name": "Fundamentals of Astrophysics", "Credits": "3", "Description": "TThis course presents a calculus-based introduction to key concepts in astrophysics. The course is designed for science majors with a strong interest in physics and astrophysics.  The course details some of the primary physics concepts relevant to astrophysics and serves as an advanced survey of topics in modern astrophysics, including: stellar structure and evolution, exoplanets, galaxies and interstellar medium, and basic cosmology.", "Grading": "Graded/Audit", "Course ID": "56141", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324  with a grade of ‘C’ or better."}, {"Course": "PHYS 315", "Name": "Galaxies and the Interstellar Medium", "Credits": "3", "Description": "The formation, structure and dynamics of normal galaxies, dark matter, the evolution of elliptical and spiral galaxies, quasars, radio galaxies and active galaxies. Theoretical models will be compared to observations in radio, IR, optical, X-ray and gamma-rays.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56147", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H with a ‘C’ or better."}, {"Course": "PHYS 320L", "Name": "Electronics for Scientists", "Credits": "4", "Description": "A basic lecture and laboratory course in electronics. Properties of semiconductor devices and their combinations in amplifiers, oscillators, timers, switching circuits, digital circuits and electronic instruments in common use in the scientific laboratory. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56149", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H and PHYS 122L with a ‘C’ or better."}, {"Course": "PHYS 321", "Name": "Intermediate Mechanics", "Credits": "3", "Description": "An intermediate course in classical mechanics, including linear and nonlinear oscillations, dynamics of a system of particles, rigid body motion, planetary dynamics, accelerated reference frames, LaGrange’s equations, normal coordinates and vibrating strings. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56150", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 224 and MATH 221 and MATH 225 all with a grade of ‘C’ or better."}, {"Course": "PHYS 324", "Name": "Modern Physics", "Credits": "3", "Description": "The breakdown of classical physics, special relativity, quantum mechanics and atomic structure, solid-state, nuclear and elementary-particle physics. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56153", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 224 with a grade of ‘C’ or better."}, {"Course": "PHYS 330L", "Name": "Optics Laboratory", "Credits": "3", "Description": "A laboratory course in optics and spectroscopy, which includes experiments on reflection, refraction, diffraction, interference, polarization, atomic spectra, interferometers and the properties of lasers. Important physical constants such as the Rydberg constant and the speed of light are measured. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56155", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete PHYS 122L and PHYS 224 with a ‘C’ or better."}, {"Course": "PHYS 333", "Name": "Applied Physics in Archaeology and Art", "Credits": "3", "Description": "This course will demonstrate how physics is utilized to locate and date archaeological objects to determine their place of origin and to reconstruct ancient technologies. Topics in physics will be introduced at an elementary level and developed to the necessary sophistication. Recommended Preparation: At least junior standing, mathematical ability at the level of high school algebra and geometry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56157", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "PHYS 335", "Name": "Physics and Chemistry of the Atmosphere", "Credits": "3", "Description": "A first course in the physical and chemical principles that led to the formation of the Earth’s atmosphere, its structure and processes. Atmospheric composition and structure. Concepts of pressure, density, thermodynamics and radiative energy balance. Atmospheric motions and major circulations. Major chemical cycles in the atmosphere and elementary atmospheric chemical reactions. Modifications of the atmospheric chemical structure - the greenhouse effect, acid rain and toxic chemicals. Air pollution meteorology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56158", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H with a ‘C’ or better."}, {"Course": "PHYS 402", "Name": "Nuclear Physics", "Credits": "3", "Description": "An introduction to the structure of nuclei and the interaction between subnuclear particles. Topics include radioactivity, nuclear reactions, nuclear forces, models of nuclear structure, the classification and interactions of elementary particles, and experimental techniques.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56162", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324 with a ‘C’ or better."}, {"Course": "PHYS 403", "Name": "Solid State Physics", "Credits": "3", "Description": "An introductory course in solid state physics. Topics include crystal structures and lattice vibrations, free electron gas, energy bands, insulators, semiconductors and metals, superconductivity and magnetism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56163", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete PHYS 324 and PHYS 303 with a ‘C’ or better."}, {"Course": "PHYS 405", "Name": "Stellar Astrophysics", "Credits": "3", "Description": "An advanced survey of the formation and evolution of stars that stresses the underlying physics. Topics include Jeans theory of star formation, nuclear processes, radiative and convective energy transfer in the stellar atmosphere. Also included is a study of phases of advanced evolution that include, pulsation, mass loss, and supernovae, stellar remnants (white dwarfs, neutron stars, black holes), binary stars, mass transfer, and structure of the accretion disk.", "Grading": "Graded", "Course ID": "100304", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324  with a grade of ‘C’ or better."}, {"Course": "PHYS 406", "Name": "Extragalactic Astrophysics", "Credits": "3", "Description": "An overview of extragalactic astrophysics. Particular topics include the structure and kinematics of our own galaxy, including the galatic center, the morphological classification scheme for galaxies, the evolution of elliptical and spiral galaxies, the creation and effects of supermassive black holes in the center of galaxies, gravitational lensing due to galaxies and galaxy clusters, the high-redshift Universe, and the study of dark matter and its effect on galaxy and cluster dynamics.", "Grading": "Graded/Audit", "Course ID": "102620", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324 with a ‘C’ or better."}, {"Course": "PHYS 407", "Name": "Electromagnetic Theory", "Credits": "3", "Description": "Vector analysis, electrostatics, dielectric media, electric currents, magnetic fields, electromagnetic induction and magnetic properties of matter. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56164", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 224 and MATH 225 with a ‘C’ or better."}, {"Course": "PHYS 408", "Name": "Optics", "Credits": "3", "Description": "An intermediate course in optics that treats light as an electromagnetic field. Topics include interaction of light and matter, polarization, interference, diffraction, Fourier optics and coherence theory, introduction to guided wave theory and the basics of laser operation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56165", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 224 with a ‘C’ or better."}, {"Course": "PHYS 415", "Name": "Astroparticle Physics", "Credits": "3", "Description": "This course focuses on the examination of the production and detection of high energy radiation and particles from astrophysical sources including x-rays, gamma-rays, and cosmic-rays. The current technological limitations on the spatial, spectral, and timing analysis of these data will be explored. Students will gain hands on experience with real astronomical data obtained from the archival databases of satellite systems and with state-of-the-art astronomical analysis software.", "Grading": "Graded", "Course ID": "56167", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324  with a grade of ‘C’ or better."}, {"Course": "PHYS 416", "Name": "Cosmology", "Credits": "3", "Description": "An advanced study of cosmology, including evidence for the Big Bang and the expanding universe, the very early universe, inflation theories, the formation of light elements in the early universe, and the thermal history of the universe. It will also include a study of the fluctuations of the cosmic microwave background radiation, the development of primordial fluctuations under gravity and the measurement of the cosmological parameters.", "Grading": "Graded", "Course ID": "100305", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324  with a grade of ‘C’ or better."}, {"Course": "PHYS 418", "Name": "Semiconductor Optical Devices", "Credits": "3", "Description": "A lecture and laboratory course in the design, fabrication and testing of semiconductor devices such as p-i-n photodetectors, optical waveguides, optical switches and laser diodes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56168", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Topics": "Optical Devices, Semiconductor Optical", "Prerequisite/Corequisite": "You must complete PHYS 324 with a ‘C’ or better."}, {"Course": "PHYS 424", "Name": "Introduction to Quantum Mechanics", "Credits": "3", "Description": "The breakdown of classical mechanics and the development of quantum theory, the foundations of the Schroedinger equation, the uncertainty principle, quantum systems in one dimension, angular momentum, spin and atomic physics. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56169", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 321 and PHYS 324 and MATH 225 all with a grade of ‘C’ or better."}, {"Course": "PHYS 425", "Name": "Relativistic Physics", "Credits": "3", "Description": "Special relativity, general relativity from a modern viewpoint, the Schwarzschild solution, other solutions of the Einstein field equation, the role of general relativity in astrophysics and an introduction to the unified field theories.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56170", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 321 and PHYS 324 with a ‘C’ or better."}, {"Course": "PHYS 428", "Name": "Integrated Optics and Holography", "Credits": "4", "Description": "A lecture and laboratory course. Design, fabrication and testing of semiconductor and polymer-integrated optical devices such as Mach-Zehnder interferometer, 2x2 coupler/switch and phase modulator. Modeling and construction of holographic experiments such as four-wave mixing and two beam coupling with applications as novelty filters and holographic storage. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56171", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete PHYS 418 with a grade of ‘C’ or better."}, {"Course": "PHYS 430", "Name": "Introduction to Materials", "Credits": "3", "Description": "An introduction to the properties of materials, including crystallography and texture, diffraction and microscopic techniques, plastic deformation of metals, defects in materials diffusion, equilibrium phase diagrams and order-disorder transformation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56172", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 303 and PHYS 324 with a grade of ‘C’ or better."}, {"Course": "PHYS 431L", "Name": "Modern Physics Laboratory", "Credits": "3", "Description": "This is a laboratory course intended for upper-level physics majors. The course will acquaint students with contemporary experimental techniques in physics, with an emphasis on open-ended inquiry, data analysis, and development of technical writing and presentation skills. (Fall/Spring)", "Grading": "Graded", "Course ID": "56156", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete PHYS 324 and PHYS 330L with a grade of ‘C’ or better."}, {"Course": "PHYS 440", "Name": "Computational Physics", "Credits": "3", "Description": "The application of computers and numerical methods to physics models. Boundary value problems, Monte Carlo techniques and modeling.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56175", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Electrodynamics ll", "Prerequisite/Corequisite": "You must complete PHYS 220  and PHYS 321  and PHYS 324  with a grade of ‘C’ or better."}, {"Course": "PHYS 450", "Name": "Special Topics", "Credits": "1", "Description": "A course with a particular faculty member on a topic not covered in the regular curriculum. The arrangements with the faculty member must be made before registration. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56175", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Electrodynamics ll, Satellite Development"}, {"Course": "PHYS 480", "Name": "Techniques in Theoretical Physics", "Credits": "3", "Description": "A course in mathematical physics. Topics include: infinite series, Fourier series, ordinary differential equations, complex variables, integral transforms and partial differential equations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56178", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHYS 481", "Name": "Techniques in Theoretical Physics II", "Credits": "3", "Description": "A course in mathematical physics, complementary to PHYS 480. This course concentrates on the applications of Complex Variables and Probability & Statistics to physics problems. Topics in complex variables covered include: singularities, multi-valued functions, principal branch and branch cuts, differentiability and Cauchy-Riemann equations, Laurent expansions, contour integration and the calculus of residues, analytic continuation and integral transforms. Topics in probability & statistics include: Ensemble averages, the central limit theorem, law of large numbers, random variables, distributions and their moments, sums of random variables.", "Grading": "Graded", "Course ID": "100243", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MATH 221 and MATH 225 and MATH 251 with a grade of ‘C’ or better."}, {"Course": "PHYS 490", "Name": "Senior Seminar", "Credits": "1", "Description": "Research methods, the preparation of project proposals and the specific proposals for a senior project. Recommended Preparation: 90 credits and 3.0 GPA in major courses.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56179", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHYS 499", "Name": "Senior Research", "Credits": "3", "Description": "Laboratory or theoretical investigation in consultation with the faculty that is suitable for advanced students. Registration with the consent of the faculty member with whom the research is to be carried out. One credit hour is equal to a minimum of three hours of work per week. Grading method must be approved by the faculty member prior to the start of the semester. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "56180", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 499H ", "Prerequisite/Corequisite": "You must complete PHYS 122L  and PHYS 324 with a ‘C’ or better."}, {"Course": "PHYS 499H", "Name": "Senior Research", "Credits": "3", "Description": "Laboratory or theoretical investigation in consultation with the faculty that is suitable for advanced students. Registration with the consent of the faculty member with whom the research is to be carried out. One credit hour is equal to a minimum of three hours of work per week. Grading method must be approved by the faculty member prior to the start of the semester. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail", "Course ID": "100219", "Consent": "Instructor Consent Required", "Components": "Lecture", "Course Equivalents": "PHYS 499 ", "Prerequisite/Corequisite": "You must complete PHYS 122L  and PHYS 321  and PHYS 324 with a ‘C’ or better."}, {"Course": "POLI 100", "Name": "American Government and Politics", "Credits": "3", "Description": "An introduction to American national government and politics. An examination of the ideas, institutions and processes that define the American political system. Intended as a first course in political science for both majors and non -majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56226", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": " POLI 100H, POLI 100Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 100H", "Name": "American Government and Politics - Honors", "Credits": "3", "Description": "An introduction to American national government and politics. An examination of the ideas, institutions and processes that define the American political system. Intended as a first course in political science for both majors and non majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56227", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": " POLI 100, POLI 100Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 100Y", "Name": "American Government and Politics", "Credits": "4", "Description": "An introduction to American national government and politics. An examination of the ideas, institutions and processes that define the American political system. Intended as a first course in political science for both majors and non-majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56228", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": " POLI 100, POLI 100H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 200", "Name": "Introduction to Political Science", "Credits": "3", "Description": "An introduction to the science of politics addressing such fundamental problems, ideas and concepts as justice, power, equality, institutional principles and political behavior.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56233", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 205", "Name": "Civic Agency and Social Entrepreneurship", "Credits": "3", "Description": "By building their theoretical knowledge and practical skills, this course empowers and prepares students to work effectively in their communities, social groups and democracy to initiate and achieve social change. Students will analyze and evaluate prevailing ideas about effective citizenship, activism, service and politics, including conventional assumptions about the limits of ordinary citizens’ capacity to become agents of transformation. Students will work in teams to develop strategic plans for social change on campus and beyond.", "Grading": "Graded", "Course ID": "100366", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AMST 205, SOCY 205"}, {"Course": "POLI 209", "Name": "Selected Topics in Political Science", "Credits": "1", "Description": "Study at an introductory level of a particular topic that overlaps two or more areas of political science. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56235", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Mthd & Mtrls Of Research, Civic Imag/Social Entrep, Politics & Religion"}, {"Course": "POLI 210", "Name": "Political Theory", "Credits": "3", "Description": "An introduction to the theoretical issues and debates underlying political practice and policy. By examining works of various political theorists, past and present, Western and non-Western, male and female, students gain insight into key political concepts such as liberty, equality, justice, sovereignty, rights and responsibilities, and citizenship. Emphasis is placed on applying political theories to current political debates.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56236", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 210H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "POLI 210H", "Name": "Political Theory", "Credits": "3", "Description": "An introduction to the theoretical issues and debates underlying political practice and policy. By examining works of various political theorists, past and present, Western and non-Western, male and female, students gain insight into key political concepts such as liberty, equality, justice, sovereignty, rights and responsibilities, and citizenship. Emphasis is placed on applying political theories to current political debates.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100347", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 210 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "POLI 220", "Name": "The Constitution and American Democracy", "Credits": "3", "Description": "This course examines the governing structures established by the Constitution with an emphasis on circumstances leading to the 1787 Constitutional Convention, the logic underlying the basic structure of the document, and how these structures affect the operation of American politics today. Students will consider the degree to which the Constitution supports modern norms of democracy. This is not a course in constitutional law. Recommended Preparation:  POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56237", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 230", "Name": "Introduction to Constitutional Law", "Credits": "3", "Description": "An examination of United States constitutional law by analyzing the leading decisions of the Supreme Court. Emphasis on the critical constitutional doctrines of separation of powers, federalism, tax and commerce power, and judicial review. A few leading cases on civil rights and civil liberties also will be covered. Recommended Preparation: POLI 100 or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56240", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "POLI 233", "Name": "Common Law and Legal Analysis", "Credits": "3", "Description": "This course will introduce students to the origins and basic elements of American Common Law. It also will introduce them to the case analysis method known as briefing. There will be particular emphasis on the development of students’ analytical and writing skills. Recommended Preparation: Sophomore standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56241", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 240", "Name": "State and Local Politics", "Credits": "3", "Description": "An introduction to the structures and political processes of state and local governments in the United States, with particular emphasis on Maryland. Recommended Preparation: Sophomore standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56242", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "POLI 250", "Name": "Introduction to Public Administration and Policy", "Credits": "3", "Description": "This course provides a basic understanding of the theories and practice of public administration: how public organizations are different from private organizations, the political context of public administration, the problems of bureaucratic power and control, organizational theory and personnel management, and core policy and management processes such as regulation and budgeting. Recommended Preparation: Sophomore standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56243", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "POLI 260", "Name": "Comparative Politics", "Credits": "3", "Description": "This introductory course provides a basic understanding of the fundamental concepts in comparative politics. During the semester, students will learn to think critically and analytically about politics. In addition, students will learn about different political systems across the globe and how they function and provide governance to citizens. Recommended Preparation: Sophomore standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56244", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 260Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 260Y", "Name": "Comparative Politics", "Credits": "4", "Description": "This introductory course provides a basic understanding of the fundamental concepts in comparative politics. During the semester, students will learn to think critically and analytically about politics. In addition, students will learn about different political systems across the globe and how they function and provide governance to citizens. Recommended Preparation: Sophomore standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102668", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 260 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 270", "Name": "Culture and Politics", "Credits": "3", "Description": "An introduction to the relationships among politics, culture and human diversity throughout the world. Can cultures and human diversity be judged by independent standards of justice? When does cultural diversity endanger political unity? Must religious nationalism endanger, and can secularism protect, cultural diversity?", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56232", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "POLI 280", "Name": "International Relations", "Credits": "3", "Description": "This course is an introduction to the theory and practice of international relations. Students are taught the basic concepts, main theoretical approaches, and major issues in the study of world politics. The central purpose of the course is to help students develop the conceptual tools and analytical skills necessary for explaining international affairs. Students who choose to take POLI 280 MAY NOT subsequently enroll in POLI 281 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56245", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 280H ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 280H", "Name": "International Relations", "Credits": "3", "Description": "This course is an introduction to the theory and practice of international relations. Students are taught the basic concepts, main theoretical approaches, and major issues in the study of world politics. The central purpose of the course is to help students develop the conceptual tools and analytical skills necessary for explaining international affairs. Note: Students who choose to take POLI 280 may not subsequently enroll in POLI 281.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100343", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 280 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "POLI 281", "Name": "International Relations (w/ writing focus)", "Credits": "3", "Description": "This course is an introduction to the theory and practice of international relations. Students are taught the basic concepts, main theoretical approaches, and major issues in the study of world politics. The central purpose of the course is to help students develop the conceptual tools and analytical skills necessary for explaining international affairs. This course offers the same content as POLI 280; however, it is designed as a ‘writing-intensive’ version of the course. Note: Students who choose to take POLI 281 may not subsequently take POLI 280.", "Grading": "Graded", "Course ID": "100547", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "POLI 300", "Name": "Quantitative Analysis in Political Science", "Credits": "4", "Description": "The primary objective of this course is to help students understand and evaluate the kinds of quantitative information presented in tables, graphs, and statistics in political science textbooks and articles that are commonly invoked in debates concerning public affairs and public policy. It also helps develop students’ own research skills. It focuses particularly on survey research on public opinion and voting behavior. Recommended Preparation: POLI 100 plus MATH 106 or a score on the LRC algebra placement exam suitable for a general education MATH course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56247", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 301", "Name": "Research Methods in Political Science", "Credits": "3", "Description": "This course focuses on the preparation of research designs, consideration of quantitative versus qualitative methods, problems of inference and causality, development of cases, and the uses of statistics. The primary objective is to develop students’ research capabilities. Recommended Preparation: POLI 100 plus sophomore standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56248", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "POLI 304", "Name": "Community Research", "Credits": "3", "Description": "This course will involve undergraduate students in a team-based project to generate field research findings useful to a government or non-profit client/partner. The policy areas to be researched will include environment, health, housing, poverty, and urban development, among others. Team participants will include teaching and research faculty and staff, advanced graduate students, and a Sondheim Program-based Peaceworker. Undergraduates will contribute to the research design and to the preparation of the research findings, and will conduct extensive field research. They will build practical research skills and engage with members of local communities. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "100236", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AMST 304, GES 304, PUB 304"}, {"Course": "POLI 309", "Name": "Selected Topics in Political Science", "Credits": "3", "Description": "Study of a particular topic that overlaps two or more areas of political science. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56250", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Business-Gov Relations, Politics Of Citizenship, Maryland Politics, Gender& Nationalism, Knowledge & Responsibility, Pol Of Race and Gender, Intelligence and National Security, Young Voters & the Future of American Democracy, Chinese Politics"}, {"Course": "POLI 310", "Name": "Political Theories of Democracy", "Credits": "3", "Description": "Examines the works of various political theorists, past and present, Western and non-Western, male and female, on thee nature, justification, and practice of democracy. Themes explored include liberty, equality, rights, participation, citizenship, institution, knowledge, and deliberation. Emphasis is placed on applying political theories to current political debates. Recommended Preparation: POLI 210 or another POLI course in political theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56251", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 315", "Name": "Political Theories of Justice", "Credits": "3", "Description": "Examines the various theories of justice underlying political practice, policy, and law through the works of political theorists, past and present, Western and non-Western, male and female. Emphasis is placed on applying political theories of justice to current political debates. Recommended Preparation: POLI 210 or another POLI course in political  theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56255", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "POLI 317", "Name": "American Political Development", "Credits": "3", "Description": "This course examines the development of the American political system through a historical lens. The course uses theories of American political culture and ideology to frame particular policy areas through historical time periods from the early 1800s to the early 2000s.", "Grading": "Graded", "Course ID": "100319", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 317"}, {"Course": "POLI 318", "Name": "United States Constitutional History", "Credits": "3", "Description": "A survey of Constitutional history from the founding of the English colonies in North America until the present. The class focuses in particular on the Enlightenment and Common Law roots of the United States Constitution, debates over the scope of federal power, the role of slavery and freedom in constitutional debates, and the rising pressure to expand civil rights and responsibilities for all citizens.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100320", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 318"}, {"Course": "POLI 319", "Name": "Selected Topics in Political Theory", "Credits": "1", "Description": "Examines a particular topic, problem, or issue from the perspective of political theory. Recent examples include Founding Feminisms and Nineteenth Century Feminisms. Emphasis is placed on applying political theories to current political debates. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation:  POLI 210 or another POLI course in political theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56256", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Slavery In Westrn Poli, Equality, Utopian Thry & Scnce Fic, “equality”, Race, Gender & Democracy, Tocqueville’s Amer. Film, Eastern Political Thought, Founding Feminisms, Nineteenth Century Feminism, Mod Human Rights/Trafficking"}, {"Course": "POLI 320", "Name": "American Political Thought", "Credits": "3", "Description": "Investigates in detail key theoretical arguments and controversies that have shaped our country by carefully studying the contributions of a variety of American thinkers. Emphasis is placed on applying American political theories to current political debates.  Recommended Preparation: POLI 210  or another POLI course in political theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56257", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 321", "Name": "Public Opinions", "Credits": "3", "Description": "This course investigates the subject of American public opinion. It will focus on the following questions: what is public opinion, and  what does it mean when the ‘people speaks?’ How do democratic citizens form these political judgements? Are citizens capable of fulfilling the expectations of democratic theory, such that they can exert ‘appropriate’ control over the political process? Can citizens’ opinions be manipulated? Under what conditions do politicians respond to the will of the electorate? By investigating key theoretical and empirical developments in the scholarship of public opinion, we will return to these central questions with special attention to a set of normative concerns. Foremost of these is whether citizens are capable of behaving in accordance with traditional notions of democratic governance. Recommended Preparation:  POLI 301 ", "Grading": "Graded", "Course ID": "102698", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 323", "Name": "The Presidency", "Credits": "3", "Description": "This course examines the U.S. presidency as a highly idiosyncratic, rapidly evolving political institution. The focus will be on the contemporary presidency, with specific attention paid to subtopics, including the study and assessment of the presidency and presidents; constitutional design, presidential power and leadership; campaigns and elections; public opinion, media and the rhetorical presidency; structural organization of the White House, executive office of the president and the executive branch; relations with Congress and the bureaucracy; and the president’s role in domestic, economic and budgetary policies. Recommended Preparation: Junior standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56259", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 324", "Name": "The Congress", "Credits": "3", "Description": "This course examines the contemporary U.S. Congress, with a constant eye toward the paradoxes that define, and dilemmas that face, the institution and its members. The course focuses on a single theme with wide-reaching implications, namely the tension between the representative Congress as the collection of individual members with idiosyncratic, local, divergent needs and the lawmaking Congress as a collective body with shared, national, convergent responsibilities. Recommended Preparation: Junior standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56260", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 325", "Name": "Political Parties and Elections", "Credits": "3", "Description": "A theoretical and comparative examination of the electoral process, with special attention to American politics. Consideration of electoral methods, party organization, party systems, candidate selection and voter behavior. Recommended Preparation: Junior standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56261", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 326", "Name": "Media & Politics", "Credits": "3", "Description": "In this course, students examine the ways in which 21st-Century media institutions have transformed— and been transformed by—contemporary American politics. Subjects of study include theories of the press as they relate to the effective functioning of modern democracy. Students examine changes in the organizational structures and functions of media institutions and political institutions over time, and trace the effects of these developments to changes in the substance of contemporary political media content. Recommended Preparation: ENGL 100 ", "Grading": "Graded", "Course ID": "102787", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MCS 326 "}, {"Course": "POLI 327", "Name": "Interest Groups and Lobbyists", "Credits": "3", "Description": "This course examines the significance of organized interests and lobbying behavior on national policy. Specific topics include a history of lobbying and interest-group activity; the nature of representation; collective action and collective action dilemmas; membership, recruiting and fundraising; the structure and organization of interest groups; interest-group objectives and activities; tactics, information, access and influence of groups in lobbying Congress, the president, courts and the bureaucracy; campaign financing and political action committees; regulation of lobbying and campaign activities; and the impact of groups on policy outcomes. Recommended Preparation: Sophomore standing or POLI 100.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56262", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 328", "Name": "Women, Gender, Sexuality, and Political Power in the U.S.", "Credits": "3", "Description": "This course analyzes the relationship between gender, politics, and policy primarily in the United States understood in a cross-cultural context. It examines the theoretical and historical construction of “women” as a group and the impact of gender and sexuality on citizenship, election, political office, and public policy. The intersection of gender, class, race, ethnicity, sexual orientation, and other identities provides an important theoretical frame through which political debates will be analyzed. Recommended Preparation: One course each in POLI and GWST, or one cross-listed POLI/GWST course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50129", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 328 "}, {"Course": "POLI 330", "Name": "Mock Trial", "Credits": "1", "Description": "This course is for compering members of the Mock Trial Team to receive academic credit for their extracurricular work. Students will be expecting to attend regular practice sessions, complete weekly assignments, and compete at outside tournaments. Students will utilize the case materials provided by the American Mock Trial Association (AMTA) to learn about the trial advocacy process and participate in extracurricular competition.  This course is repeatable for credit. Students may complete a maximum of 4 credits. Recommended Preparation: One GEP Social Science or Humanities Course", "Grading": "Graded/Pass Fail", "Course ID": "102699", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 331", "Name": "Moot Court", "Credits": "1", "Description": "This course is open to students who join the UMBC Moot Court team. Students will attend a tournament to argue a fictitious Supreme Court case. Students will be graded on their research on the case and participation in team events. No prior speech or debate experience is necessary. This course is repeatable for credit. Students may complete a maximum of 4 credits. Recommended Preparation: POLI 230 ", "Grading": "Graded", "Course ID": "102697", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 334", "Name": "Judicial Process", "Credits": "3", "Description": "This course is designed to give the student an introduction to the way in which the American court system operates. Students will learn the elements of the formal judicial process by briefing and discussing court decisions. Recommended Preparation: Junior standing or POLI 233.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56264", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 337", "Name": "Comparative Justice", "Credits": "3", "Description": "This course will examine public law systems across a spectrum of nations and in several international tribunals. We will compare the structure, powers and role of national and international courts as well as the varied meanings of justice and rights. This analysis will be conducted using cases from the courts in our study, as well as by reading scholarly and journalistic reports on the topics discussed. Recommended Preparation: Any 200-level POLI course or junior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56265", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100  or equivalent with a ‘C’ or better."}, {"Course": "POLI 338", "Name": "Women, Gender, and Law", "Credits": "3", "Description": "This course examines how American civil and criminal legal systems shape gender and identity. It explores gender and intersectional identities in society and the historical development of women’s citizenship and legal rights. Using case law as the primary text, the course focuses on statutory remedies to discrimination in employment and education, reproduction and personal life, and the response of criminal law to domestic violence, rape, and sex work. Recommended Preparation: One prior course in Political Science or Gender and Women’s Studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50109", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 338 "}, {"Course": "POLI 339", "Name": "Legal Advocacy", "Credits": "3", "Description": "This course instructs students in various methods of legal and political advocacy. Each year the American Mock Trial Association distributes complete case materials. Using these materials students study the law of the case, the law of evidence, civil or criminal procedure and strategic methods for implementing these rules. This course will provide students with: (1) knowledge of trial practice and the judicial process; (2) training in constructing and testing logical arguments; (3) training in thinking and speaking in high pressure situations; (4) training in written advocacy; (5) instruction on the law of evidence; and (6) instruction in various legal areas. Recommended Preparation: POLI 100 or permission of instructor.", "Grading": "Graded", "Course ID": "56266", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 340", "Name": "Problem-Solving in the Urban Black Community", "Credits": "3", "Description": "Urban problems within the Black community. Nature and types of problems, causes (internal and external), effects and remedies. Recommended Preparation: AFST 271 or junior/senior status", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50019", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 436, POLI 440 ", "Same as Offered": "AFST 385 "}, {"Course": "POLI 341", "Name": "Legislative Simulation", "Credits": "1", "Description": "This course teaches legislative skills via active, faculty-supervised involvement in UMBC’s Maryland Student Legislature (MSL) delegation. Students write and debate original legislation, learn parliamentary procedure, and participate in off-campus legislative sessions with college students from around the state. They also gain in-depth knowledge of the Maryland General Assembly. This course is repeatable for credit. Students may complete a maximum of 4 credits or 4 attempts.", "Grading": "Graded", "Course ID": "100556", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete POLI 100."}, {"Course": "POLI 350", "Name": "The Policy-Making Process", "Credits": "3", "Description": "This course examines the actors, circumstances, and political processes associated with enactment of American public policy. It emphasizes strategies advocates use to influence public policy, as well as other factors that facilitate or inhibit policy change. The course uses these lessons to analyze and explain the state of policy and political debate on contemporary domestic policy issues.  Recommended Preparation: POLI 100 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56271", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 352", "Name": "Administrative Law", "Credits": "3", "Description": "The principles and practices of administrative law in the United States. Topics include legislative and executive control of administrative action, processes of administrative decision-making, the informal administrative process and governmental tort liability. Recommended Preparation: Junior standing and one of POLI 100, POLI 233 or POLI 250.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56273", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 353", "Name": "Governmental Budgeting and Financial Administration", "Credits": "3", "Description": "The course begins with an overview of how governments acquire money through taxation and debt and comply with balanced budget and related constraints. It proceeds to the study of how governments spend money. Among the topics covered are budget analysis methods, the institutional structure of the budget process, political strategies for budgetary competition, performance budgeting, management, budgeting for infrastructure and economic development, and contracting with private providers of public services. Recommended Preparation: Junior standing or POLI 250.", "Grading": "Graded", "Course ID": "56274", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "POLI 354", "Name": "Public Management and Personnel Systems", "Credits": "3", "Description": "This course explores how government agencies are led and managed. It will introduce the student to the concepts and theories of public employment, the practice of human resource management, and current issues of importance in the field of public sector human resource management. Concepts such as leadership, civil service and patronage systems, workforce recruitment, workplace discrimination, and public employee unionization will be discussed among many other issues. A theme throughout the course will be the identification of value conflicts that constantly plague the public manager.  Recommended Preparation: POLI 250.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56275", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "POLI 360", "Name": "Comparative Political Analysis", "Credits": "3", "Description": "Examination of liberal-pluralist, Marxist-radical and conservative-corporatist frameworks as alternative approaches to the study of comparative politics. These approaches represent both ways of interpreting politics, as well as ways of thinking critically about them. There will be case studies of selected countries to test the propositions of the course. Recommended Preparation: Junior standing or POLI 260.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56277", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Social Sciences (GFR)"}, {"Course": "POLI 361", "Name": "Comparative Political Analysis", "Credits": "3", "Description": "The goal of this course is to immerse students in the key theoretical frameworks and analytical methods that dominate the current field of comparative politics. The course is organized by theme, rather than by country or general geographical region. It is intended to be a continuation of POLI 260, where students attained a basic understanding of the fundamental concepts in comparative politics. This course offers the same content as POLI 360 ; however, the two courses offer different assessment methods. Therefore, students who choose to take POLI 361 MAY NOT subsequently take POLI 360 . Recommended Preparation: POLI 260 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102468", "Consent": "No Special Consent Required", "Components": "Lecture"}]