[{"Course": "AFST 100", "Name": "Introduction to The Black Experience", "Credits": "3", "Description": "Understanding the black experience in the African diaspora. A survey of historical and sociocultural ties that link people of African descent worldwide. African roots in world civilizations are discussed. This course is an introductory course for majors and nonmajors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51303", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AFST 100 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AFST 100Y", "Name": "Introduction to The Black Experience", "Credits": "3", "Description": "Understanding the black experience in the African diaspora. A survey of historical and sociocultural ties that link people of African descent worldwide. African roots in world civilizations are discussed. This course is an introductory course for majors and nonmajors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "051303", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AFST 100 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AFST 201", "Name": "Introduction to Methodology and Research in Africana Studies", "Credits": "3", "Description": "An overview of methodologies of basic research, with examples and issues drawn from the sub-fields of Africana studies. Includes an introduction to selected concepts and use of the computer for statistical analysis.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52077", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 205", "Name": "Contemporary Black Popular Culture", "Credits": "3", "Description": "This course examines the folk idiom and current images of black American culture as reflected in the creative works of contemporary black artists in the areas of film, music, sports and language. Examples are drawn from each of these areas to demonstrate the continuity of these images across artistic domains.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51151", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "AFST 206", "Name": "Introduction to African-American History: A Survey", "Credits": "3", "Description": "This course offers a broad survey of the history of the African-American experience from the African background to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50030", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 218"}, {"Course": "AFST 211", "Name": "Introduction to Contemporary Africa", "Credits": "3", "Description": "A survey of contemporary Africa, its geography, peoples and cultural heritage. Economic, cultural, political and social changes on the continent since World War II, including the struggle for independence and the problems of nation-building.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50027", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 242 "}, {"Course": "AFST 212", "Name": "Introduction to African History", "Credits": "3", "Description": "A survey of ancient and medieval kingdoms of Africa, the spread of Islam in Africa, European slave trade, white settler penetration of southern Africa and Arab penetration of East Africa, the colonial conquest, the 20th century and the emergence of nationalist movements seeking independence.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50026", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 243"}, {"Course": "AFST 213", "Name": "Africa: Culture and Development", "Credits": "3", "Description": "This course provides a general introduction to Africa. It is designed to survey its peoples, languages, cultures, societies and development. An emphasis is placed on how language and development are interrelated. Modules are offered to students to build on their special interests in the continent.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50005", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "MLL 210"}, {"Course": "AFST 215", "Name": "Introduction to African Dance", "Credits": "3", "Description": "Course offers an understanding of the role of dance in daily life in African societies. Types of African dance are distinguished; basic movements are identified, and relationship of dance to other African arts is shown.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50006", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "DANC 260"}, {"Course": "AFST 230", "Name": "Comparative African Religions", "Credits": "3", "Description": "An introduction to indigenous religions of Africa. Religions in African traditional society, with special reference to the principal elements in the religious system - the Supreme Being, the cosmic gods, the ancestors and lesser spirits. The impact of Islam and Christianity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50025", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "RLST 230"}, {"Course": "AFST 240", "Name": "Topics in African and African-American Studies", "Credits": "3", "Description": "Examination of current issues highlighting the experiences of blacks in the diaspora. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52078", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 241", "Name": "The Making of the Caribbean", "Credits": "3", "Description": "The course presents a historical analysis of the growth and development of African peoples in the Caribbean and Latin America. The nature and character of African cultural survivors and their impact on the Caribbean, slavery, abolition, colonization, efforts toward federation, independence and contemporary issues will be discussed. Recommended Preparation: AFST 100 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51304", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 245", "Name": "Introduction to Black Music", "Credits": "3", "Description": "A survey of the form and function of music in African and diasporan cultures. General areas to be explored will be music in ritual and ceremony, as transmitter of history and culture, and as a social and political tool.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50014", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "MUSC 215"}, {"Course": "AFST 250", "Name": "Directed Individual Study", "Credits": "3", "Description": "Individual study for an in-depth exploration of a subject. Submission of a written plan and the acceptance of a faculty member for supervision of the study are required. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52079", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "AFST 255", "Name": "Psychology of the Black Experience in the United States", "Credits": "3", "Description": "A survey of selected psychological theories and research pertaining to black people. Includes an introduction to black psychology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50001", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "PSYC 255, SOWK 255"}, {"Course": "AFST 260", "Name": "Black Literature to 1900", "Credits": "3", "Description": "A critical introduction to representative oral and written literature by primarily black writers in the Americas and in Africa, from the earliest times to the end of the 19th century. Attention will be given to ways in which blacks have reflected their changing roles and fortunes in their literature, as well as to perceptions of blacks by other races and cultures as expressed in literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50023", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "ENGL 260"}, {"Course": "AFST 261", "Name": "Black Literature: Twentieth Century", "Credits": "3", "Description": "The development of black literature of the Americas and of Africa in the 20th century. Emphasis on such topics as race pride and consciousness, the Harlem Renaissance, Negritude, the new black consciousness, literature of exile, folk themes in modern writings, interconnections between writers from different regions and hemispheres, and cross-currents between black literature and other literatures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50012", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "ENGL 261"}, {"Course": "AFST 262W", "Name": "Introductory Writing in Africana Studies", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52080", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 263", "Name": "Introduction to Black Drama", "Credits": "3", "Description": "This course is designed to increase the student’s understanding and awareness of black theatre. This includes the history and development of black theatre in America, as well as emphasis on Third-World writers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52081", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 264", "Name": "Introductory Writing in Africana Studies", "Credits": "3", "Description": "An introductory writing course that will teach students to write and speak effectively based on the study and critique of internationally acclaimed works of creative literature from African and the Diaspora. The course permits students to become experts on the content of three short texts written by Nobel Literary Prize winners of African descent. Students will use these three texts as the basis for most of the semester’s writing exercises and will work closely with the course professor to learn and practice a series of new, creative, common sense, and systematic approaches to exploring the component parts of the analytical writing experience. Recommended Preparation: ENGL 100 and AFST 100 ", "Grading": "Graded/Audit", "Course ID": "52082", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 271", "Name": "Introduction to Community Involvement", "Credits": "3", "Description": "A survey of issues and opportunities in the area of community involvement. Introduction to the growth and evolution of black communities, with emphasis on the living conditions of their members and the problems facing community developers. Varieties of black communities are studied.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50024", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOWK 271"}, {"Course": "AFST 275", "Name": "The Criminal Justice Process and Black Americans", "Credits": "3", "Description": "A study of the organization, role and responsibility of law enforcement agencies, e.g., the police, district attorneys, trial courts, grand juries, and correctional and rehabilitative systems. Interrelationships among these agencies and their relationship with the black community. Students will examine inner-city legal problems as an aspect of social control and explore how selected agencies relate to law enforcement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51361", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 301", "Name": "Research Design and Documentation", "Credits": "3", "Description": "Discussions, demonstrations and practice culminating in the writing of a proposal for a research project in Africana studies. Includes a description of available bibliographic resources. Recommended Preparation: AFST 201 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51306", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 312", "Name": "West African History", "Credits": "3", "Description": "History of West Africa from the period of the medieval empires through the era of the slave trade, the revolutionary 19th century, colonial rule and independence. This is a Writing Intensive class. Recommended Preparation: AFST 211 or AFST 212 or HIST 242 or HIST 243, or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50021", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Same as Offered": "HIST 354 ", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "AFST 314", "Name": "Islam in Africa", "Credits": "3", "Description": "This course is presented to provide the student with an introduction and overview of the history of Islam in Africa. This requires a discussion of Islam itself, its origins, philosophical thought, praxis and expansion. We then will turn to a more detailed examination of the penetration of Islam in Africa, eventually concentrating on its sub-Saharan influences. Recommended Preparation: AFST 211 or AFST 212 or HIST 242 or HIST 243.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50013", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 360, RLST 314 "}, {"Course": "AFST 320", "Name": "Contemporary African Politics", "Credits": "3", "Description": "Nationalism and the struggle for independence. The evolution of post-independence systems and institutions. Examination of problems and trends since independence, including development administration, territorial and ethnic conflicts, nation-building and the role of the military, decolonization and neocolonialism, and Africa in world affairs. This course is repeatable for credit. Recommended Preparation: AFST 211 or HIST 242 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50020", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp African Politics", "Same as Offered": "POLI 378 "}, {"Course": "AFST 323", "Name": "Economic Development in Africa", "Credits": "3", "Description": "The economic structure of traditional African societies. Domestic methods of production, distribution and exchange. From colonial economic exploitation to post-independence underdevelopment. The nature of economic development, planning, regional cooperation, international trade and foreign aid. Recommended Preparation: AFST 211 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51309", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 340", "Name": "Issues in African and Afro-American Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52083", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Blues, Jazz & Afro Amer Mig, Blk Masculinity In American Lit, Black Egypt in the World Imagination"}, {"Course": "AFST 344", "Name": "Black Folklore", "Credits": "3", "Description": "A study of black folklore of Africa and the African diaspora and its continuing influence on contemporary society. Folktales from Aesop to the New World and the question of provenance. Folk beliefs and folk practices including ritual, traditional medicine, celebrations, games and (work) songs. Parallels and distinctions between folklore and popular culture. Two or three cultures selected from Africa and the diaspora will be studied each semester offered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51310", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AFST 345", "Name": "Black American Music", "Credits": "3", "Description": "An in-depth study of the development of the music of blacks in the United States from early colonial period to the present. Particular attention will be devoted to slave songs, the evolution of the blues and jazz, and the Africanisms evident in these idioms. Recommended Preparation: AFST 245 or MUSC 215 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50028", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "MUSC 339 "}, {"Course": "AFST 347", "Name": "Gender, Race, and Media", "Credits": "3", "Description": "In this course, we define media and analyze intersecting formations of gender, race, class, and sexuality, as produced through a range of media genres and forms. These include, but are not limited to, advertisements and commercials, television and film, music and music videos, visual arts, and digital visual cultures. We interrogate media as powerful, pervasive sites where dynamic relations between dominant representations and resistant subject formations are staged. As consumers and producers of media, we learn to articulate the entanglement of social justice concerns, politics, and cultural and economic resources. We practice tools of critical reading and thinking, such as textual analysis, visual discourse analysis, and the basics of media literacy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50004", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)", "Same as Offered": "GWST 322, MLL 322 "}, {"Course": "AFST 348", "Name": "Black, Queer, and Feminist Film", "Credits": "3", "Description": "This course examines prominent themes in films that fall within the categories “Black,” “Queer,” and “Feminist.” Most of the films are narrative, dealing with issues involving race, gender, and sexuality. This course is not just about watching films. It makes extensive use of critical historical and theoretical texts from the disciplines of psychoanalysis, feminism, literary and queer theory, as well as from film history, art history, and critical theory. Prior knowledge of film-making and/or film history/theory is not required. Recommended Preparation: GWST 210 and AFST 100.", "Grading": "Graded/Pass Fail", "Course ID": "102079", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 350", "Name": "Psychology of Racism", "Credits": "3", "Description": "Analysis of current psychological theory and research on individual and institutional racism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50003", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOWK 350 ", "Prerequisite/Corequisite": "You must have completed AFST 255 and earned a grade of C or better."}, {"Course": "AFST 351", "Name": "Black Political Thought", "Credits": "3", "Description": "An exposition and critical analysis of major political and social ideas of contemporary black leaders. Emphasis will be placed on the content of the thinkers’ ideas and on societal factors. Recommended Preparation: Junior/senior standing or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52084", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 352", "Name": "African-American History to 1865", "Credits": "3", "Description": "An in-depth examination of the social, political and economic history of African Americans in the United States from the 1600s to the Civil War era focusing on chattel slavery, the free black community, family, abolitionism, resistance and the Civil War. Recommended Preparation: AFST 100 or AFST 206 or junior/senior standing or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50008", "Consent": "No Special Consent Required", "Components": "Seminar", "Same as Offered": "HIST 321 "}, {"Course": "AFST 353", "Name": "African American History Since 1865", "Credits": "3", "Description": "An in-depth examination of the political, social, economic and cultural history of African Americans in the United States from the Reconstruction era following the Civil War up to present. Topics include African Americans and the military, the Great Depression, migrations, urbanization, racism, family, civil rights and current issues. Recommended Preparation: AFST 100 or AFST 206 or junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50011", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 322 "}, {"Course": "AFST 354", "Name": "African American Women’s History", "Credits": "3", "Description": "This course traces the history of African -American women in the United States, beginning with their ancestors’ history in pre-colonial Africa and U.S. slavery to the present. Topics covered include work; family roles; activism; achievements; and bouts with racism, sexism and poverty. Recommended Preparation: Any 100-level Social Science course or 200-level Literature course or junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50010", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 327, HIST 323 "}, {"Course": "AFST 360", "Name": "Studies in Black Fiction", "Credits": "3", "Description": "Critical examinations of selected works of fiction by and about blacks based on a particular historical period, theme, type or direction. Selected works may be from one or more of the three areas of concentration (Africa, United States, Caribbean and Latin America). Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: AFST 260 or AFST 261 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50002", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "African Novelists, Studies In Black Fiction, Black Women Novelists, Hot Off The Press:21St C, 19Th, 20Th Cent Classic"}, {"Course": "AFST 361", "Name": "Studies in Black Drama", "Credits": "3", "Description": "The portrayal of the black experience in plays by primarily black dramatists. Examination of problems encountered in reading or producing plays of black writers. Experiments and new directions in black drama and theatre. Selections will treat a specific historical period, theme or group of dramatists from one or more areas of concentration: Africa, the United States, Caribbean and Latin America. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50022", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp African American, Studies In Black Drama", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "ENGL 361 "}, {"Course": "AFST 362", "Name": "Studies in Black Poetry", "Credits": "3", "Description": "Examination of a theme, group of poets, or historical period in the development and evolution of black poetry. The special contribution of poetry in the development of a black ethos and a black consciousness. Poets may come from one or more of three geographic areas: Africa, the United States, the Caribbean and Latin America. Special selections of black poetry from other areas may be included. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52085", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Studies In Black Poetry, Advanced Writing In Afri", "Same as Offered": "ENGL 362 ", "Prerequisite/Corequisite": "You must complete AFST 260 or AFST 261 "}, {"Course": "AFST 363", "Name": "Literature, Society and Blacks: Regional", "Credits": "3", "Description": "Blacks and black society as reflected in the creative literature written by or about blacks from a geographic region of Africa, from North America (especially from the United States), or from the Caribbean and Latin America. The focus will be on poetry, drama, fiction or some combination of these. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Recommended Preparation: AFST 260 or AFST 261 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52086", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Short Story, Afro-Hispanic Literature, Black Lit Into Film, Black Nobel Laureates, Hero Dynamics In Black, Lit, Society And Blacks"}, {"Course": "AFST 364", "Name": "Advanced Writing in Africana Studies", "Credits": "3", "Description": "An advanced writing course that complements students’ liberal arts training for careers in Africana Studies related professions/fields such as international relations, education, history, journalism, community action, non-profit organization, government affairs, public relations, law, public-speaking, and diversity training and mediation. This course differs from AFST 264 with respect to rigor and content by requiring students to utilize advanced skills of critical analysis within the framework of interdisciplinarity introduced in AFST 100 and AFST 264 to draft a complex final research paper whose topic and approach reflects their evolving intellectual advancement. While the course continues to address the globally recognized traditions of excellence celebrated by the Nobel committee (this time concerning Peace not Literature), as an upper division seminar, it prioritizes such content in terms of history, politics, social justice, and cultural philosophy. Students will thus have a unique opportunity to chronicle their philosophical responses to political events, systems of oppression, and humanitarian activism through journaling and through the ongoing development of complex critical ideas that will evolve into theses that support both short and lengthy assignments. Recommended Preparation: ENGL 100, AFST 100, or any 200-level AFST course with a grade of “C” or better, or permission of the instructor.", "Grading": "Graded", "Course ID": "100097", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 367", "Name": "Workshop in Black Theatre", "Credits": "6", "Description": "A workshop for students with experience in production and commitment to black drama. At least one play will be studied in depth and directed for stage production. Recommended Preparation: Permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "51153", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 368", "Name": "African Religions in Africa and the Diaspora", "Credits": "3", "Description": "A comparative study of selected indigenous African religions and an examination of African religious survivals in the New World. Continuity and change in the principal forces of the religious systems: the Supreme Being, the cosmic gods, the ancestors and lesser spirits, as well as the relation-ship to other religions. Recommended Preparation: Junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50031", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)", "Same as Offered": "RLST 370 "}, {"Course": "AFST 369", "Name": "Black Families in the United States", "Credits": "3", "Description": "A historical and contemporary analysis of black families in America and the forces that have influenced black family life. A reassessment of the numerous social science theories about the black family and an attempt to correct distortions. The effects that the African background, slavery, racism and the black community have had on black-American family lifestyles. Recommended Preparation: Junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52087", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 370", "Name": "Black Women: Cross-Cultural Perspectives", "Credits": "3", "Description": "A comparative examination of selected social and psychological factors that influence the lives of black women in Africa and the diaspora. Recommended Preparation: AFST 100, GWST 100 or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50007", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 370 "}, {"Course": "AFST 371", "Name": "The Female Offender", "Credits": "3", "Description": "An examination of causes and incidence of female crime and the exploration of major theories from Freud to the feminist. Community response to female crime and alternative forms of treatment are evaluated. Recommended Preparation: AFST 271 or junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50009", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 371 "}, {"Course": "AFST 372", "Name": "Economic Activity in the Black Community", "Credits": "3", "Description": "Afro-American economic activity in urban and rural America. The development of black participation in the economy. The dilemmas of black capitalism. Income distribution, policies, strategies and programs to combat economic powerlessness of blacks in the United States. Recommended Preparation: ECON 101 or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52088", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 375", "Name": "The Black Church", "Credits": "3", "Description": "The emergence and development of the black church as a distinctive institution in the United States. An evaluation of the authority of the black church in religious and secular matters. The functions of the black church in urban communities. Recommended Preparation: Junior/senior standing or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52089", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 377", "Name": "Black Community Development", "Credits": "3", "Description": "This course focuses on specific research, planning and organizing skills needed by community development workers and on techniques and strategies of helping community members achieve their personal and collective goals. Consideration also is given to the main types of community research and intervention. Recommended Preparation: AFST 271 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52090", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 378", "Name": "Population Dynamics of Black Americans", "Credits": "3", "Description": "This is a study of the population and demographic characteristics of Afro-Americans. Topics to be discussed include patterns and significance of the variation in fertility, family planning, mortality, migration and urbanization. Population and politics, population and resources, and the depopulation of rural areas. Recommended Preparation: Junior/senior standing or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52091", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 381", "Name": "Urban Housing Policy", "Credits": "3", "Description": "The course studies the urban housing problems of the black community, their causes, effects and proposed remedies for them. While much of this course deals with the housing problems of blacks in Baltimore, the problems studied are common to major cities within the United States. Recommended Preparation: Junior/senior standing or permission of instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52092", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 385", "Name": "Problem-Solving in the Urban Black Community", "Credits": "3", "Description": "Urban problems within the Black community. Nature and types of problems, causes (internal and external), effects and remedies. Recommended Preparation: AFST 271 or junior/senior status", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50019", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "POLI 436, POLI 440 ", "Same as Offered": "POLI 340 "}, {"Course": "AFST 390", "Name": "American Health Care System and the Black Community", "Credits": "3", "Description": "A course for students concerned with the health status of black, poor and minority people. Analysis of the relationship between the condition of the health of black people in America and the health delivery system. Specific attention will be on federal, state and local health care policies; personnel training in health administration; medical care organizations; financing and research and evaluation. Recommended Preparation: HAPP 100, AFST 271 or junior/senior status", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50029", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HAPP 390 "}, {"Course": "AFST 392", "Name": "Race, Crime and Public Policy", "Credits": "3", "Description": "This course examines social, political, and historical factors that have contributed to the chronic over-involvement of African Americans in the U.S. criminal justice system. It examines the perception of African Americans as criminals; the rhetoric of race; American political and criminal justice history; and how they have provided context for contemporary problems faced by African Americans with the criminal justice system in terms of mass incarceration and police misconduct. Baltimore and New York City are used as case studies for these problems. Recommended Preparation: AFST 100 and a lower level SS course (with at least a C grade)", "Grading": "Graded", "Course ID": "102768", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 394", "Name": "Race, Social Inequality, and Institutional Structure", "Credits": "3", "Description": "This course examines theoretical and empirical analyses of race, social inequality, and institutional racism in the United States. It focuses on the historical development of race and racism, social inequalities in the United States with an emphasis on institutional racism in health and mass incarceration, as well as past and current efforts to foster positive changes through public policy and individual agency. Patterns and processes associated with racial inequities, political inequality, ideology, and global issues will also be examined. Recommended Preparation: AFST 100 and SOCY 101 or a lower level SS course (with at least a C grade)", "Grading": "Graded", "Course ID": "102783", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 394 "}, {"Course": "AFST 396", "Name": "Psychology, Race, and Social Justice", "Credits": "3", "Description": "This course examines historical and psychological factors that have influenced the mistreatment of African Americans by the U.S. criminal justice system. Psychological research and theory are used to provide insights on why such misconduct persists on the part of justice officials. Issues explored include the contributions of implicit biases and cultural stereotypes for such behavior. Social justice principles and applied psychological research findings are used to explore possible amelioration of these inequalities. Recommended Preparation: AFST 100 and a lower level SS course (with at least a C grade)", "Grading": "Graded", "Course ID": "102769", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 411", "Name": "American Foreign Policy and Africa", "Credits": "3", "Description": "American policy toward Africa, focusing on the period since World War II. Issues include East-West rivalry, liberation movements in southern Africa, the political economy of aid and trade (the North-South dialogue), and such cultural questions as the New Information Order and the role of the Peace Corps. Recommended Preparation: AFST 211 or AFST 212 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52093", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 415", "Name": "Music, Art and Society in West Africa", "Credits": "3", "Description": "A study of the functions and form of traditional and contemporary music in several West African ethnic groups. The use of instrumentation and voice will be studied through listening and performance. A class visit to one museum housing these instruments is required. Recommended Preparation: AFST 245 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50018", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MUSC 467 "}, {"Course": "AFST 420", "Name": "Comparative Slavery: Africa and the New World", "Credits": "3", "Description": "Historical examination and comparison of the emergence of domestic slavery in Africa and chattel slavery in the New World and the Americas. Explores the social conditions that shaped these institutions and that led to overt and covert forms of resistance and slavery’s eventual decline. Recommended Preparation: AFST 212 or AFST 352 or junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50017", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 405 "}, {"Course": "AFST 430", "Name": "Health Care in Africa", "Credits": "3", "Description": "Patterns of health care in Africa. Analysis of economic, political, demographic and cultural factors that influence health care delivery. Common diseases. The practice of curative medicine in urban centers and primary health care in rural areas. Traditional medicine, modern paramedical programs, child and maternal health care, family planning, nutrition, pharmacies, health education, financing, etc., and their meaning for Africa’s development. Recommended Preparation: AFST 211 or AFST 390 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52094", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 439", "Name": "Women in Africa and the Diaspora", "Credits": "3", "Description": "This course uses the comparative approach to examine the experiences of women of African descent from the era of the trans-Atlantic slave trade to the present. It will introduce students to interdisciplinary and comparative theories and materials that will enable them to explore the economic, cultural, social and political roles of women in Africa and African descended women in the United States. Using comparative gender analysis as its theoretical focus with a global perspective, the course emphasizes the diverse, shared historical experiences of women of African descent as enslaved persons, colonial subjects and victims of all forms of oppression as well as agents of social change. Examined as well are their roles in society as mothers, daughters, wives and workers along with their participation in social and political movements since the abolition era. The course also highlights how such other social indexes as class, race, ethnic, national and religious backgrounds affect women’s lives and roles in society. Problems and issues that directly affect them and how to improve their status in the face of increased globalization will be explored.", "Grading": "Graded", "Course ID": "100280", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 439 "}, {"Course": "AFST 440", "Name": "Topics in African and African-American Studies", "Credits": "3", "Description": "Seminar for upper-level students. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One or more 300-level courses in Africana concentration", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52095", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 442", "Name": "African-Caribbean Music", "Credits": "3", "Description": "The song and dance music of Caribbean countries will be studied through listening and performance. The derivatives of African religious and cult music found in Haiti, Trinidad-Tobago and Cuba will be examined. The influences of French and Spanish cultures on the form and content of African-Caribbean songs and dances also will be studied. Recommended Preparation: AFST 245 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50016", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MUSC 468"}, {"Course": "AFST 445", "Name": "Black Music in the New World", "Credits": "3", "Description": "This is a seminar devoted to topics focusing on particular aspects of Afro-American, Afro-Caribbean and/or Afro-Latin music. The quality, type and intensity of Africanisms in the music of a region, a group or an era will be explored. An intensive examination of the development of new musical idioms, including the reciprocity of African with European influences. A research paper or project is required. Recommended Preparation: AFST 245 and junior/senior standing or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50015", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MUSC 479"}, {"Course": "AFST 450", "Name": "Black Philosophical Thought in the Twentieth Century", "Credits": "3", "Description": "The complexity of the ideas of major black thinkers A. Locke, H. Thurman and W.E.B. DuBois as they dealt with philosophical theory and criticism. An analysis and discussion of that body of knowledge that deals with metaphysical and material approaches to thought. Recommended Preparation: Honors major and senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52096", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 453", "Name": "Topics in the Psychology of the Black Experience", "Credits": "3", "Description": "An intensive examination of current trends, theory and practice in selected areas, e.g., the black personality, testing of American minorities, psychological methodology and research on black populations, gender roles in the black community, black psychology, mental health in the Black community. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: AFST 255 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52097", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Topics Psyc Black Exp"}, {"Course": "AFST 460", "Name": "Seminar in Black Hair and Body Politics", "Credits": "3", "Description": "This course will focus on constructions of Black hair and the Black body in media of the 20th and 21st century. The seminar combines primary readings, personal anecdotes, and applied research about the body, its extremities (such as hair), its performance of sexualities and identities in the context of the production of culture and social relations. Examining this body of literature from a range of theoretical and applied perspectives enables analysis and discussion of the processes used in the creation of cultural meaning-making. Additionally, a critique of the readings will also afford the opportunity to explore alternatives to the perpetuated materialist or constructivist binary existing in approaches to the body. Measures of prescription give way to problematizing and questioning the readings in order to explore dynamic resolutions at the individual level. AFST or AMST or other social sciences of humanities course focused on American society or culture will provide students a knowledge base useful for this course.", "Grading": "Graded", "Course ID": "100298", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 465", "Name": "Seminar in African and African-American Literature", "Credits": "3", "Description": "A study of creative writers of African descent in America, Africa and the Caribbean and the impact of their works on the shaping of consciousness among black people. Focus on issues and themes such as alienation, confrontation, accommodation, revolution, tradition and modernism, the New Negro, Negritude, African personality, Black Power, etc. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: AFST 260 and AFST 261; one of AFST 360, AFST 361 or AFST 362; or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52098", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Sem Afr/Afro-Amer Lit, Black World Autobiograph, Creative Conn. In AFST"}, {"Course": "AFST 473", "Name": "The Black Senior Citizen", "Credits": "3", "Description": "The historic and contemporary role that the black aged have played in black communities. Attention is given to special problems that afflict the black aged, such as higher frequency of illnesses, earlier deaths, social isolation. Methods for working out solutions to problems of the black aged. Recommended Preparation: Junior/Senior status or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52099", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 490", "Name": "Community Internship Project", "Credits": "6", "Description": "Specified period of internship in which students are exposed to practical and associational experiences with workers in community planning, health, welfare, correctional services and other development agencies. This course is repeatable for credit. Students may complete a maximum of 12 credits. Recommended Preparation: AFST 377 Note: Students are expected to work out internship plans with the instructor well in advance of proposed starting date.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52100", "Consent": "Instructor Consent Required", "Components": "Field Studies"}, {"Course": "AFST 493", "Name": "Service Learning: Race and Social Advocacy", "Credits": "3", "Description": "This course introduces students to the methods and perspectives of activism, advocacy, and social justice through service learning. It provided students with an opportunity to explore in depth the philosophy and theory behind advocacy and community organizing; and tools to question and challenge the status quo pertaining to cultural democracy. Students will be required to work with a community activist or existing organization with a strong focus on community centered social justice. Recommended Preparation: Lower Level SS course with a “C” or better.", "Grading": "Graded", "Course ID": "102774", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have taken AFST 100 and earned a “C” or better"}, {"Course": "AFST 495", "Name": "Field Research in Africana Studies", "Credits": "3", "Description": "Supervised empirical research in the field. Prior approval of written research proposal by a faculty member must be secured. Individual meeting with supervising faculty member on regular basis is required. Written report expected. Recommended Preparation: AFST 301 Note: Students should obtain AFST guidelines on directed individual study from the department.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52101", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AFST 498", "Name": "Directed Individual Study", "Credits": "2", "Description": "Directed work in the systematic investigation of a problem selected by the student in consultation with an advisor. May be taken in conjunction with the research paper option for majors in Africana studies. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Approved written proposal by supervising instructor based on the directed individual study guide obtainable from the department.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52102", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "AFST 499", "Name": "Honors Thesis", "Credits": "3", "Description": "Open only to students who have outstanding records of academic achievement and who are Africana studies majors. Students must enroll for both semesters of the sequence. Credit and grade will be assigned upon the completion of the thesis. Approval of topic by department required prior to assignment of faculty supervisors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52103", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "AMST 100", "Name": "Introduction to American Studies", "Credits": "3", "Description": "A broad introduction to the study of American culture, past and present. The course focuses upon primary ideas that have been most influential in the development of American culture and their expression in various forms, written and visual. Special emphasis is placed upon tensions between the individual and society and upon the relationship of culture to subcultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52123", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 100H, AMST 100Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 100H", "Name": "Introduction to American Studies", "Credits": "3", "Description": "A broad introduction to the study of American culture, past and present. The course focuses upon primary ideas that have been most influential in the development of American culture and their expression in various forms, written and visual. Special emphasis is placed upon tensions between the individual and society and upon the relationship of culture to subcultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52124", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 100, AMST 100Y ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 100Y", "Name": "Introduction to American Studies", "Credits": "4", "Description": "A broad introduction to the study of American culture, past and present. The course focuses upon primary ideas that have been most influential in the development of American culture and their expression in various forms, written and visual. Special emphasis is placed upon tensions between the individual and society and upon the relationship of culture to subcultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52125", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "AMST 100, AMST 100H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 200", "Name": "What is an American?", "Credits": "3", "Description": "This course will explore the evolving question of what constitutes American identity and belonging through important readings on race, class, ethnicity, religion, immigration, gender, sexuality, freedom, and equality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52126", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 200H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 200H", "Name": "What Is an American?", "Credits": "3", "Description": "This course will explore the evolving question of what constitutes American identity and belonging through important readings on race, class, ethnicity, religion, immigration, gender, sexuality, freedom, and equality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52127", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 200 ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 205", "Name": "Civic Agency and Social Entrepreneurship", "Credits": "3", "Description": "By building their theoretical knowledge and practical skills, this course empowers and prepares students to work effectively in their communities, social groups and democracy to initiate and achieve social change. Students will analyze and evaluate prevailing ideas about effective citizenship, activism, service and politics, including conventional assumptions about the limits of ordinary citizens’ capacity to become agents of transformation. Students will work in teams to develop strategic plans for social change on campus and beyond.", "Grading": "Graded", "Course ID": "100366", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 205, SOCY 205 "}, {"Course": "AMST 210", "Name": "Introduction to Critical Sexuality Studies", "Credits": "3", "Description": "This course introduces students to the field of critical sexuality studies. Using an interdisciplinary approach, the course conducts a critical inquiry into the historical precedents and theoretical frameworks necessary to understand the role of sexuality in shaping personal, social, economic, and political life. The course focuses on patterns of subordination and exclusion based on individuals¿ sexual practices and identities, explains the origins and persistence of those patterns, and considers ways of challenging them. Throughout the course, special attention will be given to intersections of sexuality with gender, race, ethnicity, religion, class, and disability.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50032", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "GWST 210 "}, {"Course": "AMST 230", "Name": "The Arts in America", "Credits": "3", "Description": "This course examines 17th- to 21st-century American art forms from an interdisciplinary perspective. Placing fine arts, popular arts and folk arts in social and cultural context, the course draws on the approaches of folklore, cultural geography, archaeology and anthropology. The course will look at the relationship of art to aesthetics, to gender, to region and to religion in an effort to understand how art forms connect creators to their audiences.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052130", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 245", "Name": "Arab and Muslim Experiences in the United States", "Credits": "3", "Description": "This course introduces students to Arab and Muslim experiences in the U.S. via the study of literature, film, and art created by Arab and Muslim Americans. The course takes a historical approach and looks at texts that concern major historical events in Arab and Muslim American history. It will discuss how Arab and Muslim artists and writers are responding to and refusing racism and Orientalism while challenging gendered, sexual, and cultural norms within their communities. Recommended Preparation: GWST 100 or AMST 200 or GLBL 100 ", "Grading": "Graded/Pass Fail", "Course ID": "102622", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "GWST 245 "}, {"Course": "AMST 270", "Name": "American Culture and Science", "Credits": "3", "Description": "An examination of the place and meaning of science and technology in American cultural experience through a series of case studies. This course explores the interconnections of science to American mythologies of material success and progress, as well as the connections between technology and American cultural practices of work and family. Additionally, the course will examine how the scientific and engineering professions themselves represent an American subculture", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52134", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "AMST 280", "Name": "Special Topics in American Studies", "Credits": "3", "Description": "An interdisciplinary examination of a selected topic in American culture. Intended for students at the freshman/sophomore level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52135", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 300", "Name": "Approaches in American Studies", "Credits": "3", "Description": "This course introduces students to theories and methods in the field of American studies. Readings focus on methodological approaches and research practices employed both inside academia and in public scholarship. Students will write original research proposals that focus on problem solving. Students are expected to use what they learn in applying approaches in American studies to a specific problem/social issue and developing an original research proposal for a research paper or a public facing project. Recommended Preparation: Earned at least a ‘C’ in one 100 or 200 level SS or AH course.", "Grading": "Graded", "Course ID": "52142", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a ‘C’ or better."}, {"Course": "AMST 301", "Name": "Research Methods in American Studies", "Credits": "3", "Description": "This course is designed to develop the research and analysis skills, critical thinking, and effective writing necessary to undertake interdisciplinary research in humanities, social sciences, and cultural studies. Building on the extensive study of various approaches to the field provided in AMST 300, the course develops a fuller understanding of the theoretical and conceptual frameworks of research. Students engage in designing a proposal for an American Studies research project, including identifying research questions, cultivating interdisciplinary methodologies, compiling bibliographies, and completing a literature review, in preparation for the senior capstone project undertaken in AMST 490.", "Grading": "Graded", "Course ID": "101948", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AMST 300 with a C or better before taking this class."}, {"Course": "AMST 304", "Name": "Community Research", "Credits": "3", "Description": "This course will involve undergraduate students in a team-based project to generate field research findings useful to a government or non-profit client/partner. The policy areas to be researched will include environment, health, housing, poverty, and urban development, among others. Team participants will include teaching and research faculty and staff, advanced graduate students, and a Sondheim Program-based Peaceworker. Undergraduates will contribute to the research design and to the preparation of the research findings, and will conduct extensive field research. They will build practical research skills and engage with members of local communities.", "Grading": "Graded", "Course ID": "100236", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GES 304, POLI 304, PUB 304 "}, {"Course": "AMST 310", "Name": "Gender and Inequality in America", "Credits": "3", "Description": "An examination of the ways in which gender roles and gender relations are constructed and experienced in American society. The course explores the development of a woman’s “sphere” denoting women’s position in the family and home; cultural definitions of femininity and masculinity through mass media, education and other agencies of socialization; the relationship between wage-earning and household work; and feminist consciousness and politics. Special attention is paid to the ways in which gender-based experiences are divided by other social relations, particularly those of class, race and age. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50033", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 310H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "GWST 310, GWST 310H "}, {"Course": "AMST 310H", "Name": "Gender and Inequality in America - Honors", "Credits": "3", "Description": "An examination of the ways in which gender roles and gender relations are constructed and experienced in American society. The course explores the development of a woman’s “sphere” denoting women’s position in the family and home; cultural definitions of femininity and masculinity through mass media, education and other agencies of socialization; the relationship between wage-earning and household work; and feminist consciousness and politics. Special attention is paid to the ways in which gender-based experiences are divided by other social relations, particularly those of class, race and age. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52145", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AMST 310, GWST 310 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 317", "Name": "Nonviolence and American Social Movements", "Credits": "3", "Description": "This interdisciplinary course surveys the long tradition of nonviolent direct action in United States history and culture through primary documents, film, and music. We will focus on methods, strategies, tactics, and the development of social movements from the 18th century to the present. By the end of the course, students should develop the means to analyze how struggles, conflicts, and politics are conducted under the broad banner of nonviolent direct action. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102096", "Consent": "Instructor Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "AMST 320", "Name": "Television in American Culture", "Credits": "3", "Description": "An examination of the economic, social and artistic implications of television in the United States. Elements considered include television as a corporate structure, with emphasis on rating systems, programming philosophies and strategies, and demographic considerations; particular genres portrayed within daytime and prime-time television; sociological and psychological impact of television on American society; and television as a popular art. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52146", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 321", "Name": "Radio in American Culture", "Credits": "3", "Description": "This course studies the history of radio in American society with particular focus on an analysis of radio’s most popular genres and forms of programming. The course will examine the development of radio programming and genres in cultural context from the first years of the Great Depression, through the “golden age” of the 1930s and 1940s, to the diversity wrought by new technologies and policies in the present. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52147", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 322", "Name": "American Society and Culture in Film", "Credits": "3", "Description": "An analytical examination through a selection of important films dealing with a variety of central problems and issues in American society and culture, including social and cultural change, regional and ethnic variations, political ideology, gender differences, labor history and community continuity. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52148", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 323", "Name": "Baltimore in Film", "Credits": "3", "Description": "This course fosters an in-depth discussion of representations of Baltimore through film. Specifically, we review the works of various directors/writers who utilize Baltimore as the landscape of their film(s) or centralize Baltimore as its story. The works of directors/writers who hail from this metropolitan area are also a key focal point of the course. Through an analysis of these works, we explore the various representations of Baltimore and allow students to think critically about Baltimore as a city. Readings on film studies, media studies, and critical studies research provide a broader understanding of how cities are portrayed in film. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "100184", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 324", "Name": "The Road Movie in America and Abroad", "Credits": "3", "Description": "This course examines the road movie as an important symbol of American culture. Through a close reading of the cinematic text and scholarship, important cultural issues, such as the frontier, identity, the disintegration of the nuclear family, and the future of the American empire will be explored. In this class students will gain skills for understanding the critical language of cinema and the complexity of how American issues and popular culture travel abroad.", "Grading": "Graded", "Course ID": "100190", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 325", "Name": "Studies in Popular Culture", "Credits": "3", "Description": "The interplay of the popular arts and American society, using American studies interdisciplinary methodologies. Emphasis will be placed on the modern era from the 1890s to the present, with greatest weight placed upon mass and popular culture of the last quarter of this century. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52149", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 326", "Name": "On the Move: Public Transportation in Baltimore", "Credits": "3", "Description": "This interdisciplinary course explores the development of public transportation in the U.S. with a focus on Baltimore. Students will engage the history and politics of public transportation and the decline that follows the rise of the suburbs and car culture following World War II. Students will complete readings from a diverse range of fields and also engage literary and cinematic representations of the changing nature of public transportation in the cultural imagination. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102097", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "AMST 327", "Name": "Sports and Media in American Society", "Credits": "3", "Description": "This course fosters an in-depth discussion of the American sports industry through the lens of media. Special attention will be given to the role that media play in the creation of sports as a business, including but not limited to, its entertainment value. Students will develop an understanding of this economically-profitable industry through a series of readings on media, spectatorship, and the power dynamics of sports, as well as attendance at sporting events. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "100185", "Consent": "No Special Consent Required", "Components": "Lecture"}]