[{"Course": "ENME 220H", "Name": "Honors Mechanics Of Materials", "Credits": "3", "Description": "Mechanics of Materials is a fundamental course on the mechanical behavior of deformable bodies under axial loads, torsion, flexure, and combined loads. The concepts of stress, strain, and material properties are introduced and used to relate external forces with the resulting internal forces and deformation of a body. Practical applications involving the design of mechanical and structural elements under various load conditions are emphasized.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100119", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENME 220 ", "Prerequisite/Corequisite": "You must complete ENME 110 and MATH 152 with a ‘B’ or better and PHYS 121 with a grade of ‘C’or better."}, {"Course": "ENME 221", "Name": "Dynamics", "Credits": "3", "Description": "Study of objects in motion. Objects are approximated first as particles and then as rigid bodies. In both cases, the kinematic relationships are derived first. Kinetics is studied from three perspectives: force-acceleration, work energy and impulse-momentum.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54193", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must have completed ENME 110 and MATH 152 and PHYS 121 all with a grade of “C” or better."}, {"Course": "ENME 301", "Name": "The Structure and Properties of Engineering Materials", "Credits": "3", "Description": "The nature and properties of engineering materials as related to their use in all phases of mechanical engineering will be studied. Materials covered include metals, ceramics and glasses, polymer and composites.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54195", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENME 301H ", "Prerequisite/Corequisite": "You must have completed ENME 220 and PHYS 122 and CHEM 102 and CHEM 102L all with a grade of “C” or better."}, {"Course": "ENME 301H", "Name": "Honors Structure and Properties of Engineering Materials", "Credits": "3", "Description": "The nature and properties of engineering materials as related to their use in all phases of mechanical engineering will be studied. Materials covered include metals, ceramics and glasses, polymer and composites.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100120", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENME 301 ", "Prerequisite/Corequisite": "You must complete ENME 220 and PHYS 122 and CHEM 102 and CHEM 102L all with a grade of ‘C’ or better."}, {"Course": "ENME 303", "Name": "Engineering Mathematics", "Credits": "3", "Description": "Introduction to programming using MATLAB. Elements of linear algebra and numerical solution of ordinary differential equations with application in engineering. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54197", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed MATH 225 and MATH 251 and ENME 220 and ENME 221 all with a grade of “C” or better."}, {"Course": "ENME 304", "Name": "Machine Design", "Credits": "3", "Description": "In-depth design course that is a follow-up to ENME 204. The focus here is on designing machine components. Emphasis is on kinematics, working stresses, repeated loadings, fatigue and heating effects. The course requires completion of a design project and the use of such computational tools as CAD and engineering codes. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54198", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed ENME 204 with a grade of “C” or better."}, {"Course": "ENME 320", "Name": "Fluid Mechanics", "Credits": "3", "Description": "Fluid flow concepts and basic equations, effects of viscosity and compressibility, dimensional analysis and laws of similarity, flow through pipes and over-immersed bodies, and principles of flow measurement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54202", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 217 and ENME 220 and ENME 221 and MATH 225 and MATH 251 all with a grade of “C” or better."}, {"Course": "ENME 321", "Name": "Transfer Processes", "Credits": "3", "Description": "Conduction by steady state and transient heat flow; laminar and turbulent flow; free and forced convection; radiation, evaporation and condensation of vapors; and transfer of mass, heat and momentum.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54203", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 320 with a grade of “C” or better."}, {"Course": "ENME 332H", "Name": "Solid Mechanics and Materials Laboratory - Honors", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54205", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Course Equivalents": "ENME 332L ", "Prerequisite/Corequisite": "You must have completed ENME 220 and ENME 301 with a grade of ‘C’ or better before you can take this course."}, {"Course": "ENME 332L", "Name": "Solid Mechanics and Materials Laboratory", "Credits": "3", "Description": "A laboratory course in testing mechanical properties of materials. Emphasis will be on experimental techniques in solid mechanics, strain gages, strain gage rosettes, photoelasticity, acoustic emissions, metallurgical and electron microscopy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54206", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Course Equivalents": "ENME 332H ", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENME 220 and ENME 301 with a grade of “C” or better before you can take this course."}, {"Course": "ENME 360", "Name": "Vibrations", "Credits": "3", "Description": "Dynamic characteristics of machinery with emphasis on systems with single and multiple degrees of freedom.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54209", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 220 and ENME 221 and ENME 303 and MATH 225 all with a grade of “C” or better."}, {"Course": "ENME 403", "Name": "Automatic Controls", "Credits": "3", "Description": "Hydraulic, electrical, mechanical and pneumatic automatic control systems; open and closed loops; steady-state and transient operations; stability criteria; linear and non-linear systems; and Laplace transforms.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54214", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 360 and either CMPE 306 or ENEE 302 with a grade of “C” or better before you can take this course."}, {"Course": "ENME 405", "Name": "Energy Conversion Design", "Credits": "3", "Description": "Application of thermodynamics, fluid mechanics and processes; design of engines, compressors, and heat exchangers; and energy and fuel-handling equipment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54216", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 321 with a grade of “C” or better."}, {"Course": "ENME 408", "Name": "Selected Topics in Engineering Design", "Credits": "3", "Description": "Three lecture periods per week. Creativity and innovation in design, generalized performance analysis, reliability and optimization as applied to the design of components and engineering systems, use of computers in design, and design of multivariable systems. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54217", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Biomaterials, Space Tech & Design, Biomechanics, Elements of Aerospace, Macromech of Composites, Baja SAE Project, Satellite Design, Spacecraft Systems Engineering", "Prerequisite/Corequisite": "You must have Senior standing in Mechanical Engineering and have a 2.0 or better GPA."}, {"Course": "ENME 409", "Name": "Mechanics of Deformable Solids", "Credits": "3", "Description": "Introduction to the mechanics of engineering materials in three dimensions, concepts of stress and strain, generalized Hooke’s law and equilibrium of solids. Modes of failure, including plasticity, stability, fatigue and fracture, will be treated. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54218", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Elasticity Theory & App, Adv Mech. Of Materials, Deformable Solids, Mech Of Deformable Sol, Mechanics Of Materials", "Prerequisite/Corequisite": "You must have completed ENME 220 with a grade of “C” or better before you can take this course."}, {"Course": "ENME 410", "Name": "Operations Research I", "Credits": "3", "Description": "Applications of linear programming queuing model, theory of games and competitive models to engineering problems. Recommended Preparation: Senior standing in Mechanical Engineering.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54219", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENME 412", "Name": "Mechanical Design for Manufacturing and Production", "Credits": "3", "Description": "Physical properties of materials and review of fundamental principles of product design. Various classes of engineering materials are characterized. Types of manufacturing processes that can be applied to the production of the design are discussed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54221", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete ENME 301 and ENME 304 with a C or better."}, {"Course": "ENME 416", "Name": "Intermediate Thermodynamics", "Credits": "3", "Description": "Application of the first and second laws of thermo-dynamics in the analysis of basic heat engines, air compression and vapor cycles, and heat sources in fossil fuels and nuclear fuels.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54224", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 217 with a grade of “C” or better."}, {"Course": "ENME 421", "Name": "Advanced Conduction and Radiation Heat Transfer", "Credits": "3", "Description": "Introduction to analytical and numerical methods to solve heat transfer problems involving heat conduction and radiation processes.", "Grading": "Graded", "Course ID": "100285", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENME 321 with a grade of C or better"}, {"Course": "ENME 422", "Name": "Heat Transfer in Biological Systems", "Credits": "3", "Description": "This is a cross-listed course offered to upper level undergraduate students as a science elective, and regular graduate students. The course focuses on how heat transfer mechanisms and principles are applied to biological systems. It includes how to model heat transfer in tissue with blood perfusion, major experimental approaches for measuring thermal and physiological properties of tissue, as well as detailed description of various aspects of bioheat transfer analyses in hyperthermia treatment to kill tumor.", "Grading": "Graded", "Course ID": "54225", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENME 321 with a grade of “C” or better"}, {"Course": "ENME 423", "Name": "Heating, Ventilation and Air Conditioning Design", "Credits": "3", "Description": "The topics to be covered will include heating and cooling load calculations; psychrometrics applied to HVAC design, thermodynamics of refrigeration, space air diffusion, piping and duct flow analysis, introduction to solar energy and indoor air quality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54226", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 304 and ENME 321 and ENME 332L and ENME 360, with a grade of ‘C’ or better or have completed ENME 304 and ENME 321 with a grade of ‘C’ or better and be concurrently enrolled in ENME 332L and ENME 360."}, {"Course": "ENME 425", "Name": "Internal Combustion Engines", "Credits": "3", "Description": "Fundamentals underlying the design and operation of internal combustion engines; aspects of fuels, lubricants, instrumentation, combustion and performance; and the causes and control of air pollution.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54228", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENME 304  and ENME 321  and ENME 332L  and ENME 360 , with a grade of ‘C’ or better."}, {"Course": "ENME 432L", "Name": "Fluids/Energy Laboratory", "Credits": "2", "Description": "Measurement of fluid properties, fluid forces and observation of flow phenomenon; demonstration of flow measurement techniques; and measurement of heat-transfer properties: conduction, convection and radiation; and condensation and evaporation measurements.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54230", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100  or the equivalent and ENME 320 and ENME 321 all with a grade of ‘C’ or better."}, {"Course": "ENME 442", "Name": "Fluid Mechanics II", "Credits": "3", "Description": "Hydrodynamics with engineering applications, stream function and velocity potential, conformal transformations, pressure distributions, circulation, numerical methods and analogies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54231", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENME 320 with a grade of “C” or better and have Senior standing in Mechanical Engineering with a 2.0 or better GPA."}, {"Course": "ENME 444", "Name": "Mechanical Engineering Systems Design", "Credits": "3", "Description": "This course allows students completing the Mechanical Engineering curriculum to engage in a complete system design experience, integrating the various technical concepts they have learned in prior courses and is the last in a sequence of design courses that are an integral component of the undergraduate program. The course imparts a foundation in team leadership and project management and emphasizes entrepreneurial skills necessary to function in any organization, regardless of size. Engineers in industry solve problems that simultaneously resolve budgetary, time, technical and sometimes social, ethical and environmental constraints. Students will enjoy an experience that closely matches this environment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54232", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed all 300 level courses required in ENME with a grade of “C” or better."}, {"Course": "ENME 460", "Name": "Kinematics and Mechanism Design", "Credits": "3", "Description": "This course focuses on the kinematic analysis and mechanism design. Extensive kinematic concepts and theories including Gruebler’s mobility analysis, Grashof criteria, kinematic analysis and kinematic synthesis will be covered. These kinematic fundamentals will be applied to solve a real-world mechanism design problem. Students are assigned both an individual analysis project and a team design project and required to complete a design realization and technical report.", "Grading": "Graded", "Course ID": "100282", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 303 with a grade of “C” or better."}, {"Course": "ENME 461", "Name": "Dynamics II", "Credits": "3", "Description": "Linear and non-linear plane and three-dimensional motion, moving aces, LaGrange’s equation, Hamilton’s principle, nonlinear vibration, gyroscope and celestial mechanics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54235", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 360 with a grade of “C” or better and have Senior standing in Mechanical Engineering with a 2.0 GPA or better. "}, {"Course": "ENME 462", "Name": "Introduction to Engineering Acoustics", "Credits": "3", "Description": "Study of the physical behavior of sound waves. Introduction to terminology and instrumentation used in acoustics. Criteria for noise and vibration control. Some fundamentals underlying noise control and applications to ventilation systems, machine and shop quieting, office buildings jet noise, transportation systems and underwater sound.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54236", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENME 304  and ENME 321  and ENME 332L  and ENME 360, all with a grade of C or better."}, {"Course": "ENME 463", "Name": "Mechanical Engineering Analysis", "Credits": "3", "Description": "Mathematical modeling of physical situations. Solution of problems expressed by partial differential equations. Application of Fourier series and integrals. Laplace transformation; Bessel functions; Legrendre polynomials; and complex problems in mechanical vibrations, heat transfer, fluid mechanics and automatic control theory. Recommended Preparation: MATH 225 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54237", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENME 464", "Name": "Machine Design II", "Credits": "3", "Description": "The study of stress and strain as applied to engineering problems, stress and strain from a three-dimensional point of view, theories of failure, residual stresses, dynamic loading, fatigue, environmental influence, temperature extremes and corrosive media. Case studies of design practices.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54238", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 304 with a grade of “C” or better."}, {"Course": "ENME 465", "Name": "Introductory Fracture Mechanics", "Credits": "3", "Description": "An examination of the concepts of fracture in members with pre-existing flaws. Emphasis is primarily on the mechanics aspects with the development of the Griffith theory and the introduction of the stress intensity factor, K, associated with different types of cracks. Fracture phenomena are introduced together with critical values of the fracture toughness of materials. Testing procedures for characterizing materials together with applications of fracture mechanics to design are treated.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54239", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have Senior standing in Mechanical Engineering and have a 2.0 or better GPA."}, {"Course": "ENME 471", "Name": "Computer Aided Finite Element Based Design", "Credits": "3", "Description": "This course introduces the method of finite elements as a tool for mechanical design. The concepts of geometry descritization and function interpolation are used in formulating the linear finite element equations. Various types of elements and general guidelines of finite element modeling are presented. The one-dimensional model is fully formulated, and aspects of nondimensional finite element modeling are presented. During the two-hour weekly labs, students are introduced to several finite element packages, such as the I-DEAS, ABAQUS and in-house DENDRO softwares. Emphasis is placed on the use of Integrated Design and Analysis Software (IDEAS), which is required for the completion of term design projects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54241", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must have Senior standing in Mechanical Engineering and have a 2.0 or better GPA."}, {"Course": "ENME 472", "Name": "Materials and Processes for Micro/Nanoscale Systems (MEMS)", "Credits": "3", "Description": "A fundamental course presenting key topics in materials and processing for the design and manufacture of micro and nano scale systems often called microelectromechanical systems (MEMS). Students will focus on understanding materials and microfabrication technologies commonly employed in these small scale systems. Material properties, parameters and their relationship with microfabrication processes, length scale and applications are discussed with regards to elastic and inelastic deformation, fracture, residual stress, fatigue, creep, adhesion, and stiction. Case studies on devices for sensing and actuation applications will be addressed to connect the course topics. Recommended Preparation: ENME 301, ENME 220 ", "Grading": "Graded", "Course ID": "100286", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENME 473", "Name": "Mechanical Design of Electronic Systems", "Credits": "3", "Description": "Design considerations in the packaging of electronic systems. Production of circuit boards and design of electronic assemblies. Vibration, shock, fatigue and thermal considerations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54242", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 304 and ENME 321 and ENME 360 all with a grade of “C” or better."}, {"Course": "ENME 475", "Name": "Robotics", "Credits": "3", "Description": "Basic engineering principles in the design and analysis of robots. Industrial applications of robots, Kenematics, dynamics and control of robotic manipulators as well as grasping mechanics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54243", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENME 360 and either CMPE 306 or ENEE 302 and have senior standing in Mechanical Engineering with a 2.0 or better GPA."}, {"Course": "ENME 480", "Name": "Engineering Experimentation", "Credits": "3", "Description": "One lecture and two laboratory periods a week. Theory of experimentation. Applications of the principles of measurement and instrumentation systems to laboratory experimentation. Experiments in fluid mechanics, solid mechanics and energy conversion. Selected experiments or assigned projects to emphasize planned procedure, analysis and communication of results, analogous systems and leadership. Recommended Preparation: Senior standing in mechanical engineering.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54244", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture"}, {"Course": "ENME 482L", "Name": "Vibrations/Controls Laboratory", "Credits": "2", "Description": "Methods and instrumentation for determining the vibration properties of mechanical systems. Various methods of spectral and modal analysis. Open-and closed-loop control experiments.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54245", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed ENME 360 and ENME 403 both with a grade of “C” or better."}, {"Course": "ENME 488", "Name": "Special Problems", "Credits": "3", "Description": "Advanced problems in mechanical engineering, with special emphasis on mathematical and experimental methods. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Permission of department chairman and senior standing in mechanical engineering.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54246", "Consent": "No Special Consent Required", "Components": "Independent Study", "Topics": "Future of Aging Tech"}, {"Course": "ENME 489", "Name": "Special Topics in Mechanical Engineering", "Credits": "3", "Description": "Selected topics of current importance in mechanical engineering. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts. Recommended Preparation: Senior standing and permission of department.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54247", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed all 300 level ENME courses with a grade of “C” or better and have senior standing with a 2.0 or better GPA."}, {"Course": "MCS 101", "Name": "Media Literacy", "Credits": "4", "Description": "This course is designed to help students critically engage with the media of communication, information, entertainment, and surveillance that surround us. Critical engagement includes understanding the history, political economy, and rhetorical power of these media. It also includes an introduction to the basic skills of multi-modal media production. Reading, writing, editing, composing, and publishing these traditional liberal arts skills are at the heart of this new media literacy, along with newer ones like remixing.", "Grading": "Graded", "Course ID": "101777", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "MCS 101L", "Name": "Multimedia Literacy Lab", "Credits": "1", "Description": "This one-credit lab section will provide students with basic skills in digital media production. Students will receive hands-on training on a variety of software including Final Cut Express, Garage Band and Photoshop. In addition students will gain experience with digital still cameras, video cameras and audio recording equipment. On completing this course students will be able to self-publish multimedia content in various formats, including DVD and online video.", "Grading": "Graded", "Course ID": "100224", "Consent": "No Special Consent Required", "Components": "Laboratory"}, {"Course": "MCS 144", "Name": "Professional Communication and Development", "Credits": "3", "Description": "This course is designed to introduce students to specific communication and presentation skills and re-sources required for success in the communities and workplaces of the 21st century. The course will introduce the various professional development services on campus, while providing students instruction and practice in communicating and networking in professional idioms and contexts. Assignments will help students create a professional identity, focusing on the refinement of oral presentation skills, drafting cover letters and resumes, and the creation of an e-portfolio highlighting their undergraduate accomplishments. MCS 144 will provide students with a valuable set of resources and skills that they can utilize in securing internships, applied experiences, and professional jobs, and succeeding at them.", "Grading": "Graded", "Course ID": "102379", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 222", "Name": "Introduction to Media & Communication Studies", "Credits": "3", "Description": "This course offers students an introduction to the critical perspectives and research methods that are central to the analysis of mass communication policy and programming, new media, interpersonal communication, and audience reception. The course will provide students the skills to design and apply a range of interdisciplinary concepts and methods to media analysis projects. Themes of the course will situate various forms of media within specific historical and cultural contexts.", "Grading": "Graded", "Course ID": "51254", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MCS 222H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MCS 222H", "Name": "Introduction to Media & Communication Studies", "Credits": "3", "Description": "This course offers students an introduction to the critical perspectives and research methods that are central to the analysis of mass communication policy and programming, new media, interpersonal communication, and audience reception. The course will provide students the skills to design and apply a range of interdisciplinary concepts and methods to media analysis projects. Themes of the course will situate various forms of media within specific historical and cultural contexts.", "Grading": "Graded", "Course ID": "100348", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MCS 222 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "MCS 311", "Name": "Films of Resistance", "Credits": "3", "Description": "This course provides a critical examination of cultural struggle through cinema. Popular media, and cinema in particular, are often media of the dominant culture, but this makes film a powerful tool for resistance. Films are artifacts documenting cultural struggle, change, and shifting ideologies. This course will examine films that reflect moments of cultural instability and related shifts in terms of race, class, sexuality, and gender. Students will gain the skills to critically analyze film and connect films within a larger context of culture and cultural change. Recommended Preparation: MCS 101 ", "Grading": "Graded", "Course ID": "102786", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 322", "Name": "Cultures of Surveillance", "Credits": "3", "Description": "Cultures of Surveillance focuses on critical analyses of surveillance: how it functions, what we expect it will do, and whether escaping it is desirable or even possible. Because surveillance affects almost everyone, albeit in very different ways, the course will emphasize the application of key theories and concepts to real-world problems, phenomena, and experiences. We will do this work through discussion, writing, reflection, and critical engagement with media. Recommended Preparation: MCS 222, MCS 333 ", "Grading": "Graded", "Course ID": "102864", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 326", "Name": "Media & Politics", "Credits": "3", "Description": "In this course, students examine the ways in which 21st-Century media institutions have transformed— and been transformed by—contemporary American politics. Subjects of study include theories of the press as they relate to the effective functioning of modern democracy. Students examine changes in the organizational structures and functions of media institutions and political institutions over time, and trace the effects of these developments to changes in the substance of contemporary political media content. Recommended Preparation: ENGL 100 ", "Grading": "Graded", "Course ID": "102787", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 326 "}, {"Course": "MCS 333", "Name": "History and Theory of Mass Communication and Media Studies", "Credits": "3", "Description": "This course will introduce students to the history of the discipline of mass communications and media studies, which have their origins in the sociology of “mass society” at the turn of the twentieth century in the US and Europe. The course will chart the shift from a “Mass Communications” approach emphasizing “media effects” approaches that merged in the 1970s as part of a larger shift in studies of human behavior and expressive culture. The course will consider the ways that changes in the technologies of communication, information, entertainment, and surveillance have helped to shape the paradigms under which scholars study audiences, messages, and culture. Further, the course will examine how these same changes have shaped the way producers think about and communicate with audiences.", "Grading": "Graded", "Course ID": "55394", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MCS 222 with a C or better."}, {"Course": "MCS 334", "Name": "Media & Globalization", "Credits": "3", "Description": "This course is designed to help students to learn about the global flows of media images and the networks, capital, and people that shape and are shaped by them. Students will study a broad range of case studies and investigate new media practices that will help them to become critically aware of the relationships between global mass media and transnational cultural, political, and economic institutions. Students will also develop learn how to analyze media practices comparatively.", "Grading": "Graded", "Course ID": "101813", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MCS 101 or MCS 222 or MCS 333 with a grade of ‘C’ or better."}, {"Course": "MCS 345", "Name": "Virtual Ethnography and Digital Life", "Credits": "3", "Description": "This course introduces students to the social scientific theories, techniques, and applications of virtual and digital ethnography. Our readings range from academic books focused on international connectivity, to professionals’ use of ethnographic methods for social media design. We will focus on developing research and writing strategies that capture the empirical and ethical complexity of understanding and representing peoples’ digital lives and virtual experiences.", "Grading": "Graded", "Course ID": "102521", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MCS 101  or MCS 222  with  a C or better."}, {"Course": "MCS 355", "Name": "Social Media: Networking and Mobility.", "Credits": "3", "Description": "This course is designed to encourage students to critically engage with the growing role that social media, online networks, and mobile communication technologies play in their understanding of self and community, sociability and privacy. Students will reflect on the centrality of collaboration, networking, and participation in social media technologies. Assignments and readings will require students to interact with core questions surrounding the emergence of social media and the impact of living increasingly mediated lives. Special attention will be paid to the centrality of writing in a digital world, even as the platforms for composition, editing, and publication have changed.", "Grading": "Graded", "Course ID": "101852", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete MCS 101 or MCS 222  and also ENGL 100  with a grade of ‘C’ or better."}, {"Course": "MCS 366", "Name": "Podcasting", "Credits": "3", "Description": "This course instructs students in sound-gathering, interviewing, script writing, and audio editing, contextualized in the history of audio journalism and storytelling. Students will learn to think critically about the media they consume and the ethics of telling other people’s stories. By the end of the semester students will research, write, record, and edit a documentary - style audio story. Professional writers and audio producers will visit for guest lectures and coaching. Recommended Preparation:  MCS 101 ", "Grading": "Graded", "Course ID": "102659", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 370", "Name": "Special Topics in Media and Communication Studies", "Credits": "3", "Description": "A study of key concepts, skills, or themes in the areas of media and communication studies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: MCS 222 ", "Grading": "Graded", "Course ID": "55395", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 377", "Name": "Desktop Publishing and the Web", "Credits": "3", "Description": "An introduction to desktop publishing on the Macintosh platform. The course will focus on the Adobe Design software. The course will aid students in solving design problems and developing skills in visual communication. Students will develop skills in vector and raster graphics and develop a website as well as become familiar with the use of the graphics in desktop publishing.", "Grading": "Graded", "Course ID": "100014", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 388", "Name": "Modern Public Relations", "Credits": "3", "Description": "This course is designed to introduce students to the key skills and insights of public relations engagement using traditional and social media in the non-profit, corporate and agency worlds. Students will examine real-life case studies and crisis communications strategies; analyze topical public relations issues; and review the industry’s code of ethics. Recommended Preparation: MCS 101 or MCS 222.", "Grading": "Graded", "Course ID": "102137", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 390", "Name": "Transcultural Studies in Global Television", "Credits": "3", "Description": "This course will study the concepts, institutions, distribution channels, production and marketing practices, products and audience reception of globally distributed television programming. Special emphasis will be placed on localization strategies, aesthetic conventions and genre traditions, notions of cultural proximity, and debates around hybridity and transculturality. Students enrolled in MLL 480 will be expected to have advanced foreign language proficiency and will be expected to examine foreign language television productions and discuss issues in the secondary literature in that language. MLL 480  students will need department consent to take the course. Recommended Preparation: MCS 333 ", "Grading": "Graded", "Course ID": "100677", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 480 ", "Prerequisite/Corequisite": "You must have completed MCS 222 with a C or better."}, {"Course": "MCS 395", "Name": "Television Production Techniques I", "Credits": "3", "Description": "Development of skills pertaining to the operation of cameras, recorders, control consoles, lighting instruments and general operating procedures. Each student gains experience as a team member of on-campus TV productions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52388", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ART 395 "}, {"Course": "MCS 399", "Name": "Methods in Media and Communication Studies", "Credits": "3", "Description": "An introduction to interdisciplinary methods of gathering, analyzing, and presenting information used in media and communication studies research. Students will learn the theoretical assumptions behind, and rationales for, interdisciplinary methodologies. Students will establish a vocabulary for methodological approaches to research; analyze the usefulness and limits of certain qualitative and interpretive methods; examine the nature of research questions served by different methods; and design a methodologically rigorous research project. Recommended Preparation: MCS 333 ", "Grading": "Graded", "Course ID": "102518", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MCS 101 and MCS 222  with a ‘C’ or better."}, {"Course": "MCS 400", "Name": "Independent Projects in Media and Communication Studies", "Credits": "1", "Description": "Independent projects are designed and the number of credits determined by individual students in consultation with an advisor or instructor. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "55396", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "MCS 404", "Name": "Internship", "Credits": "3", "Description": "For students interested in an introductory internship experience. Students are expected to commit 40 hours a semester per credit. For example, for three credits, the expectation would be 120 hours of field work. The internship allows students to apply academic concepts and ideas to a work environment. Interested participants must see a Media and Communication Studies faculty member before registering. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: Permission of instructor", "Grading": "Pass/Fail", "Course ID": "55397", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "MCS 406", "Name": "Theory and History of Intercultural Media", "Credits": "3", "Description": "This course traces the historical and stylistic evolution of documentary and other film genres, including ethnographic and feature films, while exploring the use of these as a conduit for intercultural communication. Students will view intercultural film and video projects of the invited filmmakers. Reading selected texts will help inform the discussion and analysis of what constitutes the genre “intercultural film”.  Recommended Preparation:  MCS 334  or MCS 390 ", "Grading": "Graded", "Course ID": "055473", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 406 "}, {"Course": "MCS 407", "Name": "Political Writing", "Credits": "3", "Description": "Political Writing introduces students to writing within the professions of politics, public policy and political communications. Students learn to write both as surrogates on behalf of principals as well as in their own voice. Among other assignments, students learn how to write op-eds, campaign ads, policy papers, and campaign speeches. Recommended Preparation: Completion of the Writing Intensive (WI) Requirement", "Grading": "Graded", "Course ID": "102694", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MCS 484", "Name": "Media Production Fellows", "Credits": "3", "Description": "This selective seminar style course will provide students with an advanced applied experience in video field production. Working as part of a production team, students will in create a professional quality video focusing on topics drawn from communities in the Baltimore area. While refining skills in pre-production research, field production and postproduction, students will gain experience in community engagement and in working with local informants as collaborators in telling their story. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "102151", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MCS 395 or MLL 495 "}, {"Course": "MCS 495", "Name": "Video Ethnography", "Credits": "3", "Description": "This course uses video production as a method of exploring the social world. Students will work closely with community members in Baltimore as collaborators in telling their stories as they create short documentaries that amplify community voices. Emphasis is placed on reflective and participatory documentary methods and the use of video as a qualitative research tool. Students will gain experience in video field production techniques including video cameras and DSLR operation, lighting, sound and post-production.  ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "055478", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 495 "}, {"Course": "MCS 499", "Name": "Capstone Senior Seminar", "Credits": "3", "Description": "The Capstone Experience Seminar encourages students to integrate the subject matter and interdisciplinary methods of the major by focusing on a significant problem in the study media and communications studies. Emphasis is placed upon the involvement of students in both the process and content of cultural analysis and interpretation. Importantly, the form that students” projects take may be either traditional research paper or a new media production, for example a digital story telling project. Recommended Preparation: MCS 222, MCS 333 ", "Grading": "Graded", "Course ID": "55398", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MCS 333 with a C or better."}, {"Course": "MLL 190", "Name": "The World of Language: Structural and Biological Aspects", "Credits": "3", "Description": "Language as a distinctive characteristic of the human species. In this course, we examine the structure of both written and spoken forms of language across cultures, comparing them with animal communication and human gestural systems. We explore language’s neurological basis, theories of origin, and first-and second-language learning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50095", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MLL 190H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "ENGL 190, LING 190 "}, {"Course": "MLL 190H", "Name": "The World of Language I-Honors", "Credits": "3", "Description": "Language as a distinctive characteristic of the human species. In this course, we examine the structure of both written and spoken forms of language across cultures, comparing them with animal communication and human gestural systems. We explore language’s neurological basis, theories of origin, and first- and second-language learning. This is an honors course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100141", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "LING 190 , ENGL 190 "}, {"Course": "MLL 191", "Name": "The World of Language: Cultural and Social Aspects", "Credits": "3", "Description": "Language as both a reflection and a determiner of social relationships. In this course, we examine the varying idioms of the scientist, the politician, the media, the poet, the child and the magician, and we investigate how language changes and how it marks social groups. Communication strategies and social taboos reflected in language are discussed for various cultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50073", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "ENGL 191, LING 191 "}, {"Course": "MLL 205", "Name": "Great Books from the French-Speaking World", "Credits": "3", "Description": "The course will examine the culture of the French-speaking world as reflected in the works of such writers as Chretien de Troyes and Marie de France (medieval romances); Rabelais and Montaigne (Renaissance); Racine, Moliere (17th century); Rousseau, Voltaire (18th century); Balzac, Hugo, Sand, Flaubert (19th century); Proust, Sartre, Beauvoir, Césaire, Hébert (20th century). Taught in English. No French required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55418", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 206", "Name": "Great Books from the German-Speaking World", "Credits": "3", "Description": "The course will focus on the culture of the German-speaking world, as reflected in the works of such writers as Goethe, Schiller, Heine, Kleist, Brecht, Boll, Seghers, Grass and Wolf. Taught in English. No German required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55419", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 207", "Name": "Great Books from Russia and the Soviet Union", "Credits": "3", "Description": "This course will focus on cultural issues in Russian and Soviet literature, as reflected in major works of Gogol, Dostoyevsky, Tolstoy, Chekhov, Mayakovsky, Babel, Akhmatova, Tsvetaeva and Solzhenitsyn, among others. Taught in English. No Russian required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55420", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 208", "Name": "Great Books from the Spanish Speaking World", "Credits": "3", "Description": "An introduction to literary traditions and cultural diversity of Spain and Spanish America through great literary works in translation. Readings (primarily narrative fiction) selected from works of such representative authors as Santa Teresa, Miguel de Cervantes, Benito Perez Galdos, Miguel de Unamuno, Jorge Luis Borges, Ana Maria Matute and Gabriel Garcia Marquez. Taught in English. No Spanish required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55421", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 209", "Name": "Great Books from Italy", "Credits": "3", "Description": "An introduction to literary and cultural traditions of Italy through an examination of works by Italian authors. Readings, including fiction, drama, essay and poetic narrative, to include selected works from such representative authors as St. Francis, Marco Polo, Dante Alighieri, Boccaccio, Machiavelli, Cellini, Goldoni, Casanova, Manzoni, Pirandello, Pavese and Calvino. Taught in English. No Italian required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55422", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 210", "Name": "Africa: Culture and Development", "Credits": "3", "Description": "This course provides a general introduction to Africa. It is designed to survey its peoples, languages, cultures, societies and development. An emphasis is placed on how language and development are interrelated. Modules are offered to students to build on their special interests in the continent.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50005", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "AFST 213"}, {"Course": "MLL 211", "Name": "Postwar West European Cinema", "Credits": "3", "Description": "Introduction to the major schools of post-war Western European cinema, including Italian neorealism, the new Italian cinema, the French new wave and the new German cinema. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55424", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 212", "Name": "East European Cinema", "Credits": "3", "Description": "Introduction to the major schools of Eastern European cinema, including classical and contemporary Soviet cinema, the Polish school and the Czech new wave. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55425", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 213", "Name": "Film and Society in Spain", "Credits": "3", "Description": "An examination of recent Spanish films and of social questions they reflect and address. Taught in English. No knowledge of Spanish is required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55426", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 214", "Name": "The New German Cinema", "Credits": "3", "Description": "A study of the new German cinema, its culture, background and works by internationally acclaimed directors Alexander Kluge, Werner Herzog, Wim Wenders and Margarethe von Trotta. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55427", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 215", "Name": "French Film Classics", "Credits": "3", "Description": "An introduction to the classic films of French cinema in the context of French culture and society. Representative directors include Vigo, Clair, Carne, Renoir, Truffaut, Godard, Rohmer, Chabrol and Malle. Taught in English. No knowledge of French required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55428", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "MLL 216", "Name": "Classics in German Cinema", "Credits": "3", "Description": "Study of the major works of German cinema, from the beginnings to the present, as reflections of German culture. Taught in English. Knowledge of German is not required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55429", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 217", "Name": "Classics in Russian Film", "Credits": "3", "Description": "An examination of masterworks of Soviet cinema and the social and political context they reflect and address. Taught in English. Knowledge of Russian is not required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55430", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 218", "Name": "Film and Society in Latin America", "Credits": "3", "Description": "An examination of recent Latin-American films and of social questions they reflect and address. Taught in English. Knowledge of Spanish is not required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55431", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 219", "Name": "Contemporary French Cinema", "Credits": "3", "Description": "Contemporary French cinema is an introduction to popular French films of the last 25 years. It charts recent developments in all genres of French cinema. Reflecting the diversity of French film production since the new wave, this course will examine a variety of genres from the thriller to the war movie alongside the cinema du look and the work of women filmmakers. Directors will include Luc Besson, Jean-Jacques Beinex, Claude Berri, Yves Robert, Diane Kurys, Agnes Varda, Maurice Pialat, Jean-Marie Poiret and Coline Serreau. Taught in English. No knowledge of French required. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55432", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp French Cinema, Images Of Society", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 220", "Name": "Film and Society in China", "Credits": "3", "Description": "This course introduces students to Chinese society during the last hundred years through the viewing and analysis of major films from China, Taiwan, and Hong Kong. Taught in English. No knowledge of Chinese required.", "Grading": "Graded/Pass Fail", "Course ID": "55433", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 225", "Name": "Iranian Cultures", "Credits": "3", "Description": "The course will address the general concept of culture in the context of social, intellectual, artistic, spiritual, and everyday systems defining Iranian life. Students will read from several books, listen to Persian music, view Iranian movies, taste the cuisine, read translated poetry books, and learn conversational Persian language. They will also examine Iranian magazines and newspapers and will benefit from discussions. The course will broaden their understanding of culture in general, and Iranian culture in particular.", "Grading": "Graded", "Course ID": "55435", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "MLL 230", "Name": "World Language Communities", "Credits": "3", "Description": "A course designed to expand the cultural awareness of students by introducing them to the study of language in a broad context of historical, political and social issues. Special emphasis is placed on the question of bi- or multi-lingual states and on the explosiveness of the language issue in many regions. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50198", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "LING 230"}, {"Course": "MLL 231", "Name": "Introduction to World Literature I", "Credits": "3", "Description": "An introduction to major works in world literature from the Middle Ages to the Renaissance.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50055", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 231, ENGL 231"}, {"Course": "MLL 232", "Name": "Introduction to World Literature II", "Credits": "3", "Description": "An introduction to major works in world literature from the late Renaissance to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50057", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 232, ENGL 232"}, {"Course": "MLL 234", "Name": "Culture and Values through Art I", "Credits": "3", "Description": "This interdisciplinary course examines the early heritage of today’s multicultural world from a global perspective. It explores world views and cultural values through art as the medium of communication. Social beliefs, values and art from cultures of Asia, Africa, the Native Americas, the Islamic world and Europe from 50,000 B.C.E. to 1400 C.E. are traced comparatively, including their overlays, convergences and separate developments. Students collaborate in research and participate in experiential exercises relating course content to issues of cultural identity, cultural awareness, globalization and pluralistic societies. Note: May be taken independently from Part II.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55436", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MLL 234H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "MLL 235", "Name": "Culture and Values through Art II", "Credits": "3", "Description": "This interdisciplinary course examines the heritage of today’s multicultural world from a global perspective. The course explores the world views, values and art from cultures of Asia, Africa, the Native Americas, the Islamic World, Europe and the United States from the 14th to the 20th centuries. Students collaborate in research and participate in experiential exercises relating course content to issues of cultural identity, cultural awareness, globalization and pluralistic societies. Note: May be taken independently from Part I.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55438", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "MLL 240", "Name": "Project in Cultural Sustainability", "Credits": "3", "Description": "This course has been designed to help UMBC students acquire the cultural literacy and develop the tools they will need to face the challenges of globalization. Adopting an intercultural approach, it will examine the ongoing impact of the Western value system on the world. In response, students will learn how to analyze the impact of globalization on local communities and consider alternatives. They will also develop the social entrepreneurship skills needed to position themselves as agents of social change. Because local community involvement is an important element in the development of cultural diversity, heritage, and a deeper appreciation of life values, students in the course will generate a community information web site reflecting the values of sustainability.", "Grading": "Graded", "Course ID": "100203", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 250", "Name": "Introduction to the French-speaking World", "Credits": "3", "Description": "A historical and cultural presentation of societies in which French plays a major role, including France, Belgium, Switzerland, Quebec, North and West Africa, Asia and the Caribbean. The points of view of French speakers from around the world will be on such themes as political and cultural conflict, literary creativity and music. Readings and discussions are in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55441", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 255", "Name": "Intercultural Paris", "Credits": "3", "Description": "This culture course aims to introduce students to the field of French studies by examining France’s capital city in both historical and contemporary contexts and the numerous, marginalized, and multicultural populations it has been home to: women, gays and lesbians, North-and Western African immigrants, Jews, and undocumented workers. The course adopts an interdisciplinary approach informed by cultural studies, history, anthropology, linguistics, urban studies, and gender and women’s studies.", "Grading": "Graded", "Course ID": "100973", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 255"}, {"Course": "MLL 261", "Name": "German Ethnic and Cultural Identity", "Credits": "3", "Description": "This course will study the cultural identity of the German-speaking world, including Europe, as well as German groups in North America, Latin America and Africa, as manifested in writing, music and other forms of cultural expression", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55442", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 270", "Name": "Introduction to Russian Culture and Civilization", "Credits": "3", "Description": "An introductory survey of Russian cultural achievements from the 10th century to the revolution of 1917. Topics include religion, art, architecture, music, literature and folklore. Readings and discussions in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50192", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "RUSS 270"}, {"Course": "MLL 271", "Name": "Introduction to Modern Russian Civilization and Culture", "Credits": "3", "Description": "An introductory survey of Russian civilization from 1917 through the revolutionary period and Stalinism to dissidence, glasnost and the present. Topics include literature, art, music, social values and intellectual expression. Readings and discussions in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50206", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "RUSS 271"}, {"Course": "MLL 280", "Name": "Introduction to the Spanish-Speaking World", "Credits": "3", "Description": "A historical overview and cultural analysis of societies in which Spanish is the dominant language, including Spain, Latin America and Hispanic communities in the United States. Intended primarily to provide greater insights into the realities experienced by speakers of Spanish.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55444", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "MLL 288", "Name": "Information Technology in Foreign Languages", "Credits": "3", "Description": "This course is designed to familiarize students with technological resources in foreign languages and to prepare them in the effective use of technology approaches and technology-based resources. Activities will include assessing and using software with foreign language capabilities, mastering general Internet tools (File Transfer Protocol, listservs, news groups, etc.), accessing electronic library resources, conducting effective searches on the Web, including the retrieval of text files and images with particular attention to copyright issues. Participants will have the opportunity to develop and/or expand the knowledge base and skills inherent to information technology and indispensable to learning and practicing a foreign language today. Recommended Preparation: Word-processing skills/e-mail on the UMBC system", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55445", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MLL 299", "Name": "MLLI Experiential Learning", "Credits": "1", "Description": "Independent, individualized language and cultural study (such as participation in Intercultural Learning Exchange activities) in an area determined by the student’s particular needs. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Pass/Fail", "Course ID": "101767", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "MLL 300", "Name": "Selected Topics in Modern Languages and Linguistics", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55446", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Early Chinese Poetry and Prose, Modern Chinese Poetry, Colombian Caribbean Culture, Modern Chinese Culture"}]