[{"Course": "ENGL 106", "Name": "The Grammars of Speaking and Writing", "Credits": "2", "Description": "An introduction to speech/prose grammars, with an intensive review of grammatical forms and functions. This course will emphasize the structure of English as it is classified in traditional grammar.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54036", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 107", "Name": "Grammar Lab I", "Credits": "1", "Description": "Introductory-level, self-paced grammar instruction. Students will complete exercises in the department’s writing lab and demonstrate their progress on several mastery tests and a cumulative final exam.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54038", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 107E", "Name": "Grammar Lab I for ESL Students", "Credits": "1", "Description": "Introductory-level, self-paced grammar instruction. Students will complete at least five essays and grammar exercises and have individual conferences with the instructor. A file will be kept on each student to record his or her progress.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54039", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 108", "Name": "Grammar Lab II", "Credits": "1", "Description": "Intermediate-level, self-paced grammar instruction. Students will complete exercises in the department’s writing lab and demonstrate their progress on several mastery tests and a cumulative final exam.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54040", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 108E", "Name": "Grammar Lab II for ESL Students", "Credits": "1", "Description": "Intermediate-level, self-paced grammar instruction. Students will complete at least five essays and grammar exercises and have individual conferences with the instructor. A file will be kept on each student to record his or her progress.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54041", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 109", "Name": "Grammar Lab III", "Credits": "1", "Description": "Advanced-level, self-paced grammar instruction. Students will complete exercises in the department’s writing lab and demonstrate their progress on several mastery tests and a cumulative final exam.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54042", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 109E", "Name": "Grammar Lab III for ESL Students", "Credits": "1", "Description": "Advanced-level, self-paced grammar instruction. Students will complete at least five essays and grammar exercises and have individual conferences with the instructor. A file will be kept on each student to record his or her progress.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54043", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENGL 110", "Name": "Composition for ESL Students", "Credits": "4", "Description": "A composition course for students whose first language is not English. Course work will emphasize academic essay patterns and writing techniques. Students may be assigned additional grammar work if necessary. Recommended Preparation: In consultation with an advisor, a student will self-place into ENGL 110. Note: ENGL 110 is the equivalent of ENGL 100, a university graduation requirement. It must be passed with a “C” or better. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50080", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Course Equivalents": "ENGL 100, ENGL 100A, ENGL 100C, ENGL 100H, ENGL 100P, ENGL 100Y ", "Attributes": "English Composition (GEP), English Composition (GFR)"}, {"Course": "ENGL 110Y", "Name": "Composition ESL Students", "Credits": "4", "Description": "A composition course for students whose first language is not English. Course work will emphasize academic essay patterns and writing techniques. Students may be assigned additional grammar work if necessary. Recommended Preparation: In consultation with an advisor, a student will self-place into ENGL 110Y Note: ENGL110Y is the equivalent of ENGL 100 and ENGL 110, a university graduation requirement. It must be passed with a “C” or better.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101980", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "English Composition (GEP), English Composition (GFR)"}, {"Course": "ENGL 190", "Name": "The World of Language I", "Credits": "3", "Description": "Language as a distinctive characteristic of the human species. In this course, we examine the structure of both written and spoken forms of language across cultures, comparing them with animal communication and human gestural systems. We explore language’s neurological basis, theories of origin, and first- and second-language learning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50095", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MLL 190H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "LING 190, MLL 190 "}, {"Course": "ENGL 191", "Name": "The World of Language II", "Credits": "3", "Description": "Language as both a reflection and a determiner of social relationships. In this course, we examine the varying idioms of the scientist, the politician, the media, the poet, the child and the magician, and we investigate how language changes and how it marks social groups. Communication strategies and social taboos reflected in language are discussed for various cultures. Although this course continues work begun in The World of Language I, it is designed so that students can easily enter MLL 191 without having taken MLL 190.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50073", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "LING 191, MLL 191 "}, {"Course": "ENGL 200", "Name": "Language and Scientific Value", "Credits": "3", "Description": "A study of language in selected major literary texts compared to the various media of scientific theory. We ask in what ways a poem, play or novel might be related to such creations of modern science as Newton’s mechanics, Darwin’s evolution, Freud’s psychoanalysis or Einstein’s relativity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54044", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "ENGL 202", "Name": "Language and Aesthetic Value", "Credits": "3", "Description": "A study of language in its broad sense as a system that establishes and exchanges meaning. Students will examine the idea of aesthetic value and the organizational principles of discourse in terms of aesthetic standards of judgement such as proportion, coherence, process, balance and pleasure.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54045", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "ENGL 206", "Name": "Introduction to World Literature and History", "Credits": "3", "Description": "An introduction to major works in world literature from ancient times to the 20th century. The course will include readings from the Bible, Plato, Greek tragedy, Dante, Shakespeare and selected modern writers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54046", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "ENGL 209", "Name": "American Literature for ESL Students", "Credits": "3", "Description": "Students whose first language is not English study American literature, especially contemporary novels and short stories, as a means to understand our culture and language better. The texts assigned for this course are not modified, though extensive vocabulary and grammar work may precede each assignment. Students interpret each reading and support their view in writing and during class discussions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54048", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 210", "Name": "Introduction to Literature", "Credits": "3", "Description": "An introduction to the conventions and characteristics of the major genres of literature - prose, poetry and drama. Some attention also may be given to film, television and other materials. This course is intended primarily for non-majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54049", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 218", "Name": "Remix Culture and Composing", "Credits": "3", "Description": "This course explores the remix as a transformative compositional practice. Though the concept of remixing is part of a long, artistic tradition, remix raises questions about originality, creativity, and the ethical and legal implications of twenty-first century forms of composition. Students will analyze and engage in remixing in order to cultivate an understanding of composing as always a process of recomposing.", "Grading": "Graded", "Course ID": "102481", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 220", "Name": "Composing Disability", "Credits": "3", "Description": "This course provides an introduction to disability studies, focusing specifically on the role of the body in writing and communication practices. In addition to engaging with critical readings about bodies-with an emphasis on how disability intersects with race, class, gender, and sexuality-students will examine representations of the body in contemporary media to enrich their understanding of what kinds of bodies are included and excluded in scholarly and popular discourse.", "Grading": "Graded", "Course ID": "102482", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 226", "Name": "Grammar and Usage of Standard English", "Credits": "3", "Description": "This course introduces students to various approaches to grammar:  standard prescriptive grammar derived from Latin and still found in Standard Written English handbooks, descriptive grammar approach of linguists, and some transformational (generative) grammar.  Students will learn to analyze sentence formats, identify syntactical functions of words in sentences, and make knowledgeable choices about sentence construction.  Students will also learn how knowledge of grammar creates stylistic choices and also assists in understanding meaning.  English 226 promotes the analysis of social and political uses of language.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54053", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 231", "Name": "Introduction to World Literature I", "Credits": "3", "Description": "An introduction to major works in world literature from the Middle Ages to the Renaissance.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50055", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 231, MLL 231"}, {"Course": "ENGL 232", "Name": "Introduction to World Literature II", "Credits": "3", "Description": "An introduction to major works in world literature from the late Renaissance to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50057", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 232, MLL 232"}, {"Course": "ENGL 233", "Name": "Issues in World Literature", "Credits": "3", "Description": "Readings in selected literary themes, with emphasis most often on modern literature. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54054", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Magic Realism, Individual & Collective Resistance to Oppression"}, {"Course": "ENGL 240", "Name": "Writing for Social Change", "Credits": "3", "Description": "This course explores the dynamic and important genre of writing that has social change as its goal. The course examines the forms and strategies found in this genre as well as its long and influential history. Students will read and analyze a variety of print and digital texts. They will also compose their own work in the genre.", "Grading": "Graded", "Course ID": "102790", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "ENGL 241", "Name": "Currents in British Literature", "Credits": "3", "Description": "This course, intended primarily for non‐majors, introduces students to past and present trends in British literature. The emphasis will be on major figures and/or important movements in English literature. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54055", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Industrial Revolution, Love And Lyric Tradition, 19Th Century Monster, Beauty Pleasure Dec Imag, English At Home & Abroad, King Arthur Of Britain, Mythologies Of North, Modern British Novel, Victorian Markets & the Victorian Consumer, Shakespeare on Film, The British King Arthur, Robin Hood in Legend and Film, The Gothic Novel, Harry Potter, Children in 19th Century Literature and Culture, Arthurian Literature, Swords and Sorcery, Love in Early English Literature, Pride and Prejudice Ever After", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 243", "Name": "Currents in American Literature", "Credits": "3", "Description": "This course, intended primarily for non‐majors, introduces students to past and present trends in American literature. Emphasis will be on major figures and/or important movements in American literature. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54056", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 243H ", "Topics": "Top:The American Novella, The Comic Book, Top In Jewish Amer Lit, 20Th Cent American Novel, Top:Adv In Amer Lit, Science Fiction, American Novels, The Comic Book As Lit, Diverse Voices, Currents:Lit Of Baseball, 20Th C American Novel, Southern Literature, The Transcendentalists, 20Th Century Amer Novel, Intergatng Identity On Stg, Currents:American Heroes, Amer Lit:Cont Amer Poets, Crnts Am Lit:Sthrn Wrtrs, Cur Amer Lit:Transcenden, Comic Book As Literature, Comic Book Literature, On The Road In Amer Lit, American Lit On The Road, Growing Up In America, Top:2Oth C Amer Novel, Currents In American Lit, Thermonuc War Film/Fict, The Short Novel, Native American Lit, Versions Of Amer Dream, The American Novella, Images Of Otherness, Writers Look At War, Writers At War, Amer Lit Of Vietnam War, Heritage/Expansion/Explo, Ecology & American Lit, America On The Road, Native Amer Lit/Culture, Native Amer Literature, Currents In Amer Lit, Literature Of War, Immigrant and Ethnic Fiction i, Classic Sports Books of the 20, Reconstructing American Identity, American Dreams and Nightmares, Time Travel Literature, The Outsider in Literature and Film, Film,Literature and Exclusion, Apocalypse and Zombie Literature, Currents in American Literature, Modern American Crime Narratives, The Harlem Renaissance, American Road Trip, Contemporary American Poetry, Reimagining the American Family", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 243H", "Name": "Currents in American Literature", "Credits": "3", "Description": "This course, intended primarily for nonmajors, introduces students to past and present trends in American literature. Emphasis will be on major figures and/or important movements in American literature. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102300", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 243 ", "Topics": "Top:The American Novella, The Comic Book, Top In Jewish Amer Lit, 20Th Cent American Novel, Top:Adv In Amer Lit, Science Fiction, American Novels, The Comic Book As Lit, Diverse Voices, Currents:Lit Of Baseball, 20Th C American Novel, Southern Literature, The Transcendentalists, 20Th Century Amer Novel, Intrgatng Idntity On Stg, Currents:American Heroes, Amer Lit:Cont Amer Poets, Crnts Am Lit:Sthrn Wrtrs, Cur Amer Lit:Transcenden, Comic Book As Literature, Comic Book Literature, On The Road In Amer Lit, American Lit On The Road, Growing Up In America, Top:2Oth C Amer Novel, Currents In American Lit, Thermonuc War Film/Fict, The Short Novel, Native American Lit, Versons Of Amer Dream, The American Novella, Images Of Otherness, Writers Look At War, Writers At War, Amer Lit Of Vietnam War, Heritage/Expansion/Explo, Ecology & American Lit, America On The Road, Native Amer Lit/Culture, Native Amer Literature, Currents In Amer Lit, Literature Of War, Immigrant and Ethnic Fiction i, Classic Sports Books of the 20, Reconstructing American Identity, American Dreams and Nightmares, Time Travel Literature, The Outsider in Literature and Film, Film,Literature and Exclusion, Apocalypse and Zombie Literature, Currents in American Literature, Modern American Crime Narratives, The Harlem Renaissance, American Road Trip, Contemporary American Poetry, Reimagining the American Family", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 250", "Name": "Introduction to Shakespeare", "Credits": "3", "Description": "An introduction to the times and art of Shakespeare through the study of a selection of major plays. Students will be given background information necessary to an understanding of the works. The emphasis of the course will be on making Shakespeare and the dramatic form accessible.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54058", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 250H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 250H", "Name": "Introduction to Shakespeare - Honors", "Credits": "3", "Description": "An introduction to the times and art of Shakespeare through the study of a selection of major plays. Students will be given background information necessary to an understanding of the works. The emphasis of the course will be on making Shakespeare and the dramatic form accessible.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54059", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 250 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "ENGL 260", "Name": "Black Literature to 1900", "Credits": "3", "Description": "A critical introduction to representative oral and written literature by primarily black writers in the Americas and in Africa, from the earliest times to the end of the 19th century. Attention will be given to ways in which blacks have reflected their changing roles and fortunes in their literature, as well as to perceptions of blacks by other races and cultures as expressed in literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50023", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 260"}, {"Course": "ENGL 261", "Name": "Black Literature: Twentieth Century", "Credits": "3", "Description": "The development of black literature of the Americas and of Africa in the 20th century. Emphasis on such topics as race pride and consciousness, the Harlem Renaissance, Negritude, the new black consciousness, literature of exile, folk themes in modern writings, interconnections between writers from different regions and hemispheres, and cross-currents between black literature and other literatures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50012", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 261 "}, {"Course": "ENGL 271", "Name": "Introduction to Creative Writing - Fiction", "Credits": "3", "Description": "An introduction to the writing of prose fiction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54063", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better to take this course."}, {"Course": "ENGL 272", "Name": "Introduction to Creative Writing-Scriptwriting", "Credits": "3", "Description": "An introduction to scriptwriting, with variable emphasis on drama, film, television, radio and interactive multimedia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54064", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better to take this course."}, {"Course": "ENGL 273", "Name": "Introduction to Creative Writing - Poetry", "Credits": "3", "Description": "An introduction to writing poetry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54065", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better to take this course."}, {"Course": "ENGL 281", "Name": "Intermediate Exposition", "Credits": "4", "Description": "An intermediate writing course for students who have completed a first-year composition course, but who feel they need additional preparation before taking ENGL 391 or ENGL 393. Students will compose reviews, summaries and short expository papers that integrate primary and secondary research. Coursework includes advanced syntax and the proper citation of source material.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54066", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 290", "Name": "Impromptu Writing", "Credits": "1", "Description": "This course is designed to help students develop skills and utilize techniques and approaches for completing “on the-spot” writing assignments, such as in-class essay exams, job application questions and fast-turnaround memos (or other short job-related writing assignments that must be completed and delivered in a very brief period of time).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54068", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 291", "Name": "Introduction to Writing Creative Essays", "Credits": "3", "Description": "An introduction to the fundamentals of composing creative essays, emphasizing structure, diction and narrative development. Students will write a series of essays, which may include narrative, descriptive, expository and research assignments.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54069", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 300", "Name": "Texts and Contexts", "Credits": "3", "Description": "This course exposes students to critical traditions and techniques in the analysis of a wide variety of texts, including those produced in professional, academic, and domestic settings. Central to this analysis will be consideration of the historical contexts in which these texts are created and experienced, and the people and tools involved in these processes. Students enrolled in the course will gain insights to the rhetorical dimension of communication by examining how texts composed in various media - oral, written, visual, blended - are produced, responded to, circulated, and adapted to new purposes. Students will be required to produce texts using various sorts of media.", "Grading": "Graded", "Course ID": "54070", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 301", "Name": "Analysis of Literary Language", "Credits": "3", "Description": "An introduction to the study of literary texts for English majors and prospective English majors. The course focuses on the nature and special qualities of literary language to provide the student with the critical skills required for intensive literary study. Particular attention will be given to techniques of close reading and critical analysis.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54071", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better and ENGL 100 with a C’ or better."}, {"Course": "ENGL 302", "Name": "Literary Methodologies and Research", "Credits": "3", "Description": "An introduction to contemporary literary theories and methodologies for English majors in the Literature Track. Students will acquire an understanding of the basic theoretical concepts underlying contemporary approaches to literature. This course will build upon the skills acquired in ENGL 301, and familiarize students with the process of conducting literary research.", "Grading": "Graded", "Course ID": "54072", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 301 with a grade of C or better."}, {"Course": "ENGL 303", "Name": "The Art of the Essay", "Credits": "3", "Description": "An examination of the essay as an art form, combining the study of essays as literary texts with the writing of narrative, expository and research papers. The course emphasizes the history and evolution of the essay, from its origins to contemporary trends in the form.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54073", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 304", "Name": "British Literature: Medieval and Renaissance", "Credits": "3", "Description": "An examination of selected texts by major British authors from Old English through Milton.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54074", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 305", "Name": "British Literature: Restoration to Romantic", "Credits": "3", "Description": "An examination of selected texts by major British authors from the Restoration through the early 19th century.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54075", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 306", "Name": "British Literature: Victorian and Modern", "Credits": "3", "Description": "An examination of selected texts by major British authors from the Victorian era through the early 20th century.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54076", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 307", "Name": "American Literature: from New World Contact to the Civil War", "Credits": "3", "Description": "An examination of selected texts by major American authors from the colonial period through the Civil War.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54077", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 308", "Name": "American Literature: The Civil War to 1945", "Credits": "3", "Description": "An examination of selected texts by major American authors from the Civil War period through World War II.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54078", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 310", "Name": "Topics in Poetry", "Credits": "3", "Description": "An examination of poems chosen to represent a particular type of poetry, a given historical period or the works of selected poets. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54079", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 312", "Name": "Topics in Fiction", "Credits": "3", "Description": "An examination of works of fiction chosen to represent a particular type, a given historical period or selected writers. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54081", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200-level ENGL course with a C or better."}, {"Course": "ENGL 314", "Name": "Topics in Drama", "Credits": "3", "Description": "An examination of plays chosen to represent a particular type of drama, a given historical period or the works of selected playwrights. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54082", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 315", "Name": "Studies in World Literature", "Credits": "3", "Description": "A study of selected literary works from a single nation or from several nations, with the focus on a century, movement, genre, theme or individual writer. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50043", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)", "Same as Offered": "CPLT 341, MLL 341 "}, {"Course": "ENGL 316", "Name": "Literature and the Other Arts", "Credits": "3", "Description": "A study of the relationship between literature and music, film and the fine arts, with an emphasis on common concerns, solutions and terminology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50052", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Languages Of Film, Life And Films Of Welles, Attack Of The B-Movies, Women In Media, Amer Film In The 1970’s, Culture And Values, Film Noir, Film Adaptation, Fiction And Film, Cult Films, Mediated Movies, Films:Hitchcock & Lang, Nvls & Plitcs/Vctrn Engl, Introduction To Film, Banned Films, The Avant-Garde at the Movies, Biblical Art and Literature in the English Renaiss, Horror Film and Fiction", "Same as Offered": "CPLT 344, MLL 344 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 317", "Name": "Literature and the Sciences", "Credits": "3", "Description": "A study of the relationship between literature and the social, natural or physical sciences. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50051", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Literature And Medicine, Biodiversity & Evolution, Lit And Medicine, Top:, Diagnosing Gender", "Same as Offered": "CPLT 346", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 318", "Name": "Myth and Literature", "Credits": "3", "Description": "Studies in the mythologies of various cultures and in the relationship between myth and literature. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50058", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Myth And Literature, Honors Myth & Literature", "Same as Offered": "CPLT 342, MLL 342 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 320", "Name": "Topics in Communication and Technology", "Credits": "3", "Description": "A study of key areas of inquiry in the field of communication and technology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54083", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Reporting the Local", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 321", "Name": "Internship in Tutoring Writing", "Credits": "4", "Description": "Course work and practical experience in peer tutoring college writing. Students will learn about tutoring writing through class work that includes reading in the fields of tutoring and composition theory, discussion, and written assignments, along with a tutoring practicum at the Writing Center. In addition, students will be analyzing and refining their own writing process. Note: You must have Sophomore standing or higher, recommendation from an instructor in the English Department, a 3.0 cumulative GPA and evidence of strong writing ability to receive permission to enroll in the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054122", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "ENGL 323", "Name": "Advanced Skills in Tutoring Writing", "Credits": "3", "Description": "This course expands students’ knowledge of writing tutoring theory and practice while providing them with a strong foundation in standard English grammar and ESL teaching and tutoring methods. Students apply what they learn to tutoring situations in the Writing Center and use their experiences as tutors to make connections with course readings and activities.", "Grading": "Graded", "Course ID": "102080", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 321 with a C or better."}, {"Course": "ENGL 324", "Name": "Theories of Communication and Technology", "Credits": "3", "Description": "This course focuses on important theories and issues in communication and technology studies, exploring them from various historical and contemporary perspectives. Students will become acquainted with the major movements in the field and the scholars who have shaped them.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54084", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 300 or MCS 222 with a C or better."}, {"Course": "ENGL 326", "Name": "The Structure of English", "Credits": "3", "Description": "An advanced study of some of the important theories of grammatical structure, intended especially for prospective teachers or writers. This course should not be viewed as a remedial course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54085", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 100 or ENGL 100 equivalent with a grade of C or better to take this course."}, {"Course": "ENGL 330", "Name": "Researching Communicative Practices", "Credits": "3", "Description": "This course examines some of the issues, questions, concerns, and challenges faced by those interested in learning about why, how, and when people use writing and other communicative tools to help them accomplish specific goals. The course examines the way school-based writing has been researched and represented as well as how communicative practices associated with the workplace, the home, and the community have been researched and represented. Some of the questions this course seeks to address: What do researchers hope to gain by examining how children, college-aged students, famous writers, housewives, prisoners, office workers, web designers, and engineering teams use writing as well as other communicative resources to accomplish specific objectives? How do researchers decide upon their methods, and how do they choose their projects’ participants? Finally, how are the results of their studies represented for an audience? Students will be required to research and write about various communicative practices, including ones in their own lives.", "Grading": "Graded", "Course ID": "54086", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 331", "Name": "Contemporary British Literature", "Credits": "3", "Description": "An examination of selected works in British literature from the 1930s to the present, with emphasis on literary developments since World War II. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "54087", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Post Mod Fiction & Vict, Behaving Badly", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 332", "Name": "Contemporary American Literature", "Credits": "3", "Description": "An examination of selected works in American literature from the 1930s to the present, with emphasis on literary developments since World War II. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54088", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 332H ", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 332H", "Name": "Contemporary American Literature", "Credits": "3", "Description": "An examination of selected works in American literature from the 1930s to the present, with emphasis on literary developments since World War II. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100344", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 332 ", "Attributes": "Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 334", "Name": "Medieval Literature", "Credits": "3", "Description": "A study of the poetry, drama, and/or prose of the medieval period, c. 350-1500. Topics vary each semester taught.", "Grading": "Graded", "Course ID": "102102", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 301 with a grade of C or better."}, {"Course": "ENGL 336", "Name": "Medieval and Early Modern Drama", "Credits": "3", "Description": "A study of medieval and/or early modern drama, largely excluding Shakespeare.", "Grading": "Graded", "Course ID": "102103", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 301 with a grade of C or better."}, {"Course": "ENGL 339", "Name": "Early Modern Literature", "Credits": "3", "Description": "A study of the poetry and prose of the sixteenth and seventeenth centuries.", "Grading": "Graded", "Course ID": "102104", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 301 with a grade of C or better."}, {"Course": "ENGL 340", "Name": "Major Literary Traditions and Movements", "Credits": "3", "Description": "An examination of works that represent selected literary movements or periods that have shaped British and American literature. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54089", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 342", "Name": "Principles and Practices of Visual Literacy", "Credits": "3", "Description": "This course emphasizes the visual aspect of communication and its important role in meaning-making. Now, perhaps more than ever, visual images are used to produce, represent, identify, and circulate information. The facility to code and decode these visual images is an essential part of what it means to be literate today. Exploring the conventions of visual communication as well as the adaptation of those conventions to specific situations, students will read about visual literacy, analyze specific instances of visual communication, and construct visuals that communicate meaning in various contexts.", "Grading": "Graded", "Course ID": "54090", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 343", "Name": "Introduction to Genre Analysis", "Credits": "3", "Description": "This course explores the role of genre in shaping society and the everyday actions of individuals. Students will explore the following questions: What constitutes a genre, and what functions does it accomplish in the world? How does a genre work to stabilize knowledge and particular realities in various contexts? How can the use of genre promote social change? What happens when genre expectations are not met, that is, when the genre conventions accepted by a particular community are flouted either intentionally or by mistake? As students formulate answers to these questions, they will come to understand genres not as static categories but as dynamic ways of processing information that shape the world we inhabit.", "Grading": "Graded", "Course ID": "54091", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 344", "Name": "Topics in Textual Studies", "Credits": "3", "Description": "This course will take up a range of topics associated with the production, editing, circulation, preservation and reception of texts. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail", "Course ID": "54092", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one ENGL course with a C or better."}, {"Course": "ENGL 345", "Name": "Topics in Literature and History", "Credits": "3", "Description": "This course analyzes literary texts, broadly defined, in their contemporary historical contexts. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54093", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Dissent in Medieval Poetry, Joan of Arc, Shakespeare’s Politics, Early Modern Women, Postcolonial Literature", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 346", "Name": "Literary Themes", "Credits": "3", "Description": "The origin and development of selected themes through various genres and periods. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50050", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 346H ", "Same as Offered": "CPLT 368", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 346H", "Name": "Literary Themes - Honors", "Credits": "3", "Description": "The origin and development of selected themes through various genres and periods. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Completion of a 200-level literature course with a grade of C or better.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100445", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 346 ", "Topics": "Literature of Chivalry", "Same as Offered": "CPLT 368"}, {"Course": "ENGL 347", "Name": "Contemporary Developments in Literature & Culture", "Credits": "3", "Description": "In this course, we will seek to identify key developments in recent and contemporary culture and the major intellectual and aesthetic influences that help shape our values and actions. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54094", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Magic Realism, The Noir and the American Detective Novel, Madness and Mental Illness in Film", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 348", "Name": "Literature and Culture", "Credits": "3", "Description": "A study of the relationship between literature and culture, with emphasis on literature as the product and manifestation of cultural forces. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50053", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Lit/Cul:What’s Happening, Lit&Cltre:Maryland Wrtrs, Internet For Humanists, Lit&Cltr:Whats Happening, Lit & Cult:Genre/Politcs, The American Dream, Representation Of Love, Lit Of The Holocaust, Art Of Letter Writing, Literature And Culture, Gunfter/Cowbys/Gngstrs, Pulp Fictions,Alien Tech, Lit & Social Dissent, Romantic Women Writers, Top:Amer Culture Wars, Song To Cyberspace, Lit:20Th Cent Balto/Wash, Images Of American Life, Top:Tidewater Literature, Literature Of Holocaust, Top:Amer Film&Amer Dream, Road Trips, The American Road Trip, Victoria India, Jewish American Poetry, Viking Literature", "Same as Offered": "CPLT 348", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 349", "Name": "The Bible and Literature", "Credits": "3", "Description": "A study of the relationship between the Bible and selected literary texts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50096", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "RLST 350 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 350", "Name": "Major British and American Writers", "Credits": "3", "Description": "An examination of selected works of one or more British and/or American writers. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54096", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 351", "Name": "Studies in Shakespeare", "Credits": "3", "Description": "Studies in Shakespeare’s major works. By focusing on a particular theme or idea, or a particular set of plays, etc., this course will provide the English major with an in-depth examination of Shakespeare’s times and works. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54097", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 250 or ENGL 301 with a grade of C or better."}, {"Course": "ENGL 353", "Name": "Rhetorical Theory", "Credits": "3", "Description": "This course provides an introduction to the concept of rhetorical theory and explores a number of theories that have developed with the purpose of understanding language in use. Readings may include classical as well as modern rhetorical theories and will map the evolution of various rhetorical concepts such as audience and context. Because the study of rhetoric seeks to explain the material and ideological effects of language, students will be asked to make connections between everyday language use and broader issues of identity, power and agency.", "Grading": "Graded", "Course ID": "54098", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 300  with a C or better."}, {"Course": "ENGL 355", "Name": "Communicative Practices and Play Theory", "Credits": "3", "Description": "In his 2005 publication, “At Play in the Fields of Writing: A Serio-Ludic Rhetoric,” Albert Rouzie argues that “the deeply entrenched divisions between work and play, seriousness and frivolity, and order and chaos…ultimately impoverished our culture’s approach to literacy” (27). This course will explore how some of these “deeply entrenched divisions between work and play” came about, and then it will examine how recent attempts to anneal the work/play split promise to positively impact our abilities to make and negotiate meaning in a rapidly changing world. Course readings will be drawn from a variety of fields and disciplines including Rhetoric and Composition, Literacy Studies, New Media Studies, Gaming Studies, Sociology, Psychology, Education and Anthropology. Recommended Preparation: ENGL 100 and a 200-level English course with grades of C or better.", "Grading": "Graded", "Course ID": "54099", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 360", "Name": "The Literature of Minorities", "Credits": "3", "Description": "Readings in and analysis of the literature of a racial, ethnic, sexual or social group of America or Great Britain. This is not an overall survey, but it focuses on an aspect of the literature of one group; e.g., black-American fiction, American-Indian poetry. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54100", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Multiethnic American Modernisms,1900-1950", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 361", "Name": "Studies in Black Drama", "Credits": "3", "Description": "The portrayal of the black experience in plays by primarily black dramatists. Examination of problems encountered in reading or producing plays of black writers. Experiments and new directions in black drama and theatre. Selections will treat a specific historical period, theme or group of dramatists from one or more areas of concentration: Africa, the United States, Caribbean and Latin America. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50022", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Contemp African American, Studies In Black Drama", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "AFST 361 ", "Prerequisite/Corequisite": "You must complete AFST 261 ."}, {"Course": "ENGL 362", "Name": "Studies in Black Poetry", "Credits": "3", "Description": "Examination of a theme, group of poets, or historical period in the development and evolution of black poetry. The special contribution of poetry in the development of a black ethos and a black consciousness. Poets may come from one or more of three geographic areas: Africa, the United States, the Caribbean and Latin America. Special selections of black poetry from other areas may be included. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52085", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Studies In Black Poetry, Advanced Writing In Afri", "Same as Offered": "AFST 362 ", "Prerequisite/Corequisite": "You must complete AFST 260 or AFST 261."}, {"Course": "ENGL 364", "Name": "Perspectives on Women in Literature", "Credits": "3", "Description": "Reading and analysis of literature by or about women. The course intends to familiarize students both with major women writers and with ways in which women have been portrayed in literature. Particular attention will be paid to issues of canonization, gender and genre, as well as to the development of a female literary tradition. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50085", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Arts and Humanities (GFR)", "Same as Offered": "GWST 364 ", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 366", "Name": "World Literature Written in English", "Credits": "3", "Description": "A study of writers from English-speaking countries (e.g., Canada and Australia) whose works and national literary traditions are not covered in the standard British-American literary curriculum, and of those writers (e.g., Indian and Nigerian) whose native language is not English, but who have chosen to write in it to reach a wide international audience. Some attention is paid to the political implications of such choices and to the distinctive linguistic and rhetorical features of such works. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54101", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Wrld Lit:Afr & Amer Indn, Novels Of Trinidad, World Lit In English, Writers Of The Caribbean, Irish Masters 20Th Cent", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 369", "Name": "Race and Ethnicity in U.S. Literature", "Credits": "3", "Description": "This course examines how notions of race and ethnicity are represented, contested, and reconsidered in U.S. fiction of the mid-nineteenth century through the present. Special attention will be paid to how race intersects with gender, sexuality, and class. Course readings are drawn from writers of a range of ethnic backgrounds.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54103", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Race and Ethnicity in US Liter", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete a 200 level ENGL course with a C or better."}, {"Course": "ENGL 371", "Name": "Creative Writing-Fiction", "Credits": "3", "Description": "A second course in the writing of prose fiction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54104", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 271 with a grade of C or better."}, {"Course": "ENGL 372", "Name": "Creative Writing: Scriptwriting", "Credits": "3", "Description": "A second course in scriptwriting, with variable emphasis on drama, film, television, radio and interactive multimedia.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54105", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 272 with a grade of C or better."}, {"Course": "ENGL 373", "Name": "Creative Writing-Poetry", "Credits": "3", "Description": "A second course in writing poetry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54106", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 273 with a grade of C or better."}, {"Course": "ENGL 375", "Name": "Topics in Creative Writing", "Credits": "3", "Description": "This course examines a body of creative work, or a specific author’s work, with an emphasis on writing craft. Students will read and analyze a variety of texts, and also produce and share their own, drawing on the ideas and approaches in the works they read. Significant revision and reflection are components of the course, along with discussion and practice. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "54107", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Postmodern Fiction, Flash Fiction, Voices of Difference in Contemporary Fiction, Poetry and Prose of Wales", "Prerequisite/Corequisite": "You must have completed ENGL 271 or ENGL 272, or ENGL 273 with a grade of C or better."}, {"Course": "ENGL 379", "Name": "Principles and Practices in Technical Communication", "Credits": "3", "Description": "This course introduces students to writing that communicates information, often of a technical nature, to nonexperts who must use or act upon that information. Students will analyze and practice a variety of genres, including memos, reports, instructions and proposals; learn techniques of audience accommodation; and explore rhetorical principles involved in researching, designing, drafting and testing effective documents. Students can expect to work collaboratively and to develop their skills in producing multimedia documents.", "Grading": "Graded", "Course ID": "54108", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 300 or ENGL 393 with a grade of C or better"}, {"Course": "ENGL 380", "Name": "Introduction to News Writing", "Credits": "3", "Description": "An introduction to news reporting with emphasis on techniques of news gathering and the principles of editing. The course explores problems of news reporting in the various mass media.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54109", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 with a C or better."}, {"Course": "ENGL 382", "Name": "Feature Writing", "Credits": "3", "Description": "An introduction to writing feature and magazine-length articles for publication. The material will be gathered by the student on people, places, things and activities in and around Baltimore. The course includes research and interviewing techniques, writing for a specific audience or market, and practice in editing manuscripts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54110", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 with a C or better."}, {"Course": "ENGL 383", "Name": "Science Writing", "Credits": "3", "Description": "This course introduces the student to the realities of modern print journalism and offers supervised practice in preparing various types of stories on scientific subjects. The three major areas of concentration are media for science communications, translating the languages of science and writing the science story. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54111", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "The Literature of Addiction and Recovery", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 384", "Name": "Topics in Journalism", "Credits": "3", "Description": "Topics will focus closely on areas of journalism ranging from historical trends in journalism in the 19th and early 20th century as well as the rise of the tabloid press and the modern development of digital news media. Topics may include the history of the press in the United States, press law, the significance of other news media such as television and radio broadcasting, and the ways that the Internet and digital news coverage have changed the way we become informed about local, regional, national and international news. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "101761", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Reporting the Local, Topics in Advanced Journalism", "Prerequisite/Corequisite": "You must complete ENGL 100 and any ENGL 200 or ENGL 300 level English course with a C or better."}, {"Course": "ENGL 385", "Name": "New Media and Digital Literacies", "Credits": "3", "Description": "This course aims to promote “digital literacy.” That is, it aims to help students gain understanding of the ways in which new media are used to produce, consume, and represent information and cultural objects, processes that are increasingly linked to the production of culture itself. To this end, students will analyze the technologies and artifacts of new media. As students read, analyze, and construct new media texts, they will learn about the historical and theoretical contexts for the development of these dynamic and still emerging technologies. Students will come to understand the ways in which these technologies are increasingly responsible for the cultural landscape of our daily lives.", "Grading": "Graded", "Course ID": "54112", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 386", "Name": "Adult Literacy Tutoring: Theory and Practice", "Credits": "4", "Description": "Students in this course will discuss theories of language and literacy acquisition pertaining to adult learners. They will then apply these theories in actual tutoring experiences. In addition, students will read and respond in writing to contemporary research concerning the social, political, and economic causes of illiteracy as well as suggested ways to ameliorate illiteracy on the social and individual levels. Authors whose work students may read include Paulo Freire, John Dewey, W.E.B. DuBois, Mike Rose, Glenda Hull, and Denny Taylor. This course requires that students spend four hours per week serving as tutors to adult literacy learners in a Baltimore City community center.", "Grading": "Graded", "Course ID": "54113", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENGL 387", "Name": "Web Design and Multimedia Authoring", "Credits": "3", "Description": "This course will give students a foundation in the production and analysis of digital texts. Like other kinds of texts, digital texts require the exercise of language: in this case, the “languages” of code and image. We will thus learn to use Hypertext Markup Language (XHTML) and Cascading Style Sheets (CSS) - the code basis of web texts - in order to gain a thorough understanding of digital writing. We will also learn to “read” digital texts in their many incarnations - web texts, hypertexts, and interactve media (CD/DVD) texts. We will learn the complexities of digital narrative and design, and learn how to compose creative and critical texts in our new medium.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54114", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 and a 200 level ENGL course with a grade of C or better."}, {"Course": "ENGL 391", "Name": "Advanced Exposition and Argumentation", "Credits": "3", "Description": "This course shows students how to locate, gather and arrange information to produce sophisticated arguments. The course will contain readings drawn from various disciplines.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54115", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent with a grade of C or better."}, {"Course": "ENGL 391E", "Name": "Advanced Exposition and Argumentation for ESL Students", "Credits": "3", "Description": "This course shows students how to locate, gather and arrange information to produce sophisticated arguments. The course will contain readings drawn from various disciplines.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54117", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 110 with a C or better and have Sophomore standing or higher."}, {"Course": "ENGL 392", "Name": "Tutorial in Writing", "Credits": "3", "Description": "This course in research writing expands students’ experience with scholarly sources and other sources, such as journalism and media, interviews and observation, and archival materials. Students will use these to develop writing projects that explore complex questions related to their academic or career interests. The course’s small-group tutorial setting employs extensive peer and instructor feedback to foster the development of the writing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54118", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENGL 100 with a C or better."}, {"Course": "ENGL 393", "Name": "Technical Communication", "Credits": "3", "Description": "This course teaches students from various disciplines to communicate technical information effectively. The course’s emphases on critical thinking, synthesis, analysis, and the writing process help students to inform and persuade their audiences through the composition of technical documents. Reflecting a professional writing style and document design principles, these documents demonstrate how text and visuals work together to reach different audiences with specific needs. Students also develop oral communication and collaborative skills along with technological and visual literacy. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54119", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Technical Writing, Technical Writing:Honors, Technical Communication, Technical Communication Honors", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivalent or ENGL 391 with a grade of C or better."}]