[{"Course": "ART 425", "Name": "Writing By and For Artists, Curators, and Critics", "Credits": "3", "Description": "How do artists engage in the practice of writing about their own and others’ artwork? What are the conventions curators follow in formulating theses statements for art exhibitions and in writing labels for the art objects on display in a show or a museum? What is entailed in producing an effective piece of art criticism? Students in this seminar grapple with these questions on a practical level by reading published works by artists, curators and critics, and by carrying out a range of weekly writing exercises. On a more philosophical level, the goal of the course is to become so comfortable with writing about art that to do so becomes more of a matter of desire than duress. The course will be conducted as a small seminar with weekly discussions and written assignments. Note: Individual goals may be established with the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52392", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ART 425H ", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ART 321 or ART 323 or ART 328 or ART 329 and ENGL 100 with a C grade or better."}, {"Course": "ART 425H", "Name": "Honors Writing By & About Artists", "Credits": "3", "Description": "How do those who practice artmaking engage in the practice of writing about their own and others artwork? What is entailed in shifting one’s point of view to carry out these different practices? Students in this seminar grapple with these questions on a practical level by reading published works by artists and by carrying out a range of weekly writing exercises. On a more philosophical level, the goal of the course is to become so comfortable with writing about art that to do so becomes more of a matter of desire than duress. This is an honors course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100114", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ART 425 ", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ART 321, ART 323, ART 328, or ART 329 and ENGL 100 and be admitted into Honors College"}, {"Course": "ART 427", "Name": "Museum Practice", "Credits": "3", "Description": "This project-based course is designed to help students gain insight and expertise in key components of museum and gallery work (e.g. curating, exhibition design, collection management, and public programming). Students learn and train under the guidance of an instructor experienced and knowledgeable about the art museum world. By the end of the semester students will have gained an invaluable preparatory training for career opportunities with art museums, art galleries and like institutions involved with the public display of historical and cultural material.", "Grading": "Graded", "Course ID": "100296", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 321 or ART 323 or ART 328 or ART 329 with a C grade or better."}, {"Course": "ART 428", "Name": "History & Theory of the Art Museum", "Credits": "3", "Description": "The art museum is a key arbiter of culture in modern societies. This course will integrate historical and theoretical knowledge about the art museum with the practice of proposing and designing an innovative model exhibition. The course will have two components: a seminar component and a laboratory component. Seminar discussions will focus on the changing political and cultural histories, philosophies and practices that have dynamically molded the art museum since its inception. The laboratory component will experiment with theories of museum resource management, in other words, the mechanisms that “frame” the object or “stage” the show. This part of the instruction will be conducted through practical assignments in the Center for Art Design and Visual Culture (CADVC) as well as observation during field trips to museums in Baltimore and Washington, D.C. The course will be conducted as a small seminar with weekly discussions and written assignments culminating in student presentations and research papers. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52395", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 321 or ART 323 or ART 328 or ART 329 with a C grade or better."}, {"Course": "ART 429", "Name": "Seminar in Art History & Visual Culture", "Credits": "3", "Description": "The topics of this course will be wide-ranging, reflecting the particular instructor’s research specialization. Some seminars will focus on a specific historical art period or movement; others will trace a prominent theme through several periods. Still others will examine key developments within current theoretical and critical discourses. The course will be conducted as a small seminar with weekly discussions and written assignments, culminating in student presentations and a research paper. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52396", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 321 or ART 323 or ART 328 or ART 329 with a C grade or better."}, {"Course": "ART 430", "Name": "Typography III", "Credits": "3", "Description": "This course is an expoloration of advanced problems in visual communication that stresses the integration of typography with other two and three-dimensional imagery. Further emphasis is placed on the development of a rational design methodology through a consideration of form, utility and production limitations. Research, critical analysis and discussion are required. Recommended Preparation: ART 334, ART 336, ART 337.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52397", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 334, ART 336, and ART 337, with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 431", "Name": "Graphic Design III", "Credits": "3", "Description": "An exploration of advanced communication problems involving identity systems as applied to two and three dimensions in analog and digital mediums. Projects can include wayfinding and exhibit. Issues related to ergonomics and sustainability are discussed and explored.", "Grading": "Graded", "Course ID": "52398", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 432", "Name": "Graphic Design Practicum", "Credits": "3", "Description": "Individual and collective problem-solving projects with university, nonprofit and local business organizations. This studio centers on problem analysis and definition, client consultation, design development, dealing with specialists and production processes. Additionally, this studio explores the future in professional design practice through a comprehensive introduction to design offices and studios and support systems that make up the world of professional design practice. Recommended Preparation: Permission of instructor and design faculty.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52399", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 334, ART 336, and ART 337, with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 434", "Name": "Advanced Interface Design", "Credits": "3", "Description": "ART 434 is the concluding course in the graphic design sequence. It is an advanced exploration of interaction and information design focusing on user interfaces for interactive platforms, from mobile devices to larger dynamic informatics and interpretive media installations. Via hands-on, collaborative problem-solving, students will gain skills needed to work in contemporary digital environments. Topics covered include human-computer interaction (HCI) and user-experience design (UXD) principles. Students will design and build interactive prototypes, while continuing to build a strong foundation of graphic design fundamentals through practical application.", "Grading": "Graded", "Course ID": "100497", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 334, ART 336, and ART 337, with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 435", "Name": "Topics in Film/Video", "Credits": "3", "Description": "In this course students create an individual film or video project developed from a detailed study of a central theme in experimental, narrative or documentary work. Screenings, readings and discussions will present students with models. Topics include film/video landscapes, performance and installation, autobiography, surface tensions, collaboration, representation, technology and perception. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "52400", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 345 or ART 346 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 441", "Name": "Advanced Video Art", "Credits": "3", "Description": "This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52402", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 447", "Name": "Motion Graphics and Compositing", "Credits": "3", "Description": "This course explores the creation of cinematic effects and motion graphics utilizing advanced techniques in multilayered, time-based compositions as it relates to both 2-D and 3-D applications. The conceptual process and content incorporating these techniques are studied through screenings of contemporary works and critiques of student class work.", "Grading": "Graded", "Course ID": "52406", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete ART 213 and one of the following ART 305, ART 315, ART 331, ART 341 or ART 365 with a grade of “C” or better and complete the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 460", "Name": "Installation Art", "Credits": "3", "Description": "This advanced studio-seminar studies the ways in which artists have defined and utilized space. An interdisciplinary approach to installation allows students to integrate a variety of materials, methods and concerns into their studio projects. Modes of exhibition and display are examined both within gallery/museum spaces and alternative settings. A variety of approaches may be explored, including performance and documentation, memory, alternative narratives, textual strategies, materiality, real and recorded time, site specificity and spatial interventions. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52412", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must complete two 300-level studio courses each with a minimum grade of C."}, {"Course": "ART 461", "Name": "Advanced Photographic Compositing", "Credits": "3", "Description": "This course concentrates on the seamlessly montaged photograph, from conception to completion, shifting the formation of the photograph from shutter to post-shutter. This course will examine related conceptual issues through readings and observations, as well as contemporary and historic composited photographs. Students will learn principles of light and shadow, composition, and compositing techniques. Past instruction in two-dimensional design, previsualization, and interpreting and discussing photographs will be reinforced and extended", "Grading": "Graded", "Course ID": "102441", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "ART 361 with a B or better and Visual Arts Milestone or Visual Arts Minor."}, {"Course": "ART 462", "Name": "Entrepreneurial Practices in Photography", "Credits": "3", "Description": "This course examines what it means to be an entrepreneur in photography. Case studies of and visits with successful alumni will be used to demonstrate the inventiveness and discipline necessary to move innovation to implementation. The ability to find and to create opportunity is a central to this course. Students work collaboratively to develop and refine this ability, while learning to build the underlying business structure necessary to succeed.", "Grading": "Graded", "Course ID": "102442", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "ART 361 with grade B or better and Visual Arts Milestone or Visual Arts Minor."}, {"Course": "ART 465", "Name": "Intermedia Studio", "Credits": "3", "Description": "This advanced studio course integrates the multiple possibilities of mark-making and form. Emphasis is on the development of a student’s individual direction in the theoretical and conceptual framework of contemporary art. Art 465 facilitates the independent thesis work of Senior Projects and may be taken concurrently. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: Permission of instructor.", "Grading": "Graded", "Course ID": "52413", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee $40.00", "Prerequisite/Corequisite": "You must have achieved admission through portfolio review process (VA Milestone) or be a declared Visual Arts Minor to take this course."}, {"Course": "ART 480", "Name": "History and Theory of Imaging and digital Arts", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52418", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 484", "Name": "Advanced 3D Animation", "Credits": "3", "Description": "This course will continue a student’s exploration of 3-D computer animation. Advanced techniques for modeling and procedural rendering will be introduced, as well as animation techniques that utilize scripts, expressions, deformations and inverse kinematics. Students will utilize these skills in the context of strengthening their own artistic voice.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52420", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 384 with a grade of C or better and the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 485", "Name": "Team-based Game Development", "Credits": "3", "Description": "In this class students will learn to apply their talents towards developing computer games. They will learn the processes, techniques, and toolsets used in game development from industry professionals. Students will also learn how to function in an interdisciplinary team on challenging and complex projects. Recommended Preparation: ART 486 ", "Grading": "Graded", "Course ID": "102567", "Consent": "No Special consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ART 341 with a grade of ‘C’ or better and the Visual Arts Milestone (portfolio review process) before taking this class."}, {"Course": "ART 486", "Name": "Real Time Animation", "Credits": "3", "Description": "This studio course explores the creation of visual media for interactive applications. Student will gain a foundational understanding of the concepts and techniques involved with art production for real time graphics and animation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52421", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 341 with a C or better, before taking this class."}, {"Course": "ART 487", "Name": "Pre-production for Animation Senior Projects", "Credits": "3", "Description": "This course prepares Animation students for their capstone ART 489 Senior Projects course. Students will develop individual project ideas and prepare for production using traditional and/or non-traditional pre-production practices. Emphasis will be on class presentations, discussion, critiques, and screenings.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52422", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Students must complete 2 of the following (ART 384, ART 387, ART 447, ART 486) before taking this course."}, {"Course": "ART 488", "Name": "Advanced Topics in Animation", "Credits": "3", "Description": "This course offers an investigation of current directions in Animation and Interactive Media. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52423", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ART 341 with a C or better, before taking this class."}, {"Course": "ART 489", "Name": "Senior Projects", "Credits": "3", "Description": "An advanced course that focuses on the production of individual and collaborative projects, emphasizing class discussion and critique. This course constitutes the capstone experience and should be taken in the student’s final semester. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52424", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Time-Based, Photography, Print Media, Senior Projects, Print Media, Photography, Time-Based Media", "Attributes": "Course Fee = $40.00", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 490", "Name": "Senior Art History Thesis or Curatorial Project", "Credits": "3", "Description": "The student undertakes advanced individual work in history, theory or criticism under the direction of a member of the art history faculty. The project is finished during the last semester of a student’s senior year. The student may choose to submit a research paper and to deliver an accompanying oral presentation at the Senior Thesis show held annually in the month of May at the Center for Art Design and Visual Culture. Alternatively the student may choose to conduct a curatorial project (in conjunction with the Senior Thesis show) with an accompanying exhibition thesis.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52425", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ART 491", "Name": "Special Studies", "Credits": "1", "Description": "Advanced individual work in history, theory or criticism under the direction of a member of the visual arts faculty. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52426", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 492", "Name": "Topics in Art or Media II", "Credits": "1", "Description": "The topics of this course concern major current and stylistic directions in art and media. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52427", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Aesthetics, Ethical Val, Fulcrum Editing Software, Aesthetics New Media Val, Aesthetics & Ethical, Topics:Art Or Media II, Theory/Prac Art Museum, Web Interface Design, Motion Design, Introduction to Arduino and Basic Electronics", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 493", "Name": "Senior Thesis Project", "Credits": "6", "Description": "This project is finished during the last semester of a student’s senior year and must culminate in a presentation of finished work.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52428", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 494", "Name": "Internship", "Credits": "1", "Description": "An internship inside or outside the university, related to the student’s focus, to be taken under the supervision of a visual arts faculty member or advisor. If a student works six hours per week, the student is eligible to enroll for three credits. Hence, 12 hours per week equals six credits. Note that 12 hours for six credits is the maximum allowed. Students will work in a professional environment and perform a range of tasks. The circumstances of the internship experience will be evaluated before both the student and supervising firm proceed. This ensures that both parties will benefit mutually from the association. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Pass/Fail", "Course ID": "52429", "Consent": "Department Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 495", "Name": "Independent Studio Research", "Credits": "1", "Description": "This course may be taken when a student indicates strong interest and a faculty member suggests that a student’s progress would be enhanced measurably by further work in specific areas or through a collaborative endeavor with a student in the department or another discipline in the University System of Maryland. Students must submit a written proposal stating the reason for and parameters of the project, as well as a comprehensive schedule for its completion within the semester format. All proposals must be submitted 10 weeks into the preceding semester and will be reviewed and approved on the basis of merit. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52430", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have completed the Visual Arts Milestone (portfolio review process) in order to take this class."}, {"Course": "ART 496", "Name": "Imaging Research Center Internship", "Credits": "3", "Description": "This course is designed to acquaint students with the processes of professional animation, graphics and multimedia production in a professional work environment. Students work under the guidance of the IRC directors, usually in teams, on client-based or research projects. The focus of the internship is on the development of ideas, working collaboratively in teams and utilizing evolving technologies. IRC productions vary on a semester basis and demand different skills from interns. This internship opportunity is considered a senior-level course. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Pass/Fail", "Course ID": "52431", "Consent": "Department Consent Required", "Components": "Research"}, {"Course": "ART 497", "Name": "Seminars and Lectures", "Credits": "1", "Description": "This course will be offered periodically. It will present topics in contemporary design practice and history, designer/professional presentations and related issues relevant to the theory and practice of design. Topics will be published in the Schedule of Classes. Recommended Preparation: ART 331 - ART 335 and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52432", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Graphic Design Seminar"}, {"Course": "ART 498", "Name": "Internship/Center for Art, Design and Visual Culture", "Credits": "1", "Description": "ART 498 exposes the student to all aspects of exhibition organization, design, installation, and presentation on a professional level. Working closely with Center for Art, Design and Visual Culture staff, each student will assist with the coordination of exhibitions and accompanying publications and educational outreach initiatives. Areas of concentration include curatorial research, collection management, exhibition and publication design, K-12 educational outreach, public programming events, and grant writing. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "52433", "Consent": "Department Consent Required", "Components": "Research"}, {"Course": "ASIA 100", "Name": "Introduction to Asian Studies", "Credits": "3", "Description": "This course introduces students to the field of Asian Studies. Topics such as the concept of Asia, the historiography of the study of Asia (how Asia has been viewed in academic scholarship and popular culture), the debate about ‘Asian values’ and democracy, and contemporary Asian culture will be explored. Guest speakers will introduce the study of Asia from the perspective of their particular disciplines, such as economics, music, history, gender and women’s studies, visual arts, and literature.", "Grading": "Graded/Audit", "Course ID": "100491", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ASIA 207", "Name": "Asian Diasporas", "Credits": "3", "Description": "The story of human migration within and from Asia is at the heart of world history, touching upon every aspect of the human experience. As Asian migrants move within countries, within continents, and across oceans, they have faced many unique challenges and created profoundly complex networks of communication. This course will focus on the history of the global Chinese and Indian diasporas, comparing and contrasting them where appropriate with similar, though smaller-scale, networks of Koreans, Vietnamese, Pakistani, and other Asian groups abroad in the nineteenth and twentieth centuries.", "Grading": "Graded/Audit", "Course ID": "102139", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 207 "}, {"Course": "ASIA 214", "Name": "Focused Cultural Study: South Asia", "Credits": "3", "Description": "This course examines how people are making – and making sense of – their lives in a changing South Asia. Students will read ethnographic accounts from different parts of South Asia, each with their own particular histories, languages, and religious and ethnic identities. Students will use these readings and other material to examine how people in these communities draw on cultural beliefs and practices in the context of social change and globalization. These accounts will allow students to investigate key concepts in anthropology, as well as to learn about contemporary South Asia.", "Grading": "Graded", "Course ID": "102449", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Same as Offered": "ANTH 214 "}, {"Course": "ASIA 300", "Name": "Topics in Asian Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100607", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ASIA 318", "Name": "Visual Culture of City and Cinema in South Asia", "Credits": "3", "Description": "South Asian cities are loci of culture, commerce, religion, politics, crime and poverty. This course studies urbanism in contemporary South Asia from two perspectives: through the influential lens of Indian entertainment or ‘Bollywood’ cinema and through an examination of visual cultural forms, derived from the cinema, that pervade urban public spaces in South Asia. Examples include street murals, commercial signage, haute couture, wedding festivities and even the addition of new deities to the Hindu pantheon.", "Grading": "Graded", "Course ID": "102279", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ART 318", "Prerequisite/Corequisite": "You must complete ART 216 or ASIA 100 "}, {"Course": "ASIA 329", "Name": "Early and Medieval Chinese Literature", "Credits": "3", "Description": "This course is an introduction to important works of the classical literary tradition of China from the Zhou Dynasty (1045-221 BCE) through the Northern Song dynasty (976-1127 CE). In a chronological survey of the important writers of the early and medieval periods, the course tackles some fundamental questions of the Chinese literary tradition, including the meanings of the word that came to mean literary writing, wen, and the place of wen in traditional Chinese culture; which genres of writing became the most prominent in the early tradition, and why; and the ways in which the scope of Chinese literature broaden and changed. The course is taught in English, with no knowledge of Chinese language required. Recommended Preparation: ASIA 100 or HIST 103 or MLL 301.", "Grading": "Graded", "Course ID": "101870", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MLL 329 "}, {"Course": "ASIA 330", "Name": "The Dao of Intermedia", "Credits": "3", "Description": "This course explores the connection between art and the everyday through lectures, and readings of Asian philosophy. The course consists of discussions about the philosophy and how traditional and contemporary artists/craftspeople have related the philosophy to their work. Students learn traditional arts/crafts such as brushpainting, papermaking, paper/textile decorative arts as well as creating art that is both physical material and performative. No prior visual arts experience needed", "Grading": "Graded", "Course ID": "102317", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ART 355 "}, {"Course": "ASIA 392", "Name": "Art and Power in Japan: 1600 to the Present", "Credits": "3", "Description": "The aim of this course is to view art and architecture as instrumental to change in pre-modem and modern Japan. Rather than restricting “art” to the realm of leisure, we will emphasize art’s ability to serve as a visual placeholder for political motivations. The course will begin by analyzing sites in Nara and Kyoto but will also highlight the design of temples, shrines, and memorial spaces in locations such as Nagoya, Hiroshima, and Tokyo. Recommended Preparation: HIST 103", "Grading": "Graded", "Course ID": "102879", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 392 "}, {"Course": "ASIA 399", "Name": "Internship in Asian Studies", "Credits": "1", "Description": "Field work related to Asian Studies.", "Grading": "Pass/Fail", "Course ID": "100608", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "ASIA 400", "Name": "Special Projects in Asian Studies", "Credits": "1", "Description": "This course is repeatable for credit. Students may complete a maximum of 3 credits. Note: Open to junior/senior Asian Studies majors with special study projects and at least a 3.0 average in Asian Studies. In extraordinary circumstances, exceptions may be made with permission of the instructor.", "Grading": "Graded", "Course ID": "101760", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "BIOL 101", "Name": "Concepts Of Biology", "Credits": "3", "Description": "A broad overview of contemporary biological science. Major areas include the biochemistry of energy transformation, cell structure and function, Mendelian, molecular and population genetics, development and differentiation, plant and animal physiology, evolution, and ecology. Recommended Preparation: high school biology and chemistry. Note: This introductory biology course is designed for non-majors and may not be used towards the Biochemistry and Molecular Biology, B.S., Bioinformatics and Computational Biology, B.S., Biological Sciences, B.A., or Biological Sciences, B.S.", "Grading": "Graded/Audit", "Course ID": "100369", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "BIOL 101L", "Name": "Concepts of Biology Lab", "Credits": "2", "Description": "This laboratory course is designed to introduce non-Biology majors to essential laboratory equipment and techniques, as well as basic experimental design.", "Grading": "Graded/Audit", "Course ID": "52468", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must have completed or be concurrently enrolled in BIOL 101 or BIOL 141. All prerequisites must be completed with a grade of ‘C’ or better.  BIOL 101L or BIOL 141 can be taken concurrently."}, {"Course": "BIOL 106", "Name": "The Human Organism", "Credits": "3", "Description": "This course is designed to introduce the non-science student to science and its methods and provide a basic understanding of some body functions and dysfunctions. Topics include genes and DNA, cells and cancer, immune system and HIV, metabolism and nutrition, muscles and exercise, nervous system and drugs, etc.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52473", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "BIOL 107", "Name": "Biology of Cancer", "Credits": "3", "Description": "A major killer disease in Western countries will be examined from the biological perspective. This course will evaluate current epidemiologic, clinical and experimental research and assess the relative importance of environmental and genetic factors as they relate to the causes and prevention of this disease. Particular emphasis will be given to unraveling the links between dietary and nutritional factors and this “disease of affluence”. Recommended Preparation: Some background in the natural sciences, preferably one year in both high school biology and chemistry", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52474", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GFR)"}, {"Course": "BIOL 108", "Name": "Biology of Heart Disease", "Credits": "3", "Description": "This course will develop, from a biological perspective, the nature of heart disease and the complex connections between environmental factors and this life-threatening illness. We specifically will consider the current, often conflicting, evidence that links dietary factors with the onset of the disease.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52475", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GFR)"}, {"Course": "BIOL 109", "Name": "Life: Introduction to Modern Biology", "Credits": "3", "Description": "This is a lab-driven course designed to fulfill the university graduation requirement of a science lab. Topics covered will include basic biological concepts such as the nature of DNA, heredity, human genetics and the process of mutation, as well as modern issues such as forensic analysis of DNA and blood, the biology behind cancer and genetic diseases, and others as determined by current events and interest. The course includes a 75-minute lecture and 120-minute lab.", "Grading": "Graded", "Course ID": "52476", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Science Plus Lab (GEP), Science Plus Lab (GFR)"}, {"Course": "BIOL 123", "Name": "Human Genetics", "Credits": "3", "Description": "A course designed for non–biology majors. Topics will include the fundamental rules of heredity, gene structure and function, human genetic diseases and genetic engineering. Particular emphasis will be placed on the application of the new genetic technology to the human condition.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52477", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "BIOL 141", "Name": "Foundations of Biology: Cells, Energy and Organisms", "Credits": "4", "Description": "This course for majors provides a broad overview of contemporary biological concepts. Major topics include structure and synthesis of nucleic acids and proteins, molecular genetics, prokaryotic and eukaryotic cell structure and function, biochemistry of energy transformation, and animal and plant development and physiology. This course is designed to prepare students for upper level biology core and elective courses. It is one of two introductory courses (BIOL 141 and BIOL 142) designed exclusively for BIOL, BIOC and BINF majors.", "Grading": "Graded", "Course ID": "100315", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "BIOL 100, BIOL 141H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 150 or MATH 151 or MATH 155 or equivalent with a `C’ or better, or have MATH test placement into MATH 151."}, {"Course": "BIOL 141H", "Name": "Foundations of Biology: Cells, Energy and Organisms - Honors", "Credits": "4", "Description": "This course for majors provides a broad overview of contemporary biological concepts. Major topics include structure and synthesis of nucleic acids and proteins, molecular genetics, prokaryotic and eukaryotic cell structure and function, biochemistry of energy transformation, and animal and plant development and physiology. This course is designed to prepare students for upper level biology core and elective courses. It is one of two introductory courses (BIOL 141 and BIOL 142) designed exclusively for BIOL, BIOC and BINF majors.", "Grading": "Graded", "Course ID": "100339", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "BIOL 100, BIOL 100H, BIOL 141 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": " MATH 150 or MATH 151 or MATH 155 or equivalent with a `C’ or better, or have MATH test placement into MATH 151. You must also be admitted to the Honors College."}, {"Course": "BIOL 142", "Name": "Foundations of Biology: Ecology and Evolution", "Credits": "4", "Description": "This course provides a broad overview of contemporary biological concepts. Major topics include fundamental concepts in ecology and evolution and emphasizes the fundamental interrelationship between these two fields of study. Concepts in evolution include a general description of the diversity of life, a review of Mendelian genetics, the causes and consequences of speciation, natural selection and genetic drift. Concepts in ecology will focus on ecological and evolutionary factors that govern population growth and regulation, species distributions, community and ecosystem ecology. This course is designed to prepare students for upper level biology core and elective courses. It is one of two introductory courses (BIOL 141 and BIOL 142) designed for BIOL, BIOC and BINF majors.", "Grading": "Graded", "Course ID": "100316", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "BIOL 301 ", "Attributes": "Science (non-lab) (GEP)", "Prerequisite/Corequisite": "You must complete BIOL 141, and either MATH 150 or MATH 151 or MATH 155 or equivalent with a ‘C’ or better or have MATH test placement into MATH 151."}, {"Course": "BIOL 216L", "Name": "Phage Hunters Genome Analysis", "Credits": "3", "Description": "In Phage Hunters Genome Analysis, participants will utilize state of the art computer programs to annotate and analyze complete bacteriophage genome sequences generated in experimental Phage Hunters laboratory courses at UMBC. The course includes two lab meetings per week and a large degree of self-paced investigative work.  No science background is required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052481", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Lab Component for Science (GEP), Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 with a ‘C’ or better before taking this class."}, {"Course": "BIOL 233", "Name": "Nutrition and Health", "Credits": "3", "Description": "Basic principles of normal human nutrition. Topics include: nutrient classification; digestion, assimilation, and metabolic functions of the major nutrients; energy balance; metabolic regulation; dietary guidelines and standards; nutrient composition of foods and diet selection; nutritional considerations in pregnancy, childhood, adulthood, and later years. This course provides an introduction to nutrition for students pursuing careers in health-related fields. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52483", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete (BIOL 101 or BIOL 141 or BIOL 141H) and (CHEM 102 or CHEM 102H or CHEM 124), all of which has to have a grade of ‘C’ or better."}, {"Course": "BIOL 251", "Name": "Human Anatomy and Physiology I", "Credits": "3", "Description": "The first semester of a two-semester lecture course covering the structure and function of the organs of the human body. An integrated approach permits concurrent presentation of the anatomy and physiology of each organ system.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52484", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete BIOL 101 or BIOL 141 or BIOL 141H and CHEM 102 or CHEM 102H or CHEM 124 all of which has to have a grade of ‘C’ or better."}, {"Course": "BIOL 251L", "Name": "Human Anatomy and Physiology I Laboratory", "Credits": "1", "Description": "This laboratory course accompanies BIOL 251 and is required for most allied health programs. The laboratory includes dissections, work with skeletons, models of body parts, and experimental studies of physiological processes.", "Grading": "Graded/Audit", "Course ID": "52485", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": " You must complete BIOL 251 or CHEM 124L or CHEM 102L with a grade of C or better. BIOL 251 can be taken concurrently with BIOL 251L. "}, {"Course": "BIOL 252", "Name": "Human Anatomy and Physiology II", "Credits": "3", "Description": "This course is the second part of two semester-long course that studies the structure and function of the human organism. The organ systems to be studied are the endocrine, cardiovascular, immune, respiratory, digestive, renal and reproductive.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52486", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must have completed BIOL 251 with a grade of ‘C’ or better."}, {"Course": "BIOL 252L", "Name": "Human Anatomy and Physiology II Laboratory.", "Credits": "1", "Description": "This laboratory course accompanies BIOL 252. The laboratory includes dissections, anatomical models, and experimental studies of physiological processes. Anatomy and Physiology Lab is required for most allied health programs.", "Grading": "Graded/Audit", "Course ID": "52487", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must complete BIOL 251L  and BIOL 252  with grade of ‘C’ or better.  BIOL 252  can be taken concurrently."}, {"Course": "BIOL 273", "Name": "Microbiology for Allied Health", "Credits": "3", "Description": "This course is intended for pre-allied health students and will focus on looking at the microbiological world from a public health perspective. Topics covered will include basic cell structure and replication of microbial cells, microbial genetics, epidemiology and the spread of infectious disease, the immune system, as well as an overview of human bacterial and viral diseases.", "Grading": "Graded", "Course ID": "102785", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP)", "Prerequisite/Corequisite": "You must have completed BIOL 101 or BIOL 141 or BIOL 141H with a grade of “C” or better"}, {"Course": "BIOL 273L", "Name": "Microbiology Laboratory", "Credits": "2", "Description": "This laboratory course consists of a series of exercises designed to familiarize the student with microbiological techniques. Experiments are performed in basic bacteriology, applied bacteriology, virology and immunology. Students will be expected to work independently, spending brief periods of time other than the scheduled lab period collecting data.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52489", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must have completed BIOL 273 or BIOL 375 with a “C” or better, or be concurrently enrolled in BIOL 273 or BIOL 375 ."}, {"Course": "BIOL 300L", "Name": "Experimental Biology Laboratory", "Credits": "2", "Description": "An upper level course of experiments designed to give students the essential laboratory and critical thinking skills in experimental design, implementation and analysis that every biologist should know. This knowledge base is required for succeeding in further BIOL laboratory courses and for working in a research laboratory. Required of all BIOL majors and a prerequisite for all upper level BIOL laboratory courses.", "Grading": "Graded", "Course ID": "100317", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must have completed BIOL 141 (or BIOL 141H), BIOL 142,  CHEM 102 (or CHEM 102H), CHEM 102L, and BIOL 302. You must have completed either MATH 150 or MATH 151 or MATH 155, or have equivalent AP credit, or have Math test placement into MATH 151. All prerequisites must have a “C” or better."}, {"Course": "BIOL 302", "Name": "Molecular and General Genetics", "Credits": "4", "Description": "Modern principles of heredity have been established through studies at the molecular, cellular and organismic levels. This course explores the fundamental biology of gene structure, organization, expression, and function as deduced from analyses of viral, prokaryotic, and eukaryotic systems and the gene interactions that underlie them. Fundamental genetic principles are applied to the understanding of human heredity and disease, and molecular genetic manipulations are discussed in the context of biotechnology applications. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52494", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete [BIOL 100 or BIOL100H or BIOL 141 or BIOL 141H] and BIOL 142 and [MATH 150 or MATH 151 or MATH 155, or have equivalent AP credit or MATH placement into MATH 151]. You must complete or be concurrently enrolled in CHEM 102 or CHEM 102H or CHEM 124. All prerequisites must be completed with a grade of “C” or better."}, {"Course": "BIOL 302L", "Name": "Molecular and General Genetics Laboratory", "Credits": "2", "Description": "A laboratory course designed to illustrate fundamental genetic principles by experimentation. Such principles include the nature of genetic material, transfer of genetic information in prokaryotic and eukaryotic systems, organization and regulation of gene expression, Mendel’s rules of heredity, linkage and crossing over, and genetic variation. Students will be expected to work independently, spending periods of time outside the scheduled lab period collecting data.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52495", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must complete BIOL 300L and BIOL 302 with a grade of a ‘C’ or better."}, {"Course": "BIOL 303", "Name": "Cell Biology", "Credits": "4", "Description": "A modern treatment of cell structure and function, with emphasis on the molecular architecture, biochemistry and regulatory mechanisms common to all cells. Topics include membrane structure, function and transport; molecular mechanisms of energy metabolism and its associated organelles; the structural and molecular basis for the expression of genetic information; the organelles involved in the regulation of cell shape and motility; and selected cell functions, growth, reproduction and their control. This course is designed for students interested in the biological sciences, biochemistry and the allied health professions.", "Grading": "Graded/Audit", "Course ID": "52496", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture"}, {"Course": "BIOL 303L", "Name": "Cell Biology Laboratory", "Credits": "2", "Description": "This laboratory course is designed to introduce students to the principles of experimental design and the analysis and interpretation of data in modern cell biology.   During the course of the semester students will be using the techniques of white light and fluorescence microscopy, electrophoresis, protein purification, and tissue culture and other cell based assays.   These techniques will allow students to better understand the mechanisms of cell adhesion, the cytoskeleton, exocytosis and other cell biological processes.  ", "Grading": "Graded/Audit", "Course ID": "52498", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete BIOL 302 and BIOL 300L and BIOL 303 with a grade of ‘C’ or better. "}, {"Course": "BIOL 304", "Name": "Plant Biology", "Credits": "3", "Description": "A modern treatment of the basic physiology and development of plants. Topics include special features of plant cells, patterns and regulations of growth and development, hormone function and regulation, photosynthesis, and stress responses. Discussions are also made on plant-produced useful products, such as secondary metabolites, and how to use genetic engineering to modify plants to achieve better traits. The goals of the course are to enhance students’ understanding of concepts related to Genetics, Molecular Biology, and Cell biology in addition to provide students with a greater appreciation for plants.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52499", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 303 with a grade of “C” or better."}, {"Course": "BIOL 304L", "Name": "Plant Biology Laboratory", "Credits": "2", "Description": "A course of laboratory experiments designed to enhance student abilities in experimental design, hypothesis testing, and analysis and interpretation of data using plant systems. Students are required to present and interpret experimental results in oral and written form. An introduction to reading and understanding of primary scientific literature is presented. Experiments include photosynthesis, water relations, growth regulator effects and host-pathogen interactions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52500", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete BIOL 300L or  BIOL 303L and BIOL 304 with a grade of C or better. BIOL 304 can be taken concurrently."}, {"Course": "BIOL 305", "Name": "Comparative Animal Physiology", "Credits": "3", "Description": "Functional features of whole organisms and their component organs and organ systems will be studied. Emphasis will be on ways in which diverse organisms at various phylogenetic levels perform similar functions. Examples of topics include osmoregulation, gas exchange, control systems, sensors, effectors, brain and behavior.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52501", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 303. In addition, you must be concurrently enrolled PHYS 112 or PHYS 122 or have completed those courses in a previous semester with a “C” or better."}, {"Course": "BIOL 305L", "Name": "Physiology Laboratory", "Credits": "2", "Description": "A physiology laboratory in which we experimentally investigate both human and animal physiology, especially nervous, muscular, cardiovascular, and respiratory function.", "Grading": "Graded", "Course ID": "52502", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete BIOL 305 or BIOL 307 (pre or co) and BIOL 300L  with a grade of “C” or better."}, {"Course": "BIOL 306", "Name": "Molecular Biology", "Credits": "4", "Description": "This is an intermediate level course in molecular biology of prokaryotes, eukaryotes and their viruses. It will cover the principles governing the molecular mechanisms that occur in living cells including regulatory mechanisms. Topics will include the processing of genetic information through the central dogma (transcription, RNA processing and translation), DNA replication, mutation and DNA repair, and genomics. Recommended Preparation: CHEM 351 and CHEM 352.", "Grading": "Graded", "Course ID": "101750", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 306L", "Name": "Projects in Synthetic Molecular Biology", "Credits": "2", "Description": "This laboratory course will introduce students to Synthetic Biology. Students will use a laboratory strain of E. coli to genetically modify the bacteria in ways that will increase our understanding of gene regulation, enzymatic activities, or genetic circuits. Students will familiarize themselves with the techniques needed to modify E.coli. Students will design their own synthetic biology project and construct their synthetic biology project (a modified E.coli strain of their design) during the course of the semester. This course stresses creativity, teamwork, and innovation and introduces students to thinking about biology concepts and skills in the context of entrepreneurship.", "Grading": "Graded", "Course ID": "100499", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must complete BIOL 300L and BIOL 302 and BIOL 303 with a C or better."}, {"Course": "BIOL 307", "Name": "Human Physiology", "Credits": "3", "Description": "This course covers the principles and mechanisms underlying human physiology. The relationships between structure and function are covered, with an emphasis on how cellular and organ systems function and how they are integrated and regulated to maintain homeostasis. Systems covered include cardiovascular, respiratory, renal, muscular, neural, endocrine, immune, reproductive, and gastrointestinal. Credit toward BIOL major requirements may not be received for both this course and either BIOL 252 or BIOL 305.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102138", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 303 with a “C” or better."}, {"Course": "BIOL 312L", "Name": "Modeling in the Life Sciences", "Credits": "2", "Description": "Humans possess a superior ability to generate new knowledge by creating and manipulating abstract models of the world and by extrapolating from past experiences. This natural ability reaches its full potential when it is enhanced with the tools of experimental design, mathematics, logic, and computer simulation. BIOL 312L will be offered as a practical guide to creating and using models in the context of life sciences laboratory research. It will include classroom lectures, activities and computer applications intended to illustrate and implement the five basic elements of modeling: experimental design, data acquisition, analysis, model formulation, and simulation. Through the course, students will address a minimum of four concrete biological problems by defining key physical quantities to be measured, applying data visualization techniques to uncover trends, drawing statistically valid inferences, formulating algebraic and analytical models, and performing computer simulations.", "Grading": "Graded/Audit", "Course ID": "100628", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must have completed BIOL 300L, and STAT 350 or STAT 355 or MATH 151 or MATH 155  with a grade of ‘C’ or better."}, {"Course": "BIOL 313", "Name": "Introduction to Bioinformatics and Computational Biology", "Credits": "3", "Description": "This is an introductory course to the field of Bioinformatics and Computational Biology, an emerging interdisciplinary field dealing with the application of computing methods in biology. The course will provide a brief introduction to contemporary molecular biology and evolutionary theory. It will introduce the concept of bioinformatics, its applications and its career opportunities. Applying a question-answer approach, it will then explore some of the main problems faced by biology in the last decades (such as genome sequencing and annotation or sequence-based search) and it will analyze in depth some of the computational methods provided by the emerging field of Bioinformatics. Lecture content will be complemented with home based assignments. No prior programming skills or biology knowledge are strictly required, but students are expected to have basic knowledge in either molecular biology or algorithmic techniques, and to acquire complementary knowledge within the course. The course is intended for a multidisciplinary audience with an emphasis on BINF, CMSC, BIOL, MATH, STAT and IS majors.", "Grading": "Graded", "Course ID": "100232", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "BIOL 295 ", "Prerequisite/Corequisite": "You must complete (MATH 151 or MATH 151H)and (BIOL 141 or CMSC 104) with a grade of ‘C’ or better."}, {"Course": "BIOL 316L", "Name": "Phage Hunters Genome Analysis", "Credits": "2", "Description": "In Phage Hunters Genome Analysis, participants will utilize state of the art computer programs to annotate complete bacteriophage genome sequences generated in Genetics Lab Phage Hunters Edition (BIOL 302L), and identify the unknown bacteriophages. The course includes a large degree of self-paced investigative work. Recommended Preparation:  CMSC 104 and/or BIOL 313. ", "Grading": "Graded", "Course ID": "101846", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must complete BIOL 302 and BIOL 300L with a C or better."}, {"Course": "BIOL 340L", "Name": "Developmental Biology Laboratory", "Credits": "2", "Description": "This is a laboratory course designed to give students exposure to the different techniques and organisms commonly used in Cell and Developmental Biology research. We will be working with a variety of embryos, such as Drosophila, zebrafish, C. elegans, chicken, and axolotl, as well as planarian and dictyostelium. The major concepts that we will focus on include: gene regulation, pattern formation and cell-signaling; cell migration and cell-cell adhesion; and cell fate determination. The laboratory exercises will allow students to observe normal early embryonic development as well as experimentally manipulate embryos at different stages of early development. The second half of the semester will be guided “independent projects” in which students formulate a cell/developmental question, and design and perform experiments that will provide answers to the proposed question. ", "Grading": "Graded/Audit", "Course ID": "52509", "Consent": "No Special Consent Required", "Components": "Laboratory", "Prerequisite/Corequisite": "You must complete BIOL 300L or BIOL 303L and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 375", "Name": "General Microbiology", "Credits": "3", "Description": "This course describes the fundamental properties of microorganisms and viruses, and their relationships with an emphasis on structure, function, nutrition, metabolism, genetics, and ecology. The course also covers the role of microbes in disease, the environment, biotechnology and genetic engineering. The structure, replication and pathology of viruses are discussed, including the response of hosts to viral infection, the fundamental concepts of the immune response, and epidemiology.", "Grading": "Graded", "Course ID": "52488", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "BIOL 275", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete BIOL 302 and BIOL 303 with a ‘C’ or better."}, {"Course": "BIOL 395", "Name": "U-RISE Writing in the Sciences", "Credits": "2", "Description": "Students in this course will examine and produce the basic forms of professional writing encountered in science careers. They will critique the work of their peers, and learn to analyze scientific literature. Specific assignments include writing review articles, CVs and personal statements for graduate school and funding agencies. This course does not fulfill Writing Intensive (WI) requirements. Recommended Preparation: ENGL 100 or equivalent with grade of ‘C’ or better.", "Grading": "Pass/Fail", "Course ID": "100096", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "BIOL 396", "Name": "Undergraduate Teaching Assistantship", "Credits": "2", "Description": "This service-learning course is designed for undergraduate teaching assistants in biology courses. Student work must be performed in a course taught by a full-time member of the Biological Sciences department faculty and must have a significant learning component. In addition to their teaching responsibilities, students will attend a mandatory weekly session on effective teaching methods taught by a member of the biology faculty. One credit will be earned for the mandatory weekly session and one credit for the teaching and teaching preparation hours of qualified work during an academic semester. This course is repeatable for credit. Students may complete a maximum of 8 credits. Recommended Preparation: Passing the course in which they will serve as a teaching assistant Note: To qualify, students must have a minimum 3.50 GPA in all biology courses taken (including repeated biology courses). Students must be recommended in writing by the faculty member teaching the course and be approved by the department.", "Grading": "Pass/Fail", "Course ID": "52517", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "BIOL 397", "Name": "Ethics and Integrity in Scientific Research", "Credits": "1", "Description": "Individuals involved in contemporary scientific research have ethical responsibilities for their conduct. The goal of this course is to provide students considering a career in scientific research with a framework for establishing appropriate scientific integrity. A variety of relevant topics will be discussed, including fraud and misconduct, peer review, obligations and rights of students and mentors, ethical conduct in animal and human experimentation, ownership of data, reagents, intellectual property, authorship and conflict of interest. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Pass/Fail", "Course ID": "52518", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "BIOL 398", "Name": "Co-op Internship in the Biological Sciences", "Credits": "1", "Description": "This course is designed for UMBC degree-seeking students who are employed outside of the university as volunteers or for compensation, provided the following criteria are met. The work must be performed at an institution, agency or company that is a participating employer in UMBC’s Cooperative Education Program; and the work performed by the student must have a significant learning component in the biological sciences as judged by the biology internship coordinator in consultation with the faculty of the Department of Biological Sciences. Credit earned at the rate of one credit for every 50 hours of qualified work during an academic session. This course is repeatable for credit. Students may complete a maximum of 4 credits. Recommended Preparation: 45 total credits earned, including BIOL 302 ", "Grading": "Pass/Fail", "Course ID": "52520", "Consent": "No Special Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must be concurrently enrolled in PRAC 098."}, {"Course": "BIOL 399", "Name": "Tutorial Projects in Biological Sciences", "Credits": "1", "Description": "Independent studies carried out with the supervision of a faculty member. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Upper class standing", "Grading": "Pass/Fail", "Course ID": "52521", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "BIOL 405", "Name": "Advanced Topics in Comparative Physiology", "Credits": "4", "Description": "This course takes a comparative approach to the study of how various selective pressures have resulted in the evolution of specific solutions to physiological problems. These solutions are viewed within the context of the fundamental limitations of biological evolution that are set by the physical and chemical properties of matter. Representative topics might include vision, temperature regulation and thermal tolerance, renal physiology or cognitive neurophysiology. Most of the material covered will be from original research reports that will be evaluated critically by each student. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52522", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Adv Animal Physiology, Advanced Topics In Comp", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and either [BIOL 305 or BIOL 307], and CHEM 351 and MATH 151 with a grade of “C” or better."}, {"Course": "BIOL 410", "Name": "Modeling in the Life Sciences", "Credits": "4", "Description": "Humans possess a superior ability to generate new knowledge by extrapolating from past experiences and creating and manipulating abstract models. This natural ability reaches its full potential when it is enhanced with the scientific tools of experimental design, mathematics, logic, and computer simulation. BIOL 410 will be offered as an introduction to the science (and art) of creating and using quantitative models. It will include classroom lectures, activities and computer-based exercises intended to illustrate and implement the five basic elements of scientific modeling: experimental design, data acquisition and analysis, model formulation, and simulation. The primary objective of this course will be to engage students in an environment structured to use quantitative models to solve practical problems in biology and biochemistry. This course will not have as objectives to teach formal mathematics, computer programming, or computer science.", "Grading": "Graded", "Course ID": "102053", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete BIOL 142 and BIOL 302 and BIOL 303 and [CHEM 101 or CHEM 101H] and [STAT 350 or STAT 355 or MATH 151 or MATH 155] and [ENGL 100 or equivalent], all with a grade of “C” or better."}, {"Course": "BIOL 411", "Name": "Bacterial Physiology", "Credits": "4", "Description": "The combined approaches of bacterial genetics, molecular biology and biochemistry are applied to the study of bacterial physiological processes. An emphasis is placed on examining adaptation strategies used by bacteria upon encountering alterations in environment. Topics include mechanisms of transcriptional, translational and post-translational control; regulation of carbon and nitrogen metabolism; biosynthesis; energy transduction; signal transduction systems; and bacterial development.  Recommended Preparation: BIOL 375 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52523", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 412", "Name": "Microbial Systems and Synthetic Biology", "Credits": "4", "Description": "The approaches of molecular biology and modern cell biology as applied to the study of both normal and diseased human states. Where appropriate, the analysis of other model mammalian experimental systems may be included. The course will involve the critical reading and discussion of relevant research literature and the preparation of one or more papers on specific issues or topics. The precise topics covered in any one semester will depend on the interest of the faculty and students, and with current developments in the field. Possible topics include: the molecular and cellular basis for human diseases, human molecular genetics, the human genome and proteomic project, human genetic therapy and human evolution. Integrated into this material is the discussion of concepts that encourage an entrepreneurial attitude and skillset.", "Grading": "Graded", "Course ID": "102009", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "BIOL 612", "Prerequisite/Corequisite": "You must complete BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 414", "Name": "Eukaryotic Molecular Genetics", "Credits": "4", "Description": "Genetics and molecular biology of lower and higher eukaryotes and their viruses. The course will focus on the maintenance and expression of genetic material as it relates to cell growth and development. It will cover current topics in the molecular genetics of lower and higher eukaryotes at an advanced level, including mechanisms of genetic control that operate at the level of DNA replication, transcription and translation. Topics to include the molecular basis of phenomena such as regulation at transcription and post transcriptional levels (including mRNA and protein stability), chromosome structure, gene silencing, and formation of the translation apparatus. How these basic molecular processes contribute to understanding disease will be explored. We will also discuss intellectual property and patenting of biological components/tools, consider the relationship between innovation and research advances, and use case studies to examine entrepreneurship issues for the development and marketing of biotechnology products.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52524", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303  and ENGL 100 with a grade of ‘C’ or better."}, {"Course": "BIOL 415", "Name": "Systems Biology", "Credits": "4", "Description": "This course introduces the fundamentals of Systems Biology from an interdisciplinary perspective. Topics include the design of biological systems, network structures and motifs, their dynamic and emergent properties, and methods to infer them from experimental data. The course will study biological systems and their control mechanisms at all levels from gene to population networks, and will cover recent applications in science and medicine that allows us to predict cellular behaviors and design optimal drug responses.", "Grading": "Graded", "Course ID": "102457", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "BIOL 615", "Prerequisite/Corequisite": "You must complete BIOL 303 and (BIOL 313 or CMSC 201 or MATH 152) all with a “C” or better."}, {"Course": "BIOL 420", "Name": "Advanced Topics in Cell Biology", "Credits": "4", "Description": "This course will cover contemporary problems of structure and function at the cellular level through a critical examination of current literature. The course includes both lecture material, with an emphasis on the experimental basis of current knowledge, and presentations by students of oral and written reports on selected topics. The area covered in any semester varies according to recent developments in the field and according to the interests of the students and faculty. The list of available areas includes structure and function of biomembranes; composition, structure and replication of chromosomes; assembly, growth and reproduction of cytoplasmicorganelles; cellular growth and division; regulation of cellular function; nuclear-cytoplasmic interactions; cytoskeletal structure and assembly.  Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52528", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Epigenetics, Small RNAs in Gene Regulation, Virology, Cellular Aging, Cell Death", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302  and  BIOL 303 and ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "BIOL 421", "Name": "Topics in Molecular Genetics", "Credits": "4", "Description": "This advanced seminar-style course explores emerging and recently established topics in molecular genetics, with an emphasis on the experimental basis of current knowledge. The topics covered during any semester will vary according to recent development in the field, and might include novel subtopics within well-established areas such as functional genetics, regulation of gene expression, and the genetics of human disease. Some emphasis is placed on the application of new basic science advances toward biotechnology development. Integrated into this material is the discussion of concepts that encourage an entrepreneurial attitude and skillset.", "Grading": "Graded", "Course ID": "102676", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 422L", "Name": "Microscopy and Imaging Techniques", "Credits": "2", "Description": "This course focuses on the theory and practice of contemporary microscopy techniques for biological and materials science. These include scanning and transmission electron microscopy, atomic force microscopy and laser confocal scanning light microscopy. Specimens will be prepared for examination by each of these instruments; both group and individual projects will be pursued to develop confidence in specimen preparation procedures and use of the appropriate instrumentation. Image processing and figure preparation techniques are included. Integrated into this material is the discussion of concepts that encourage an entrepreneurial attitude and skillset. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52529", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 300L or CHEM 311L with grade of ‘C’ or better."}, {"Course": "BIOL 425", "Name": "Immunology", "Credits": "4", "Description": "This course pursues in depth the rapidly expanding areas of cellular, humoral and tumor immunology. Following a brief overview of the immune system’s response to exogenous antigen, the course concentrates on such topics as antibody production and structure, lymphocyte subpopulations, cell-cell interactions, cell-mediated immune responses, cell surface alloantigens, histocompatibility immungenetics, transplantation and tumor immunology. The exact content of the course varies from year to year depending on the status of research in the field.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52532", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "BIOL 426", "Name": "Approaches to Molecular Biology", "Credits": "4", "Description": "This course will analyze, with class discussions and reading of scientific literature, the various methods used to study the molecular biology of prokaryotic and eukaryotic cells. It will include such topics as restriction mapping, DNA sequencing, cloning strategies and vectors, library construction and screening, probing the sequence organization of DNA and genes, and other current topics relevant to the regulation of the expression of genetic information.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52533", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "BIOL 428", "Name": "Computer Applications in Molecular Biology", "Credits": "4", "Description": "This course is designed as an introduction for biology and biochemistry students to the use of applications software in the analysis of DNA, RNA and protein sequence data. Topics will include operating systems; telecommunications with off campus database; and specific software packages for general and analytical treatment of DNA, RNA and protein sequence data. Some elementary programming will be included.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52535", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 429", "Name": "Advanced Topics in Molecular Biology", "Credits": "4", "Description": "This advanced course analyzes principles of and current topics in molecular biology, which concerns the study of biology at the molecular level and focuses on the structure, function and regulation of macromolecules including DNA, RNA and proteins. Topics will vary across semesters according to current research and the interests of faculty. Representative topics may include: technological advances in molecular biology and biotechnology, genome editing, gene therapy, genetically-modified organisms, and the molecular genetics of human disease. The course is a mix of lectures, problem-based learning, and student-led presentations of articles from the primary research literature. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 16 credits or 4 attempts.", "Grading": "Graded", "Course ID": "102653", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Molecular Biotechnology", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 430", "Name": "Biological Chemistry", "Credits": "4", "Description": "An introductory course describing the essential principles of biochemistry. Topics include the structure and characterization of biological macromolecules, the energetics and thermodynamics of coupled biological reactions, and enzymology. The most important metabolic pathways are described, emphasizing their cellular compartmentalization, integration and control. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52536", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302, BIOL 303, and CHEM 351 with a grade of “C” or better."}, {"Course": "BIOL 434", "Name": "Microbial Molecular Genetics", "Credits": "4", "Description": "The approaches of microbial genetics, molecular biology and biochemistry are combined for the study of the molecular mechanisms regulating gene expression in bacteria. Emphasis is placed on critical reading of research literature.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52539", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and CHEM 351 with a grade of C or better."}, {"Course": "BIOL 442", "Name": "Developmental Biology", "Credits": "3", "Description": "A lecture course that considers the two major aspects of animal development: the means by which, starting with a fertilized egg, progeny cells progressively differentiate from their precursors and one another to produce the ultimate diversity of the multicellular organism; and the processes by which this increasingly complex population of cells is synthesized into a single integrated organism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52544", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 443", "Name": "Advanced Topics in Developmental Biology", "Credits": "4", "Description": "Designed to emphasize cellular, molecular and biochemical aspects of basic developmental questions, this course introduces the student to modern approaches to determination, differentiation and morpho-genesis. Experimental design and analysis of data are emphasized. Possible topics include molecular and cellular aspects of gametogenesis, fertilization, embryogenesis and continuous development in the adult; mechanisms of intra- and intercellular communication; and pattern formation and positional information. Developmental model systems using unicellular organisms are considered. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52545", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and BIOL 442 and ENGL 100 with a grade of ‘C’ or better."}, {"Course": "BIOL 444", "Name": "Development and Cancer", "Credits": "4", "Description": "This course will explore at the molecular level the interface between animal development and cancer. Through a combination of didactic lectures, reading of the primary scientific literature, and in-class presentations students will explore the latest advances in understanding how the processes that govern normal cell growth and differentiation become altered in cancer. Topics will include signaling mechanisms, stem cell biology, and cell cycle control.", "Grading": "Graded", "Course ID": "52546", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}]