[{"Course": "AMST 344", "Name": "Made in America: Material Culture in the United States", "Credits": "3", "Description": "Material culture consists of the artifacts that Americans construct to meet social/ technological needs and to reflect basic ideas, images and values. Using an interdisciplinary, cross-cultural approach, this course examines how diverse people modify their physical environments. Topics include traditional folk cultural crafts, everyday environments and mass-produced artifacts. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52153", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 345", "Name": "Indigenous Heritage: Issues of Representation and Ownership", "Credits": "3", "Description": "Indigenous heritage can be understood as the objects, historical documents, stories, memories, cultural practices, and places that are important to Indigenous cultures across the world and are interpreted and preserved for future generations, such as in museums. The course will focus on the theories and methods of representing Indigenous cultures and peoples within the heritage and museum enterprise, as well as examine the concept and negotiations of Indigenous cultural ownership of heritage and museum processes. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102098", "Consent": "Instructor Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "AMST 350", "Name": "Critical Decades", "Credits": "3", "Description": "An interdisciplinary holistic analysis of certain critical decades in the history of American culture. Focusing on significant turning points, developments in literature, art, religion and social experimentation are studied within their political and social context. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52154", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 352", "Name": "American Culture in Global Perspective", "Credits": "3", "Description": "This course is an interdisciplinary, comparative study of selected aspects of American life. Using materials and approaches from various disciplines, the course will illuminate the meaning and history of particular American social structures, cultural values and ideological themes by placing them in global perspective. Topics have included the history, structure and experience of American and South African race relations; the uses and meanings of “freedom” and “democracy” during the 18th-century American Revolution and 20th century collapse of Soviet-dominated Eastern Europe; the purpose and definitions of family life, civic life and nature in Euro-American and Native-American cultures; and the interdependence of gendered economies in the United States and Mexico. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52155", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "AMST 356", "Name": "Special Topics in U.S. Social Structures", "Credits": "3", "Description": "An interdisciplinary study of selected issues in U.S. social structures, focusing on particular institutional structures and practices that shape and are shaped by the experiences of individuals and social groups in American society. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One lower level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52157", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Native American Cultures, U.S. & Cuba-Bridging, Gender & The Environment, Gender & Sport In Amer, Blk Masculin In Amer Lit, U.S. & Latin Amer. Music"}, {"Course": "AMST 357", "Name": "Special Topics in Global America", "Credits": "3", "Description": "An interdisciplinary study of selected issues in communications and media and the arts in American culture. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52158", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 358", "Name": "Special Topics in American Signs", "Credits": "3", "Description": "An interdisciplinary study of selected issues in American Signs, focusing on analysis of oral, written, visual, and material representations of American life and culture and the historical and social contexts in which they are produced and consumed. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "52159", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Teacher In Amer. Culture, American Horror Film, 50 Years of Sitcom Families, Documenting Cultural Heritage, Sixty Years of Sitcom Families"}, {"Course": "AMST 359", "Name": "Issues in American Studies", "Credits": "3", "Description": "An interdisciplinary study of selected issues in American culture and society. Intended for students at the junior/senior level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52160", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 365", "Name": "Asian American Fictions", "Credits": "3", "Description": "In this course, we will examine contemporary literary fiction about Asian Americans to learn about the persistent fictions that shape Asian American identities in the United States. Students will engage with literary fiction, literary review, film, and theory in Asian American studies to help us contextualize our readings of canonical Asian American literary texts. We will explore the relationships between critical moments in Asian American cultural production and Asian American identity formation. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102099", "Consent": "Instructor Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "AMST 372", "Name": "American Food", "Credits": "3", "Description": "This course examines the American food chain, from field to factory to family dinner table. Our approach will be interdisciplinary and because we are part of an international food network, cross-cultural. Topics include the history and global ecology of agriculture and food production; the worldwide significance of the Colombian exchange; the technological, nutritional and economic aspects of food processing and marketing; the globalization of American fast food abroad; the history and ethnography of food habits, both mainstream and subcultural; the effects of immigration on American cuisine; health, safety and aesthetic trends in food consumption. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52164", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "AMST 375", "Name": "Studies in Asian American Culture", "Credits": "3", "Description": "This course surveys salient topics and debates in Asian American cultural studies. The course begins with historical information on patterns of immigration for various Asian immigrant groups, but our main focus will be to explore the cultural contributions of Asians in the U.S. through literature and film. We will explore the role of cultural expression and artistic representation in Asian American attempts to establish a sense of belonging and cultural presence in the U.S. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "100359", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "AMST 376", "Name": "The American Dream", "Credits": "3", "Description": "This course focuses on the American Dream and the closely related concept of American exceptionalism. Americans have long felt a unique destiny to set an example as a ‘city on a hill’ a beacon of freedom, and an ‘engine of democracy.’ The course examines the origins, shifting definitions, and many versions of the American Dream; identifies the major cultural arenas for the display and discussion of American exceptionalism; and explores the surrounding conflicts and controversies. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "100551", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "AMST 378", "Name": "Poverty in American Culture", "Credits": "3", "Description": "This interdisciplinary course examines the history, cultural contexts, discourses and politics of poverty in American life. The course surveys the history and contexts of American ideologies and policies regarding poverty, and analyzes the ways key cultural constructs about poverty have been deployed in academic, professional, and political discourses to shape public policy in the late twentieth and early twenty-first centuries. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102590", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 380", "Name": "Community in America", "Credits": "3", "Description": "A consideration of the concept of community in America, examining dimensions of place, social structure and cultural identity. Changing forms of community - rural, small town, urban- provide the framework for the course, with primary emphasis upon the role of community in American life. The course draws upon examples from the Baltimore metropolitan area and employs community studies from a range of fields. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52166", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 382", "Name": "Perspectives on the Family", "Credits": "3", "Description": "An investigation of family life in America in various historical periods and among different subgroups. Three themes or questions dominate the course: the relationship of the family to the social context within which it exists; the nature and cause of different forms of family life within various American subcultures, past and present; and the extent to which the family has changed and not changed during several centuries. Specific families examined include the colonial New England family, the 19th-century urban middle class, the ethnic family, the black family and the contemporary family. Within each of these types of family experience, specific topics to be investigated include the role of women, relationships between women and men, attitudes toward children, modes of childrearing, housing styles and others. As part of the course, students examine their own family history. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50035", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "GWST 382 "}, {"Course": "AMST 384", "Name": "Perspectives on Childhood and Adolescence", "Credits": "3", "Description": "Attitudes toward children and childhood as a stage of life are historically contingent phenomena: They are shaped by the social context within which they exist. This course examines attitudes toward children and childen as a social group within various historical settings and among different subcultures in America. We will attempt to understand why these variations occur and how they make sense within our own particular setting. As part of this course, students are encouraged to think critically about their own experience of and attitudes toward childhood. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50034", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 308 "}, {"Course": "AMST 385", "Name": "Teachers in American Culture", "Credits": "3", "Description": "This course examines the social and cultural definitions of teachers in American culture over time. The most enduring images and constructs of teaching, and the social and cultural forces that shape and modify those constructs over time, are identified and explored. Popular representations of teachers and teaching in books, film, and television are examined to understand how Americans have negotiated cultural understandings about teaching school, and society over the past two centuries. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded", "Course ID": "100552", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 388", "Name": "American Environments: Landscape and Culture", "Credits": "3", "Description": "This course will examine the interaction between physical environment and culture in the American experience. Topics will include encounters with diverse American landscapes, exploration of the wilderness and settlement of the changing frontier, the role and evolution of urban and wilderness parks, the changing nature of tourism, and selected case studies involving culture and the environment. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50036", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "AMST 391", "Name": "Studies in American Culture", "Credits": "3", "Description": "What is culture; who makes it, and how does it affect our lives? Combining a theoretical overview of the culture concept and in-depth case studies, the course looks at both dominant cultures and subcultures. Students develop analytical skills using various methodological approaches. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture. Note: It is recommended that students take this course before taking AMST 490. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52167", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 395", "Name": "American Music and Culture", "Credits": "3", "Description": "This interdisciplinary course explores how to write about one of the most important expressive forms of American culture: music. Rather than survey a history of musical genres and personalities, students in this class will analyze the relationship between music-making as a social practice and the creation of various “American” communities. Too often, our writing and our listening skills are passive. Critical thinking, reading, and writing skills are at the core of this course. Recommended Preparation: One lower-level social sciences or humanities course focused on American society or culture.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102101", "Consent": "Instructor Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "AMST 403", "Name": "Ethnography in America", "Credits": "3", "Description": "This course is an introduction to the principles, methods, and uses of ethnography, as well as key concepts and ethical issues concerning ethnographic methods of inquiry. Drawing on theory from anthropology and sociology, the course will examine types of ethnographic literature, the ethnographic voice, and concepts of objectivity and subjectivity in analysis and description. Emphasis will be placed on the ethnographic techniques of participant observation, interviewing and documentation. Additionally, the course will examine and engage students in the processes of interpreting and analyzing qualitative data. Students will complete a research practice project that includes writing an ethnographic text. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52144", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 404", "Name": "Internship", "Credits": "1", "Description": "For students interested in an introductory internship experience or who are able only to devote limited time for the internship. Students are expected to commit 40 hours a semester per credit. For example, for three credits, the expectation would be 120 hours of field work. The internship allows students to apply academic concepts and ideas to a work environment outside the classroom. Recommended Preparation: Six credits of American Studies courses, and permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52170", "Consent": "No Special Consent Required", "Components": "Field Studies"}, {"Course": "AMST 410", "Name": "Seminar in U.S. Social Structures", "Credits": "3", "Description": "Advanced study of a specific problem in U.S. social structures, focusing on particular institutional structures and practices that shape and are shaped by the experiences of individuals and social groups in American society. The seminar is designed to develop research and analytical skills specific to this area, and students will have the opportunity to do original research. Topics will be published in the Schedule of Classes. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52173", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Jew Identity & US Hist, Black Hair/Body Politics, The Many Meanings of Meat, Race, Profit, Masculinities & Birth of U.S. Empir"}, {"Course": "AMST 413", "Name": "Policing and Prisons in U.S. Society", "Credits": "3", "Description": "This course examines the historical, political, economic, and social bases of policing and prisons in American society. Specifically, the course engages the nature of the “carceral” through an interdisciplinary exploration of how prisons function as institutions of moral training, the ways prisons and policing disparately and uniquely impact groups along varying lines of race, gender, and class identity, and how incarcerated people and other groups have advocated for both prison reform and abolition. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level.", "Grading": "Graded", "Course ID": "102784", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 420", "Name": "Seminar in Global America", "Credits": "3", "Description": "Advance study of a specific topic in Global America: The U.S. in the World, The World in the United States. Courses in this category explore the relationships of America with other countries and cultures, including globalization, migrations, immigration, diasporic experiences in America, and transnational cultures. The seminar is designed to develop research and analytical skills specific to this area, and students will have the opportunity to do original research. Topics will be published in the Schedule of Classes. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52176", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Public Hist, Public Cult, Sem In Cultural Policy, Cult Pltcs Of Pop Cntrl, Media Literacy & Racial Representations, Food Voice, Global Museum Studies, Power, Place, and Identity,Global Cultural Heritage"}, {"Course": "AMST 422", "Name": "Preserving Places, Making Spaces in Baltimore", "Credits": "3", "Description": "This is an applied research course where students develop an innovative preservation project on overlooked local history in Baltimore by using the skills of social entrepreneurship. The professional and scholarly aspects of the field of historic preservation and the study of place will be applied to a community project in the greater Baltimore region. This course will educate students about preserving local cultural traditions and community engagement. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level ", "Grading": "Graded", "Course ID": "100360", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 430", "Name": "Seminar in American Signs", "Credits": "3", "Description": "Advanced study of a specific problem in American signs, focusing on interdisciplinary analysis of oral, written, visual, and material representations of American life and culture and the historical and social contexts in which they are produced and consumed. The seminar is designed to develop research and analytical skills specific to this area, and students will have the opportunity to do original research. Topics will be published in the Schedule of Classes. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52175", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 459", "Name": "Themes in American Studies", "Credits": "3", "Description": "Intensive study of a specialized topic or problem in American culture, employing interdisciplinary methodologies. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52183", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AMST 300 with a C or better before taking this class."}, {"Course": "AMST 464", "Name": "Narratives of Contemporary U.S. Immigration", "Credits": "3", "Description": "This course is a study of immigrant narratives from recent decades primarily through film and literature. New groups arriving to the U.S. long have employed narrative forms to establish recognition in America. In this course we analyze how cultural representations help immigrant groups define an ethnic American identity. In contrast to historical or political tracts, we will investigate what these longer narrative forms offer immigrant groups in their efforts to establish an American cultural identity. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level", "Grading": "Graded", "Course ID": "100362", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 480", "Name": "Community in America Research Seminar", "Credits": "3", "Description": "Intended for students undertaking advanced research, the seminar focuses on a particular issue in the study of American community. Topics address questions of broad relevance to communities nationally or focus on studies of specific communities, many drawn from the Baltimore metropolitan area. In some semesters, the goal may be for public presentation of research findings. Recommended Preparation: Six credits in American Studies courses, 3 at the upper-level, or permission of the instructor. Note: AMST 380, HIST 301, HIST 429, GES 341, GES 342 or comparable courses in related fields strongly recommended.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52187", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AMST 300 with a C or better before taking this class."}, {"Course": "AMST 490", "Name": "Senior Seminar", "Credits": "3", "Description": "The senior seminar provides an opportunity to integrate the subject matter and interdisciplinary methodologies of the major program by focusing on a significant problem in the study of American culture. Emphasis is upon the involvement of students in both the process and content of cultural analysis and interpretation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52188", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete AMST 300 with a C or better before taking this class."}, {"Course": "AMST 495", "Name": "Honors Seminar in American Studies", "Credits": "1", "Description": "Students read, discuss and write about a variety of classic works in American studies. After an intensive grounding in many theoretical approaches to the study of American culture and society, students design a proposal for further research in an area of their own choosing. (For further information on the honors program in American studies, inquire at the departmental office.) Recommended Preparation: Admissions to the American Studies Departmental Honors program and permission of the instructor", "Grading": "Pass/Fail", "Course ID": "52189", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 496", "Name": "Honors Research in American Studies", "Credits": "3", "Description": "After completing the AMST 495 American Studies honors students will enroll in AMST 496, a 3-credit independent study course. We recommend that the student completes AMST 496 in the consecutive semester after AMST 490/495, but we will consider exceptions on a case-by-case basis. The course will be guided by a faculty advisor best-suited to advise your honor’s research topic. Students must approach and meet with the faculty member to secure the faculty member’s support as advisor and get permission to register for AMST 496.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52190", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AMST 497", "Name": "Independent Projects in American Studies", "Credits": "1", "Description": "Special projects are designed and the number of credits determined by individual students in consultation with an advisor. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Six credits of American Studies courses and junior/senior level standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52169", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "AMST 498", "Name": "Internship", "Credits": "1", "Description": "For students interested in an introductory internship experience or who are able only to devote limited time for the internship. Students are expected to commit 40 hours a semester per credit. For example, for three credits, the expectation would be 120 hours of field work. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Six credits of American Studies courses.", "Grading": "Pass/Fail", "Course ID": "052170", "Consent": "Instructor Consent Required", "Components": "Field Studies"}, {"Course": "AMST 499", "Name": "Internship With Seminar", "Credits": "4", "Description": "Internship with concurrent seminar that analyzes and evaluates internship experiences from various theoretical perspectives. Recommended Preparation: Six credits of American Studies courses.", "Grading": "Graded/Pass Fail", "Course ID": "52172", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANCS 120", "Name": "Greeks and Romans in the Mediterranean World", "Credits": "3", "Description": "The material in this course will bring together the experiences of the Greeks and the Romans as a part of the Mediterranean world. It will emphasize, among other things, the influence of other cultures on the Greeks and Romans, the interrelationship of Greek and Roman culture, and the progress of Romanization as a result of the spread of Roman culture throughout the empire.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52199", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 150", "Name": "English Word Roots from Latin and Greek", "Credits": "3", "Description": "Students study the debt of English to the two major tongues of classical antiquity in the West. The cognate nature of the Indo-European languages is considered in this basic course in English etymology. Students can expect to experience a large increase in their vocabularies, to learn a systematic way of deducing meanings of new words when a dictionary is not available and to develop the vocabulary of a truly liberally educated person.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52200", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 200", "Name": "Israel and the Ancient Near East", "Credits": "3", "Description": "A survey of the cultures of the ancient Near East including Assyria, Persia, and especially the development of ancient Judaism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50041", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "JDST 200, RLST 201 "}, {"Course": "ANCS 201", "Name": "The Ancient Greeks", "Credits": "3", "Description": "A survey of ancient Greek society including the Aegean Bronze Age, the nature of the polis, the Persian and Peloponnesian wars, life in Athens, Alexander the Great, developments in art and literature, and mythology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052201", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ANCS 201H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 201H", "Name": "The Ancient Greeks-Honors", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052202", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ANCS 201 ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 202", "Name": "The Roman World", "Credits": "3", "Description": "A survey of ancient Roman society including Rome’s march to the empire, the Roman Revolution, Augustus and the creation of the empire, the end of the ancient world, the rise of Christianity, developments in art and literatures, and mythology.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52203", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 202H", "Name": "The Roman World - Honors", "Credits": "1", "Description": "This course is for students who wish to take an honors component in connection with ANCS 202. The student must be enrolled in ANCS 202 to be eligible to take ANCS 202H. Various topics will be looked at in more depth via discussion, class participation and work on the Web.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52204", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ANCS 202 "}, {"Course": "ANCS 203", "Name": "Earliest Christianity", "Credits": "3", "Description": "A survey of the development of early Christianity in the Roman Empire. Topics include the status of foreign religions in the empire, the social world of early Christianity, the attitude of the Roman government toward Christians, persecution and the triumph of Christianity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50040", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "RLST 203 "}, {"Course": "ANCS 204", "Name": "Masterpieces of Ancient Literature", "Credits": "3", "Description": "A study of the classical and/ or Judeo-Christian traditions in Western literature and, in some cases, their relationship to the writings of the Old Testament. Greek and Latin classics such as Homer’s Iliad, Sappho’s and Catullus’ love poetry, and Virgil’s Aeneid, will be read in English translation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50039", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "CPLT 203"}, {"Course": "ANCS 210", "Name": "Classical Mythology", "Credits": "3", "Description": "A study of the principal Greek and Roman myths.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50037", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "RLST 210 "}, {"Course": "ANCS 220", "Name": "Judaism in the Time of Jesus and Hillel", "Credits": "3", "Description": "This course surveys the history of Judaism and the Jewish people from the onset of Hellenism through the second Jewish revolt against the occupation by the Roman Empire. This formative period in the history of Judaism, of early Christianity and of Jewish-Christian relations is interpreted in light of extant primary and secondary literary and archaeological sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50038", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "JDST 201, RLST 202 "}, {"Course": "ANCS 250", "Name": "Topics in Ancient Studies", "Credits": "3", "Description": "An introductory course to various aspects of the classical world. Topics may include warfare, science, women in the classical world, medicine, athletics and religion. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52206", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Trvl/Stdy France/Switz, Mthd & Mtrl Of Research, The School Of Athens, Burial Pract/Ancient Wld, Ancient Science and Technology, Scientific & Medical Terminology in Greek & Latin, Greek Drama,", "additional": "Death, Desire, and the Hero"}, {"Course": "ANCS 301", "Name": "Ancient Civilizations", "Credits": "3", "Description": "A study/travel abroad program to an area of classical or Near Eastern civilization relating to the ancient Greek and Roman world or to an archaeological site of a comparative culture. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52211", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "ANCS 305", "Name": "Warfare in the Ancient World", "Credits": "3", "Description": "History of the strategies, equipment, and culture of war and warfare in the ancient Mediterranean Basin, focusing on the ancient Greeks and Romans, but also covering Near Eastern, Egyptian, Carthaginian, Celtic, and Germanic armies and tactics. We will explore these topics through a combination of lecture, discussion, reading, and experimental methodology, including two exercises in field tactics using model weaponry. Recommended Preparation: ANCS 201 or ANCS 202 ", "Grading": "Graded/Audit", "Course ID": "102334", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANCS 320", "Name": "Gender and Women in the Classical World", "Credits": "3", "Description": "What do we and can we know about the lives of women in ancient Greece and Italy, and how did women and men interact? In this course, archaeological and written evidence will be examined to reconstruct the activities, status and images of Greek, Etruscan and Roman women and place them within their historical and cultural contexts. Attention will be paid to the way both ancient and modern views about women and men influence our understanding of the past and present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50042", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Writing Intensive (WI), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "GWST 330 "}, {"Course": "ANCS 330", "Name": "Ancient Science and Technology", "Credits": "3", "Description": "This course will survey the birth and development of ancient science and technology. Topics may include scientific reasoning and methodology; mathematics, geometry, and astronomy; anatomy and medicine; construction, engineering, and mechanical technology. Historical background - political, economic, social, cultural, and religious - provides insights into related fields of political science, psychology, and ethical philosophy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100244", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)", "Same as Offered": "HIST 330 "}, {"Course": "ANCS 341", "Name": "Studies in World Literature", "Credits": "3", "Description": "A study of selected literary works from a single nation or from several nations, with the focus on a century, movement, genre, theme or individual writer. Topics will be published in the Schedule of Classes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100255", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "ANCS 350", "Name": "Topics in Ancient Studies", "Credits": "3", "Description": "A study of selected literary works from a single nation or from several nations, with the focus on a century, movement, genre, theme or individual writer. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52216", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANCS 351", "Name": "Topics in Ancient Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52217", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Aristotle & Verbal Arts, When Worlds Collide"}, {"Course": "ANCS 365", "Name": "Magic and Witchcraft in the Ancient Mediterranean", "Credits": "3", "Description": "Modern legends of the supernatural and paranormal have ancient roots going back far into human history. This course will explore the contribution of Greece and Rome to the Western tradition of magic and magical thinking. We’ll be exploring the use of daily practical magic and curses as well as the specialized use of astrology, dream-interpretation, and fortune telling in medicine and philosophy. Students will read ancient stories of demons, ghosts, vampires, and werewolves, and the various ways the inhabitants of the Ancient Mediterranean protected themselves from supernatural attack. The course includes an introduction to the study and interpretation of magical texts and items in academic contexts. Recommended Preparation: ANCS 201 or ANCS 202.", "Grading": "Graded/Audit", "Course ID": "102731", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "ENGL 100 or ENGL 100H with a grade of “C” or greater."}, {"Course": "ANCS 370", "Name": "When Worlds Collide: The Rediscovery of Antiquity", "Credits": "3", "Description": "This course surveys the rediscovery of antiquity during the Age of Revolution. Pioneering explorations and early excavations in Europe, Africa, and America are viewed within the context of the late 18th and early 19th centuries. Political revolutions breaking with the past are accompanied by renewed interest in the distant past in colonial America, France, Italy, Spain, Egypt, and Greece, leading to the birth of scientific archaeology and the early development of the discipline of art history.", "Grading": "Graded", "Course ID": "100509", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one 200 level ANCS course or one 200 level ARCH course or one 200 level CPLT course or one 200 level ENGL course or one 200 level HIST course or one 200 level PHIL course or one 300 level ART course with a C or better."}, {"Course": "ANCS 375", "Name": "Ancient Medicine", "Credits": "3", "Description": "History of the development of medicine and medical theory in the ancient Mediterranean basin, focusing on the period spanning the 5th century BCE to 2nd century CE (Hippocratic Corpus to Galen). Course material covers how and why theories about the human body arose and vied for dominance; students will explore the ancient roots of professionalism, pharmacy, surgery, gynecology, ethics, public health, hygiene, and medical law. Recommended Preparation: ANCS 201 or ANCS 202", "Grading": "Graded/Audit", "Course ID": "102338", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "ANCS 397", "Name": "Internships in Ancient Studies", "Credits": "1", "Description": "Students may earn academic credit by arrangement with the Ancient Studies department by working in an approved internship in museum studies, library studies, teaching, and webpage design. Written work, in addition to practical experience, may be required. This course is repeatable for credit. Students may complete a maximum of 12 credits.", "Grading": "Graded", "Course ID": "52218", "Consent": "Department Consent Required", "Components": "Field Studies"}, {"Course": "ANCS 398", "Name": "Independent Projects in Ancient Studies", "Credits": "1", "Description": "Various topics in ancient literature, archaeology and history. This course is repeatable for credit. Recommended Preparation: Ancient studies major with B average.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52219", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ANCS 399H", "Name": "Comprehensive Readings in Ancient Studies - Honors", "Credits": "3", "Description": "During one semester of the senior year, majors with at least a B average in ancient studies courses may read widely from an extensive list of ancient sources drawn up by the Department of Latin or Greek Literature, Ancient History or Archaeology. The list will be available to students at any time preceding the semester for which credit is given. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52221", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ANCS 453", "Name": "Ancient Greece", "Credits": "3", "Description": "This course surveys the history of Greece from the earliest times to the death of Alexander. Topics include the Aegean Bronze Age, Greek colonization and the emergence of tyranny, the development of the city-state in Sparta Athens, the Persian Wars, the classical age and the Peloponnesian War, the rise of Macedonia, and the conquests of Alexander the Great and their impact. Recommended Preparation: ANCS 201, ARCH 200, or HIST 110, junior/senior status.", "Grading": "Graded/Audit", "Course ID": "054726", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 453 "}, {"Course": "ANCS 455", "Name": "The Roman Republic", "Credits": "3", "Description": "This course surveys the history of ancient Rome from the earliest times to 31 B.C.E. Topics include Roman imperialism in Italy and the Mediterranean, the conflict of the orders, the Punic Wars and the collapse of the republic. Recommended Preparation: ANCS 202, ARCH 201, or HIST 110, junior/senior status.", "Grading": "Graded/Audit", "Course ID": "054728", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 455 "}, {"Course": "ANCS 456", "Name": "The Roman Empire", "Credits": "3", "Description": "This course explores the history of ancient Rome from the Augustan Age to the disintegration of the empire in the West. Topics include the Pax Romana, the military monarchy and anarchy, the reorganization of the empire by Diocletian and Constantine, the rise of Christianity, and the collapse of the western empire. Recommended Preparation:  ANCS 202, ARCH 201, or HIST 110; junior/ senior status", "Grading": "Graded/Audit", "Course ID": "054729", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 456 "}, {"Course": "ANCS 498H", "Name": "Honors Thesis in Ancient Studies I", "Credits": "3", "Description": "Research and writing of an honors thesis in ancient studies. ANCS 498H, ANCS 499H comprise a two-semester sequence and are part of the departmental honors program. To be taken in senior year. (Further information available from the department.) This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52223", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "ANCS 499H", "Name": "Honors Thesis in Ancient Studies II", "Credits": "3", "Description": "Research and writing of an honors thesis in ancient studies. ANCS 498H, ANCS 499H comprise a two-semester sequence and are part of the departmental honors program. To be taken in senior year.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52225", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "ANTH 101", "Name": "Introduction to Anthropology", "Credits": "3", "Description": "Introduction to Anthropology explores the four traditional fields of anthropology: physical/biological anthropology, archeology, linguistic anthropology, and cultural anthropology. Students will be introduced to key research questions, methods, and findings generated by anthropologists from across these sub-disciplines. Topics to be explored include: the fossil trail and hominid evolution, archeological methods and theories used to understand material culture, historical and present-day approaches to the study of language, and core concepts in cultural anthropology such as ritual, social structure, and meaning. The course employs a cross-cultural approach to allow students to gain an appreciation of the diversity of past and present human cultures.", "Grading": "Graded/Audit", "Course ID": "102011", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "ANTH 211", "Name": "Cultural Anthropology", "Credits": "3", "Description": "An introduction to the central concepts and issues in cultural anthropology. The course employs a worldwide comparative perspective that examines topics such as: the concept of culture, cultural-ecological systems and family organization; magic, religion and witchcraft; socialization, personality and mental illness; conflict resolution and warfare.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52228", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ANTH 211Y ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "ANTH 211Y", "Name": "Cultural Anthropology", "Credits": "4", "Description": "An introduction to the central concepts and issues in cultural anthropology. The course employs a worldwide comparative perspective that examines topics such as: the concept of culture, cultural-ecological systems and family organization; magic, religion and witchcraft; socialization, personality and mental illness; conflict resolution and warfare.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100249", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ANTH 211 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "ANTH 212", "Name": "The Ethnographer’s World", "Credits": "3", "Description": "An overview of the ways in which anthropologists have studied and written about distinct cultural systems in numerous world regions. Using ethnographic case studies, the course explores how diverse cultural groups confront such issues as gender roles, political organization, economic strategies and colonialists. Particularly attentive to the problems of conducting ethnographic research in a changing world characterized by transnational ties, the course is meant for those students interested in global issues and in ethno-graphic writing. Prospective anthropology majors are particularly encouraged.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52229", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "ANTH 213", "Name": "Focused Cultural Study: (region of the world/culture group to be specified in each iteration of the course)", "Credits": "3", "Description": "This course will focus on a specific geographic region or culture. Through anthropological accounts, the course will examine how people in a particular region or group draw on cultural beliefs and practices in the context of social change and globalization. These accounts will also allow students to investigate key concepts in anthropology. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102208", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANTH 214", "Name": "Focused Cultural Study: South Asia", "Credits": "3", "Description": "This course examines how people are making – and making sense of – their lives in a changing South Asia. Students will read ethnographic accounts from different parts of South Asia, each with their own particular histories, languages, and religious and ethnic identities. Students will use these readings and other material to examine how people in these communities draw on cultural beliefs and practices in the context of social change and globalization. These accounts will allow students to investigate key concepts in anthropology, as well as to learn about contemporary South Asia.", "Grading": "Graded", "Course ID": "102449", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Same as Offered": "ASIA 214 "}, {"Course": "ANTH 224", "Name": "Focused Cultural Study: The Caribbean", "Credits": "3", "Description": "This course explores contemporary Caribbean cultures, as well as the historical, political, and economic processes that shape present day life. Students will read ethnographic accounts from various island societies of the region to examine anthropological concepts, themes, and debates. These studies will allow student to challenge and unsettle commonly held notions and stereotypes about this multifaceted region and its people. Using a comparative approach, students will gain an understanding of the great overlap and variation among Caribbean nations and cultures.", "Grading": "Graded", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)"}, {"Course": "ANTH 297", "Name": "Selected Topics in Anthropology", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52230", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "American Folklife, The World Of Language II, World Language Commun, Germ Ethnic Culture, Ethnography Of Melanesia, Anthropology Of Gender, World Language Comm., World Language Communit, World Language Community, Mthds & Mtrls Research, World Lang Communities, Magic And Witchcraft", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 302", "Name": "Human Evolution, Physical Anthropology, and Archaeology", "Credits": "3", "Description": "This course explores the use of physical anthropology and archaeology in examining the ancient history of the human species. It traces our earliest fossil-archaeological remains in discussing worldwide cultural evolution and genetic variation from the first humans to the rise of urban societies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52231", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 304", "Name": "Kin, Community, and Ethnicity", "Credits": "3", "Description": "This course explores kinship systems, ethnicity, neighborhood and other social arrangements in various cultural settings through the reading of selected ethnographic materials. The course also will investigate how anthropological approaches to social organization reflect broader philosophical and political changes in our society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52233", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 310", "Name": "Ethnographic Film", "Credits": "3", "Description": "The objectives of the course are to present ethnographic films that introduce the concept of culture, the significance of diversity and representation of the other, and address key processes and issues in anthropological filmmaking.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52234", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must complete SOCY 201 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 311", "Name": "Urban Anthropology", "Credits": "3", "Description": "This course examines the phenomenon of urbanism, highlighting the intersections between city life, social organization, and culture throughout the world. Cities will be analyzed from a holistic perspective, detailing the evolution and organization of cities, their impact on diverse populations, and possibilities for sustainability.", "Grading": "Graded/Audit", "Course ID": "52235", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 312", "Name": "Medical Anthropology", "Credits": "3", "Description": "This course explores human health and illness in cultural and social contexts. This course will introduce a range of concerns and approaches within medical anthropology, introducing key concepts and methods. It will examine how people in different places and positions experience illness, suffering, healing, and their bodies more generally and the roles played by cultural, social, political, economic, legal, and technological factors. This course will also explore how research within this field is conducted, analyzed, written about, and translated into policy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52236", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 and ENGL 100 with a “C” or higher."}, {"Course": "ANTH 313", "Name": "Applied Anthropology", "Credits": "3", "Description": "Applied Anthropologists employ the theories and methods of anthropology to address practical problems and social issues in cultural context. Applied anthropologists often have the goal of improving the lives and well-being of human groups worldwide and attend to issues of inequality and social justice. This course explores how anthropologists use an anthropological lens to analyze and intervene on a range of issues, which may include discussions of international development, women’s rights, education policy, and health care. Applied Anthropology explores theories of practice, common methods used and refined by applied anthropologists, and the ethical debates surrounding applied work. In addition, students examine how understandings of culture, subjectivity, and sociohistorical experience can help inform interventions and policy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52237", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 with a C or better."}, {"Course": "ANTH 316", "Name": "Anthropology of Religion", "Credits": "3", "Description": "This course examines the nature of belief systems, myth, and ritual in various societies of the world through ethnographic case studies. Cases to be examined may be drawn from societies in South America, Asia, the Pacific, Africa and the United States. Using these different case studies, the course examines a range of perspectives used by anthropologists to understand religious practices and belief systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50044", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "RLST 316 ", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 with a C or better."}, {"Course": "ANTH 317", "Name": "Contemporary Problems in Anthropological Perspective: Special Topics", "Credits": "3", "Description": "The course explores issues of global significance from a cross-cultural perspective by focusing on the tensions between increasing diversity of perspective in an increasingly interdependent world. From the view points of an emergent anthropology in action, we will examine the comparative, cross-cultural contexts of demographic change, ecology, economic development, information systems, international health, and nationalism. We will study anthropological texts that broaden the cultural analysis of the global change process and its effects on institutions and communities. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52240", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANTH 318", "Name": "Anthropology of Science and Technology", "Credits": "3", "Description": "This course explores the social construction of science and technology across cultural contexts. The course will examine the social expectations of science, how scientists do their work, and the ways that scientific activity is embedded in contexts of capitalism, institutional arrangements, politics, and religion. The course will also examine the products of science, looking at how technology shapes social interaction and engagement with the world.", "Grading": "Graded/Audit", "Course ID": "52241", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 and ENGL 100 with a ‘C’ or higher."}, {"Course": "ANTH 320", "Name": "Witchcraft and Magic", "Credits": "3", "Description": "This is a course that concerns witchcraft, magic and sorcery. These behavioral and symbolic forms exist or have existed in virtually all human societies and cultures. In the West, they may be generally referred to as occult practices, exist in a separate domain from everyday life, and refer to an unseen world. In contrast, in indigenous societies, witchcraft, magic and sorcery may permeate life and interpersonal relations in distinctive ways. Currently, the significance and role of witchcraft have been increasing in importance in many cultures; in addition, the development of Wicca in the West also attests to the vitality of these beliefs. In this class, we will deal with a variety of issues, including defining these entities, showing how they work in different types of societies, exploring differences among traditions, and discussing if and how they might work.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52242", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANTH 321", "Name": "Education, Culture, and Society", "Credits": "3", "Description": "This course takes an anthropological approach to the study of education. Students will examine the sociocultural dynamics of teaching and learning across diverse settings within the U.S. and other societies, focusing on the interrelationships among educational processes, cultural identities and structures of power. Students will explore how such analyses inform public discourses on schooling and efforts at reform.", "Grading": "Graded/Audit", "Course ID": "102652", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 with a C or better."}, {"Course": "ANTH 322", "Name": "Forensic Anthropology", "Credits": "3", "Description": "This course examines the science and methods of physical anthropology as it relates to medico-legal work done to identify unknown dead found in atypical circumstances. This introductory course in forensic science introduces human osteology and dentition to identify age, sex, stature and ancestry; methods for processing remains and interpreting evidence of trauma; and techniques for estimating the time of death and post-death affects. Be advised that course materials graphically depict trauma-inflicted individuals in states of decomposition.", "Grading": "Graded", "Course ID": "102209", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANTH 326", "Name": "American Indian Cultures", "Credits": "3", "Description": "Drawing on contemporary ethnographic studies, this course explores the cultural diversity of peoples indigenous to the Americas. It focuses in particular on North American Indians’ political and economic adaptation in response to social change.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52245", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 with a “C” or higher."}, {"Course": "ANTH 367", "Name": "The Anthropology of Gender", "Credits": "3", "Description": "The Anthropology of Gender concerns the wide range of meanings given to gender and sexuality in different settings. In exploring how gender and sexuality are culturally constructed the course does not focus on the biology of gender and sexuality per se. Rather, the course explores distinctive people’s understandings of gender and sexuality. Lectures focus on basic principles by which to examine gender in cross-cultural perspective. Readings focus on detailed and complex examples of distinctive gender and sexuality system.", "Grading": "Graded", "Course ID": "100972", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 367 ", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 with a C or better."}, {"Course": "ANTH 382", "Name": "Global Flows in Local Worlds: The Anthropology of Globalization", "Credits": "3", "Description": "Global Flows in Local Worlds examines globalization from the perspective of local communities. Students will explore the interaction among transnational economic, technological, ideological, and material flows and localways of life. The course will use ethnographies and case studies to examine how development and tourism ideologies, media, and migration/transmigration, among other issues, are experienced at the local level, with particular attention to issues of identity, social relationships, subsistence, and well-being. By exploring globalization with a qualitative, insider perspective, this course will provide students with insight into the deep social and cultural webs connecting and transforming societies worldwide.", "Grading": "Graded", "Course ID": "101909", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 with a C or better."}, {"Course": "ANTH 397", "Name": "Selected Topics in Anthropology", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits. Recommended Preparation: ANTH 211, SOCY 101.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52247", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ANTH 399", "Name": "Independent Study", "Credits": "1", "Description": "This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52248", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete a minimum of 9 credits of Anthropology courses each with a minimum grade of “C”."}, {"Course": "ANTH 400", "Name": "Anthropological Theory", "Credits": "3", "Description": "This course presents anthropological theory in historical perspective focusing on the rise of a distinct anthropological perspective on the comparative study of human societies and cultures. The course will detail various theoretical models developed in the 19th and 20th centuries to explain the similarities and differences in cultural systems. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52249", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ANTH 211 or 2 other Anthropology 300-level courses with a grade of ‘C’ or better."}, {"Course": "ANTH 402", "Name": "The Ethnography of Communication", "Credits": "3", "Description": "At the intersection of linguistics and anthropology, the ethnography of communication has as its goal an understanding of the patterning of communicative behavior within culture. Topics to be covered in the course include: what it means to talk in different cultural contexts, the functions of literacy in the United States and elsewhere, the symbolic organization of the world in writing and speaking, language attitudes and social prestige, and how languages and cultures are acquired and reproduced. Readings will include case studies drawn from work on various cultures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52251", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete an Anthropology 300-level course with a minimum grade of C."}, {"Course": "ANTH 416", "Name": "Cyberspace Culture", "Credits": "3", "Description": "The “information super highway,” “communications revolution” and “cyberspace” are used to describe the contemporary revolution in human communications. This course will explore the cultural and societal implications of computer-mediated communications (CMC) by addressing such topics and questions as: representations of self and self-identity in cyberspace, interactions in cyberspace, information technology and institutional change, community formation in cyberspace, democracy and collective action in cyberspace, and order and deviance in cyberspace. Throughout the course, contemporary technological advances will be compared and contrasted with the cultural and societal effects of previous technologies, such as the printing press, wireless telephone, television.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50045", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 416 ", "Prerequisite/Corequisite": "You must complete ANTH 211 or ANTH 212 or SOCY 101 or SOCY 101H and, in addition, 9 credits in Sociology and Anthropology. Each course must have a minimum grade of C."}, {"Course": "ANTH 419", "Name": "Qualitative Methods in Social Research", "Credits": "3", "Description": "This course will focus on the styles of research, analysis and epistemologies associated with qualitative research in the applied social and policy sciences. As an increasingly important mode of inquiry, qualitative, multi-method approaches are particularly relevant to the study of social interaction and behavior in natural settings. Qualitative approaches involve the collection and analysis of empirical information from multiple sources, such as first-person accounts, life histories, visual/printed records, semi-structured and open-ended interviews, informal and formal observations, biographical and autobiographical materials, among others. Students in the course will learn how to design, collect and analyze qualitative information by conducting a small, semester-long study. Sections of the research project will be prepared, presented and evaluated throughout the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50048", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 419 ", "Prerequisite/Corequisite": "You must complete ANTH 211 or SOCY 101 and, in addition, 9 credits in Sociology or Anthropology. Each course must have a minimum grade of C."}, {"Course": "ANTH 424", "Name": "Psychological Anthropology", "Credits": "3", "Description": "This course examines the inter-relationships between psychological processes, culture, and society. It will introduce the history and range of topics within psychological anthropology, including child socialization and selfmaking, religious experience and altered states of consciousness, emotion and cognition, and psychopathology across cultures. Students will explore how social and cultural environments shape people and how people make use of those socio-cultural worlds in ways that are psychologically satisfying and meaningful.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52238", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Culture (GFR), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete ENGL 100 and ANTH 211, SOCY 101, or PSYC 100 with a grade of ‘C’ or better."}, {"Course": "ANTH 480", "Name": "Anthropological Research: Capstone", "Credits": "3", "Description": "This capstone course provides students with an intensive, hands-on experience applying anthropological theories and methods to investigate a research topic. The course explores a range of research methods found within anthropology, including participant observation and informal and formal interviewing, followed by qualitative data analysis approaches. Over the semester students develop and implement a research project utilizing these techniques. The course also examines issues of representation. Students are expected to present their findings. Recommended Preparation: ANTH 400  (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52232", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete SOCY 101 or ANTH 211 and 6 upper level credits in Anthropology; all with a C or higher."}, {"Course": "ANTH 491H", "Name": "Honors Thesis Research I", "Credits": "3", "Description": "This course is the first in a two-course individual study sequence, along with ANTH 492H, that leads to fulfilling the requirements of the departmental Honors Program in Anthropology. During this sequence, the student completes an original research project leading to an Honors Thesis under the supervision of two full-time faculty members in the department who serve as the Honors Committee. The Honors Thesis typically is completed during a student’s final year at UMBC. Note: Interested students should contact their Anthropology major adviser or the Anthropology program director for more information about the Honors Thesis. Students considering graduate school in Anthropology are particularly encouraged to pursue this option. In addition to the prerequisites listed for this course, students must also have a cumulative GPA of 3.5 in all Anthropology and Sociology courses and receive approval from their committee members.", "Grading": "Graded", "Course ID": "052250", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete at least 60 credits and complete ANTH 480 and two other upper level ANTH courses, each with a minimum grade of a “B” and have a cumulative GPA of 3.0"}, {"Course": "ANTH 492H", "Name": "Honors Thesis Research II", "Credits": "3", "Description": "This course is the second in a two-course individual study sequence, which begins with ANTH 491H. Together, these courses lead towards fulfilling the requirements of the departmental Honors Program in Anthropology. During this sequence, the student completes an original research project leading to an Honors Thesis under the supervision of two full-time faculty members in the department who serve as the Honors Committee.", "Grading": "Graded", "Course ID": "052252", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ANTH 491H with a minimum grade of B."}, {"Course": "ANTH 497", "Name": "Advanced Selected Topics in Anthropology", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52255", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ANTH 211 and 9 credits of Anthropology. You must earn a minimum grade of C for each course."}]