[{"Course": "EDUC 419", "Name": "Assessment for Reading Instruction", "Credits": "3", "Description": "This course is designed to assist pre-service teachers in conducting classroom-based literacy assessments. The course content includes an examination of and practice using a range of assessments for reading, writing and related skills, focusing on the relationship between assessment and instructional planning for diverse learners. Instruction will focus on the purpose of assessment, types of assessment tools, how to administer and use several formal and informal assessments, how to interpret assessment results, and how to communicate assessment results to a variety of constituents.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53511", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  EDUC 416  and EDUC 418. You must be accepted into Phase I of internship."}, {"Course": "EDUC 420", "Name": "Teaching Mathematics in the Elementary School", "Credits": "3", "Description": "This course introduces mathematics teaching at the elementary and middle school levels, including: (1) school mathematics content, (2) students’ mathematical thinking; (3) designing, selecting, and sequencing mathematical learning experiences and assessments; and (4) your beliefs about mathematics and mathematics learning and teaching. The course emphasizes teaching for understanding; inquiry learning; and representing mathematics with manipulatives and other technologies. Topics include mathematical reasoning, problem solving, and proof; spatial reasoning, geometry, and measurement; number, number systems, and operations; and algebraic thinking across the grades. A field experience is required. Recommended Preparation: EDUC 412 and permission of the department", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53512", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be accepted into Phase I of internship."}, {"Course": "EDUC 421", "Name": "Teaching Science in the Elementary School", "Credits": "3", "Description": "This course is designed to help teachers acquire general science understanding and to develop teaching materials for practical use in classrooms. It includes experiments, demonstrations, constructions, observations, field trips and use of audiovisual material. Field experience is required in this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53513", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412."}, {"Course": "EDUC 422", "Name": "Social Studies in the Elementary School", "Credits": "3", "Description": "This course provides an analysis of the social studies curriculum in elementary schools. Aims and trends in social studies curricula are examined. Teacher candidates will develop methods of instruction and evaluation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53514", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412."}, {"Course": "EDUC 423", "Name": "Methods of Teaching Speech and Drama in the Secondary School", "Credits": "3", "Description": "Class plans, units and courses of study for teaching speech, oral interpretation and drama in high school. Objectives of speech and drama education, evaluation of performances, choice of plays for high schools and methods of directing high school dramatic activities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50068", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "SPCH 301 ", "Prerequisite/Corequisite": "You must complete EDUC 412."}, {"Course": "EDUC 425", "Name": "Methods of Teaching English in the Secondary Schools", "Credits": "3", "Description": "This course examines how notions of race and ethnicity are represented, contested, and reconsidered in U.S. literature. Special attention will be paid to how race intersects with gender, sexuality, and class. Course readings are drawn from writers of a range of ethnic backgrounds. Recommended Preparation: Completion of 200-level literature course with a grade of C or better.", "Grading": "Graded/Audit", "Course ID": "50067", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ENGL396 ", "Prerequisite/Corequisite": "You must complete EDUC412."}, {"Course": "EDUC 426", "Name": "Methods of Teaching Mathematics in the Secondary School", "Credits": "3", "Description": "This course introduces mathematics teaching at the middle and high school levels, including: (1) secondary school mathematics content, (2) understanding and developing students’ mathematical thinking; (3) designing, selecting, and sequencing mathematical tasks and assessments; and (4) your beliefs about mathematics learning and teaching and mathematics itself. The course emphasizes teaching for understanding; discovery learning; and representing mathematics with manipulatives, graphing calculators, Geometer’s Sketchpad, and other technologies. Topics include innovative curricula for learning and teaching mathematical reasoning, problem solving, and proof; proportional reasoning; algebraic thinking; trigonometry; spatial reasoning, geometry, and measurement; and probabilistic thinking. A semester-long, one-day per week field experience is required. Students in this course also enroll in Phase I of the 100 day internship.", "Grading": "Graded/Audit", "Course ID": "53516", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412  with a ‘B’ or better."}, {"Course": "EDUC 427", "Name": "Methods of Teaching Science in the Secondary School", "Credits": "3", "Description": "Students develop a holistic, interdisciplinary understanding of teaching science. The course focuses on designing, using, and assessing various developmentally appropriate teaching strategies, particularly inquiry and action. Students explore active learning strategies/tools, including reflective inquiries, demonstrations, constructions, field trips, observations, educational technologies and authentic teaching experiences. There is an emphasis on adapting subject matter to learner diversity. Field experiences are required in this course.", "Grading": "Graded/Audit", "Course ID": "53517", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412 with a ‘B’ or better. "}, {"Course": "EDUC 428", "Name": "Methods of Teaching Social Studies in the Secondary School", "Credits": "3", "Description": "The course explores the concepts, issues, and methods relevant to teaching social studies at the secondary level. Students gain conceptual knowledge and practical experience with planning, materials development, instructional approaches, and assessment that meet the needs of diverse learners. The course also explores educational technologies for use in social studies curricular planning and instruction. Field experiences are required for this course. ", "Grading": "Graded/Audit", "Course ID": "53518", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412  with a ‘B’ or better"}, {"Course": "EDUC 429", "Name": "Methods of Teaching Modern Foreign Language in K-12 Schools", "Credits": "3", "Description": "Students review principles of second language acquisition and explore methods and approaches of teaching foreign languages. The course examines current teaching/learning approaches, instructional curricula, and lesson planning. Class activities include lectures, class discussions, demonstrations, observations and reflections, and lesson and unit planning.", "Grading": "Graded/Audit", "Course ID": "53519", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412 with a ‘B’ or better. "}, {"Course": "EDUC 431", "Name": "Methods for Teaching STEM in the Middle Grades", "Credits": "3", "Description": "This course introduces pedagogical practices associated with the teaching and learning of integrated STEM practices at the middle levels. The course addresses ideas that include (1) middle grades science, mathematics, engineering and technology (STEM) content, (2) understanding and developing middle grades students’ thinking;(3) designing, selecting, and sequencing instructional tasks, and (4) assessments for learners in the middle grades.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102438", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "EDUC 432", "Name": "Accommodating Special Needs in Early Childhood Education", "Credits": "3", "Description": "This course offers the history of early childhood education, the basic characteristics of various disabilities, child development, and addressing the needs of young children with disabilities in literacy, math, cognition, social development and play.", "Grading": "Graded", "Course ID": "101953", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 660"}, {"Course": "EDUC 433", "Name": "Mathematics Processes in Early Childhood", "Credits": "4", "Description": "Teacher candidates will study how young children acquire mathematical content and processes. Candidates will also learn how to support, encourage and foster mathematical thinking in young children in a 3 hour/week field experience in a primary grade as part of their Phase I internship. In order to align with Maryland Common Core State Standards/Maryland College and Career Ready Standards, this course places a special emphasis on how to teach concepts about whole numbers, geometry, spatial relationships and measurement.", "Grading": "Graded", "Course ID": "101959", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 661"}, {"Course": "EDUC 434", "Name": "Science Processes in Early Childhood", "Credits": "4", "Description": "This course involves experiential learning with materials, equipment and processes central to teaching science to young children.  In a 3 hour/week field placement, students will use their classrooms and outdoor environments to practice teaching science to young children.  Inquiry practices and integrated curriculum will be emphasized.  Students will design and implement a unit of study to meet NAEYC Standards.", "Grading": "Graded", "Course ID": "101961", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 662"}, {"Course": "EDUC 435", "Name": "Integrated STEM Content and Pedagogy", "Credits": "1", "Description": "Students will review the integrated approaches to teaching Science, Technology, Engineering, and Mathematics (STEM). Integrated STEM pedagogies include project/problem-based (PBL), design-based, and inquiry-based approaches to teaching. This course is repeatable for credit. Students may complete a maximum of 3 credits.", "Grading": "Graded", "Course ID": "102439", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 412M with a ‘C’ or better."}, {"Course": "EDUC 439", "Name": "Observation and Assessment in Early Childhood", "Credits": "3", "Description": "Teacher candidates learn to observe young children, plan, implement and evaluate activities to foster children’s development and to use naturalistic assessment, including work sampling. Teacher candidates begin constructing their professional portfolio following NAEYC standards, which will be used throughout the early- childhood program.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53521", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PSYC 100 with a C or better."}, {"Course": "EDUC 440", "Name": "Field Experience in Early Childhood Education (Level I)", "Credits": "2", "Description": "This course is taken jointly with EDUC 439. Teacher candidates work in nursery schools, child care centers, Head Start programs and public schools for two mornings per week. They observe, plan and implement activities supporting the observational and assessment processes focused on in EDUC 439 and assist the classroom teacher with children’s daily routines.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53522", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PSYC 100 with a C or better."}, {"Course": "EDUC 441", "Name": "Children’s Literature and Other Materials for Early Literacy", "Credits": "3", "Description": "This course explores the critical analysis and selection of a variety of genres of children’s literature and other media for children in diverse educational settings. It emphasizes the skills and dispositions needed to share literature with culturally and linguistically diverse groups of children and explores prevalent myths and stereotypes in society that are often reflected in children’s and young adult literature. Issues pertaining to family engagement and community resources to support the goals of the literacy program are explored. ", "Grading": "Graded/Audit", "Course ID": "53523", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 439 with a ‘B’ or better."}, {"Course": "EDUC 442", "Name": "Process Seminar in Early Childhood Education- Creative Media Level I", "Credits": "1", "Description": "This seminar involves experiential learning, using creative materials and activities appropriate for the early-childhood curriculum.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53524", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 445", "Name": "Field Experience in Early Childhood Education, Level II", "Credits": "1", "Description": "Teacher candidates work in supervised early-childhood classrooms two mornings a week. They are required to do a series of observations on the school and classroom, plan and carry out activities in specific curriculum areas (math, science, social studies) and to assist the teacher with the children’s daily routine.", "Grading": "Graded", "Course ID": "53527", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete EDUC 440."}, {"Course": "EDUC 446", "Name": "Language, Literacy, and Intellectual Development of Young Children", "Credits": "3", "Description": "This course is designed to assist teacher candidates to understand literacy acquisition and processes by observing and analyzing children’s language, reading, and writing development. Current and historical issues in language and literacy practice and research are explores through university classroom experiences, observation of children, and family visits/interviews.", "Grading": "Graded/Audit", "Course ID": "53528", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 439 with a ‘B’ or better"}, {"Course": "EDUC 447", "Name": "Teaching of Reading and Writing in Early Childhood Education", "Credits": "3", "Description": "This course emphasizes methods for early literacy instruction. There is a focus on the components of a culturally responsive reading and writing curriculum for early childhood students in diverse classroom contexts. Teacher candidates implement literacy assessment and instruction with children and engage with children’s families and communities.", "Grading": "Graded/Audit", "Course ID": "53529", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 446 with a ‘B’ or better."}, {"Course": "EDUC 448", "Name": "Phase I Internship", "Credits": "1", "Description": "Students work in supervised public school classrooms in grades 1, 2 or 3 in a professional development school two mornings a week. Each student is required to observe children in activities related to reading and to develop and carry out reading activities. This is Phase I of the internship.", "Grading": "Graded", "Course ID": "53530", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 450", "Name": "Internship in Student Teaching in Early Childhood Education", "Credits": "1", "Description": "Teacher candidates have two placements in early-childhood classrooms in professional development schools. One placement is in a pre-kindergarten or kindergarten, the other in a primary grade. Through a process of increased responsibility, teacher candidates plan, implement and assess lessons and activities for the total classroom, becoming totally responsible for planning and implementation for at least two weeks in each classroom. Teacher candidates should expect to participate in the school for a period longer than one semester, for a total of 100 days, including the days completed in EDUC 448.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53531", "Consent": "Department Consent Required", "Components": "Field Studies", "Attributes": "Course Fee = $750.00"}, {"Course": "EDUC 451", "Name": "Internship Seminar in Early Childhood Education", "Credits": "3", "Description": "In this seminar, teacher candidates enrolled in their intensive internships critically examine their clinical practice, school experiences, and current issues in early childhood curriculum as they relate to the social, intellectual, physical, and personal development of young children.", "Grading": "Graded/Audit", "Course ID": "53532", "Consent": "Department Consent Required", "Components": "Field Studies", "Prerequisite/Corequisite": "You must complete EDUC 488 with a ‘B’ or better."}, {"Course": "EDUC 452", "Name": "Student Teaching in the Elementary Schools", "Credits": "1", "Description": "Directed and evaluated teaching experience in selected classrooms. There is an increased emphasis on independent teaching, maintaining learning communities that serve the needs of diverse learners, an emphasis on discipline-specific planning, implementing and assessing instruction, and focus on academic and social outcomes.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53533", "Consent": "Department Consent Required", "Components": "Field Studies", "Attributes": "Course Fee = $750.00"}, {"Course": "EDUC 453", "Name": "Elementary Internship Seminar", "Credits": "2", "Description": "The seminar provides a forum for discussing and processing field experiences and current issues/problems in teaching and learning. Topics that are addressed include classroom management, assessment strategies, the culture of schools and becoming a professional. The seminar provides a supportive arena to integrate theory, research and practice while preparing teacher candidates for the responsibilities of classroom instruction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53534", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 454", "Name": "Phase I Internship Seminar for Middle School STEM Teachers", "Credits": "2", "Description": "This seminar course provides a forum for discussing and processing Phase I Internship experiences and current topics/issues/trends in STEM middle school teaching and learning. The seminar has been designed to help teacher candidates analyze the many facets of teaching and to become a reflective practitioner. Note: Students must be accepted into Phase I of Internship to enroll in the course.", "Grading": "Graded", "Course ID": "102410", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EDUC 410  and EDUC 412M  with a “C” or better in both courses."}, {"Course": "EDUC 456", "Name": "Student Teaching in the Secondary Schools", "Credits": "1", "Description": "This intensive internship provides students with the opportunity to take progressive responsibility for teaching in their specialty area and developing professional teaching competencies in a Professional Development School with support from a mentor teacher and a university supervisor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53536", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $750.00"}, {"Course": "EDUC 457", "Name": "Secondary Internship Seminar", "Credits": "2", "Description": "The seminar provides a forum for discussing and processing field experiences and current issues/problems in teaching and learning. The seminar has been designed to help teacher candidates analyze the many facets of teaching and to become a reflective practitioner. Topics that are addressed include classroom management, assessment strategies, the culture of schools, developing evidence-based portfolio, and becoming a professional.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53537", "Consent": "Department Consent Required", "Components": "Field Studies, Seminar"}, {"Course": "EDUC 458", "Name": "Internship in P-12 Education", "Credits": "1", "Description": "This intensive internship provides students with the opportunity to take progressive responsibility for teaching in their specialty area and developing professional teaching competencies in a Professional Development School with support from a mentor teacher and a university supervisor.", "Grading": "Graded", "Course ID": "53538", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 466", "Name": "School, Family, and Community Partnerships for Middle Grades STEM Success", "Credits": "3", "Description": "Students examine theories, research, and best practices related to school, family, and community partnerships, with a particular emphasis on strategies to support young adolescents’ success in STEM subject areas.", "Grading": "Graded", "Course ID": "102411", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AMST 200  and EDUC 412M  with a C or better."}, {"Course": "EDUC 470", "Name": "Elementary School Curriculum", "Credits": "1", "Description": "This course provides an in-depth study of curriculum problems, including extensive reading, critical analysis of research and implications for teaching strategies in the various curriculum areas.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53543", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 471", "Name": "Principles of Training and Development", "Credits": "3", "Description": "This course will examine key principles relevant to training and development, including the role of training in an organization, adult learning theory, needs assessment, training methodology, organizational support, resources and constraints, evaluation of training and managing the training function. Issues that influence training implementation, such as ethics and interpretation, also will be addressed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53544", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one from MGMT 210 or EDUC 300 or EDUC 301 or PSYC 355 or SOCY 310."}, {"Course": "EDUC 480", "Name": "Secondary School Curriculum", "Credits": "1", "Description": "This course provides an in-depth study of curriculum problems, including extensive reading and the critical analysis of research and implications for teaching strategies in the various curriculum areas.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53549", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 485", "Name": "The Teaching of Writing", "Credits": "3", "Description": "An introduction to theories and techniques of writing instruction. Current theory and research is applied in the development of a repertoire of approaches to writing instruction and curriculum development. Students examine research that analyzes writing from linguistic, psychological and developmental perspectives. Direct experience in personal writing reinforces theoretical study of the processes of composition and enables prospective teachers to improve their own writing skills. Each student designs a model writing program or course, including a rationale for choices made, that demonstrates how specific features of the course or program will be taught.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50064", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ENGL 485"}, {"Course": "EDUC 489", "Name": "Advanced Special Topics in Education", "Credits": "1", "Description": "This course provides an examination of a selected topic in education. These topics, not offered elsewhere in the curriculum, focus on unique areas of interest, such as training in the institutional setting, the early adolescent learner, law-related education and foundations of multilingual/multicultural education. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53554", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EDUC 490", "Name": "Individual Projects in Education", "Credits": "0", "Description": "The course is open to students with special projects who apply to the instructor who supervises the experience. A written request to register in the course must be submitted to the program coordinator for approval. The request must include a brief description of the project, number of credits sought and the instructor’s signature. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53556", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "Senior standing."}, {"Course": "ELC 041", "Name": "Writing and Grammar for Academic Purposes, Level 4", "Credits": "3", "Description": "This course is designed low-advanced English language students to develop academic writing skills. Students in this class will learn to write successful academic papers through outlining ideas, writing first drafts, peer editing and revising. Students write a variety of progressively longer essays with clear topic sentences, appropriate support materials and logical conclusions. Students also will learn about the different styles of academic writing. This course together with ELCA 402 partially fulfills UMBC’s conditional admission requirements.", "Grading": "Graded", "Course ID": "57357", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ELC 042", "Name": "Reading and Vocabulary Development for Academic Purposes, Level 4", "Credits": "3", "Description": "This course is designed for low-advanced English language students to improve reading comprehension and general language skills. Students will develop advanced comprehension skills, understand figurative language and recognize a writer’s intent. Texts include fiction and non-fiction materials gathered from a wide range of genres and disciplines, emphasizing reading for both information and pleasure. Students are encouraged to participate in discussions and prepare presentations for class. Students participate in class and online discussions, and prepare reading logs and presentations. This course together with ELCA 401 partially fulfills UMBC’s conditional admission requirements.", "Grading": "Graded", "Course ID": "57358", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ELC 043", "Name": "Speaking and Listening for Academic Purposes, Level 4", "Credits": "3", "Description": "This course is designed to increase the spoken fluency and listening comprehension of high-intermediate English students, and to introduce them to English appropriate to an academic environment. Students will develop their skills in taking lecture notes, comprehending academic lectures, creating presentations and participating in class discussions. This course partially fulfills UMBC’s conditional admission requirements.", "Grading": "Graded", "Course ID": "57359", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ELC 051", "Name": "Advanced Writing and Grammar for Academic Purposes, Level 5", "Credits": "3", "Description": "This course is designed to prepare advanced students to write in English with university-level competence and accuracy. Students further develop their skills with the writing process, academic vocabulary, advanced grammatical structures, presentation and analysis of research topics, and narrative and persuasive writing. Students learn to write for specific audiences and purposes and to produce a research paper. This course, along with our other Level 5 courses, satisfies conditional admission to UMBC. Successful completion of the objectives for this course will qualify students for ENGL 110 .", "Grading": "Graded", "Course ID": "57360", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ELC 041 and ELC 042 both with a grade of C or better."}, {"Course": "ELC 052", "Name": "Advanced Reading and Vocabulary for Academic Purposes, Level 5", "Credits": "3", "Description": "This course is designed to help low advanced English learners develop advanced critical reading skills using a variety of source materials. Readings may include articles, non-fiction writing and data presentations. Students will be able to identify major points and types of support, separate fact from opinion and analyze vocabulary used in the text. Students are encouraged to participate in critical thinking exercises and class discussions. This course, along with our other Level 5 courses, satisfies conditional admission to UMBC. Successful completion of the objectives for this course will qualify students for ENGL 110 ", "Grading": "Graded", "Course ID": "57361", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ELC 041 and ELC 042 both with a grade of C or better."}, {"Course": "ELC 053", "Name": "Advanced Speaking and Listening for Academic Purposes, Level 5", "Credits": "3", "Description": "This course is designed to help low advanced English learners master the spoken fluency and listening comprehension skills appropriate for an academic environment. Students will improve their skills in taking well organized lecture notes, comprehending a variety of listening texts, give presentations for different purposes, and discuss familiar and unfamiliar topics in formal and informal situations. The course includes practice in real UMBC academic settings. This course partially fulfills UMBC’s conditional admission requirements.", "Grading": "Graded", "Course ID": "100006", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ELC 043 with a grade of C or better."}, {"Course": "ELC 054", "Name": "Cross-Cultural Communication and University Life", "Credits": "3", "Description": "This course is designed to develop students’ English speaking and listening skills through the study of culture, especially as portrayed in media. Students discuss, debate, and analyze how cultural values and beliefs are demonstrated in society. Students further develop their intercultural communications skills through case studies, online discussions, and journaling. Students utilize technology to create a final class project on cross-cultural communication.", "Grading": "Pass/Fail", "Course ID": "57363", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture"}, {"Course": "ELC 061", "Name": "Writing for Research and Professional Purposes, Level 6", "Credits": "3", "Description": "This course is designed for students at the high-advanced level. Students develop and refine their own writing projects, while analyzing published materials in their disciplines and improving their understanding of their discipline’s professional expectations and audiences. Texts may be scholarly papers, research proposals, a thesis, or a dissertation. Topics include discipline-specific norms, organization of argument, rhetorical styles, advanced grammatical structures, and strategies and resources for academic and professional writing. Students work individually with the instructor, in groups, and as peer reviewers for each other’s work.", "Grading": "Graded", "Course ID": "100007", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture"}, {"Course": "ELC 063", "Name": "Speaking and Listening for Research and Professional Purposes, Level 6", "Credits": "3", "Description": "This course is designed for students at the high-advanced level. Students develop and refine their fluency of expression for the classroom, professional conferences, and other academic contexts. Topics include refining pronunciation and intonation, expressing complex and abstract ideas, analyzing lengthy speech, preparing individual and group presentations, interacting with faculty and peers, using academic language, discussing current issues, and developing strategies for challenges in advanced-level communication. Undergraduate students will interact with graduate students are also enrolled in the class to present topics to their peers relevant to their intended disciplines.", "Grading": "Graded", "Course ID": "100008", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture"}, {"Course": "ELC 071", "Name": "Writing for Research and Professional Purposes, Level 7", "Credits": "3", "Description": "This course is designed for students at the high-advanced level.  Student develop and refine their own writing projects, while analyzing published materials in their disciplines and improving their understanding of their discipline’s professional expectations and audiences.  Texts may be scholarly papers, research proposals, a thesis, or a dissertation.  Topics include discipline-specific norms, organization and argument, rhetorical styles, advanced grammatical structures, and strategies and resources for academic and professional writing.  Students work individually with the instructor, in groups, and as peer reviewers for each other’s work.", "Grading": "Graded", "Course ID": "1", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture"}, {"Course": "ELC 073", "Name": "Speaking and Listening for Research and Professional Purposes, Level 7", "Credits": "3", "Description": "This course is designed for students at the high-advanced level. Students develop and refine their fluency of expression for the classroom, professional conferences, and other academic contexts. Topics include refining pronunciation and intonation, expressing complex and abstract ideas, analyzing lengthy speech, preparing individual and group presentations, interacting with faculty and peers, using academic language, discussing current issues, and developing strategies for challenges in advanced-level communication. Undergraduate students will interact with graduate students also enrolled in the class to present topics to their peers relevant to their intended discipline.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100009", "Consent": "Department Consent Required to Add and Drop", "Components": "Lecture"}, {"Course": "ELCA 401", "Name": "Writing and Grammar for Academic Purposes Level 4 (Full Semester)", "Credits": "3", "Description": "The reading and composition courses offered at level 4 focus on the connection between academic reading and writing for upper-intermediate level ESL students. ELC 041/ELCA 401 and ELC 042 /ELCA 402 are taught together. These courses partially satisfy conditional admission to UMBC and are a prerequisite for ENGL 110. To completely satisfy conditional admission and to take ENGL 110 , students must also complete the next set of courses, ELC 051/ELCA 501 and ELC 052/ELCA 502. In the writing component, students are introduced to the process approach for composition. Through brainstorming, free writing, preparing drafts, peer review and instructor feedback, students develop their English writing skills in order to write summaries and informative and persuasive essays. Written assignments provide opportunities to respond to readings while practicing writing skills. This course is repeatable for credit. Students may complete a maximum of 9 credits or 3 attempts.", "Grading": "Graded", "Course ID": "669511", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENEE 244", "Name": "Digital Logic Design", "Credits": "3", "Description": "Topics include gates, flip-flops, registers and counters, Karnough map simplification of gate networks, switching algebra, synchronous sequential systems, PLAS and elements of binary arithmetic units.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053907", "Consent": "No Special Consent Required", "Components": "Lecture, Discussion", "Prerequisite/Corequisite": "You must have completed ENES 240 with a C or better."}, {"Course": "ENEE 302", "Name": "Principles of Electrical Engineering", "Credits": "4", "Description": "Not applicable in the electrical engineering and computer engineering major programs. Acceptable as prerequisite for some advanced ENEE courses. The course introduces fundamental principles and analysis of electrical engineering. Linear analog electrical circuits, Kirchoff’s laws, DC, transient and sinusoidal responses, transformers, frequency-selective circuits. It includes laboratory exercises on the subjects covered by the lectures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053912", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHYS 122 or PHYS 122H or MATH 225 with a C or better. MATH 225 can also be taken concurrently."}, {"Course": "EHS 102", "Name": "Emergency Medical Responder", "Credits": "3", "Description": "The Emergency Medical Responder (EMR) course is an entry-level emergency medical course that prepares the responder to assess and stabilize a medical or trauma patient prior to the arrival of an ambulance. Topics include introduction to EMS, roles and responsibilities, anatomy and physiology, medical emergencies, trauma, and special considerations. The course is appropriate for non-EHS majors working with at-risk populations, groups, in an institutional setting, or seeking an introduction to emergency medical care.", "Grading": "Graded", "Course ID": "102392", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "EHS 115", "Name": "Medical Terminology", "Credits": "3", "Description": "An introduction to medical terminology and the structure of medical words including prefixes, suffixes, roots and combining forms. Course includes the study of pronunciation, spelling, and definitions of medical terms, as well as anatomical, pathological and surgical terminology as related to body’s systems. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content. More information is available at UMBC Bookstore’s website.", "Grading": "Graded", "Course ID": "102063", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENGL 100 or ENGL 100Y with a C or better. Students can also take this course if they have LRC placement for ENGL 100 or ENGL 100Y ."}, {"Course": "EHS 200", "Name": "Concepts of Emergency Health Services", "Credits": "3", "Description": "This is a survey course that provides an overview of the operation of emergency health service systems. The history of EMS, the interface of public and private organizations, and review of the various personnel who constitute these systems are examined in relation to their impact on the health care delivery system.", "Grading": "Graded", "Course ID": "53698", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "EHS 200Y ", "Attributes": "Social Sciences (GEP)"}, {"Course": "EHS 200Y", "Name": "Concepts of Emergency Health Services", "Credits": "4", "Description": "This is a survey course that provides an overview of the operation of emergency health service systems. The history of EMS, the interface of public and private organizations, and review of the various personnel who constitute these systems are examined in relation to their impact on the health care delivery system.", "Grading": "Graded", "Course ID": "100516", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "EHS 200 ", "Attributes": "Social Sciences (GEP)"}, {"Course": "EHS 202", "Name": "Clinical Concepts and Practice I", "Credits": "3", "Description": "The first semester of a two-semester course covering patient care management, medical emergencies, basic cardiac life support, respiratory emergencies and pharmacological treatments. Includes the lecture and laboratory elements required for State of Maryland Emergency Medical Technician and National Registry of Emergency Medical Technician certification course sequence.", "Grading": "Graded", "Course ID": "53702", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed EHS 200 with a C or better."}, {"Course": "EHS 203", "Name": "Clinical Concepts and Practice II", "Credits": "3", "Description": "The second semester of a two-semester course covering trauma emergencies, triage, multi-casualty control, patient transportation, crisis management and inter-agency cooperation are stressed. Includes the lecture and laboratory elements required for State of Maryland Emergency Medical Technician and National Registry of Emergency Medical Technician certification course sequence.", "Grading": "Graded", "Course ID": "101769", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete EHS 202 with a C or better."}, {"Course": "EHS 204", "Name": "BLS Field Experience", "Credits": "3", "Description": "This EMT field internship is designed to integrate field and ambulance experience with knowledge, skills and techniques required for the emergency medical technician. Supervised experience is provided at local fire and EMS agencies with emphasis placed on patient assessment and exposure to medical and trauma emergencies. This elective course provides the student with an opportunity to evaluate and manage live patients in an emergency setting under direct supervision of a licensed professional. Recommended Preparation: EHS 303 or EHS 203 or certification as an Emergency Medical Technician.", "Grading": "Pass/Fail", "Course ID": "100642", "Consent": "Department Consent Required", "Components": "Clinical"}, {"Course": "EHS 301", "Name": "Planning Emergency Health Systems", "Credits": "3", "Description": "Students will examine the economic, political and clinical characteristics of emergency health care systems and how these characteristics influence the planning and design of these systems. Strategic planning, balanced scorecards and other planning concepts will be presented. High performance systems will be studied with specific attention to the methods used to cost effectively produce clinical quality, reliable response times and excellent customer service. Recommended Preparation: EHS 200 or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53701", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a grade or ‘C’ or higher."}, {"Course": "EHS 310", "Name": "Seminar in Emergency Health Service Management", "Credits": "1", "Description": "The object of this course is to inform the student of current programs, problems and policy issues related to EHS systems. Federal, state and local problems; inter-agency collaboration; and other timely issues are explored in informal seminars. This course is repeatable for credit. Students may complete a maximum of 3 credits. Recommended Preparation: EHS 200.", "Grading": "Graded", "Course ID": "53705", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EHS 311", "Name": "Stress and Burnout: Personal and Professional Issues", "Credits": "3", "Description": "This course provides detailed information on the types of stress that affect one’s personal and professional life. The causes and effects of stress and the recognition of stress symptoms in personal and professional settings is emphasized, as is a broad spectrum of stress-management strategies and stress control techniques. The course focuses on general stress, cumulative stress, critical incident stress (CIS) and post-traumatic stress disorder. Case examples from military, emergency services and other work settings enhance the course material.", "Grading": "Graded", "Course ID": "53706", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)", "Prerequisite/Corequisite": "You must have completed EHS 200 or a 100-Level SOCY or ANTH or PSYC course with a C or better."}, {"Course": "EHS 320", "Name": "Disaster Management", "Credits": "3", "Description": "This course provides the student with the theoretical and practical foundations necessary to manage multi-casualty incidents under field conditions. Disaster and multi-casualty planning, system response to disaster, triage principles, EHS relationships with the media, medical evacuation procedures and scene control are taught in this upper-level course.", "Grading": "Graded", "Course ID": "53707", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed  EHS 200  with a C or better."}, {"Course": "EHS 330", "Name": "Management of Search and Rescue Operations", "Credits": "3", "Description": "This course provides classroom and field experiences designed to conduct effective search and rescue operations. Concepts explored include management of the emergent multi-organizational network, types of searches, resource management, incident command, shifting probabilities of area, probability density, mission reports, victim behavior, hazard mitigation, field communications, and search and rescue satellite-aided tracking.", "Grading": "Graded", "Course ID": "53709", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 200 with a C or better."}, {"Course": "EHS 340", "Name": "Cultural Diversity in Healthcare", "Credits": "3", "Description": "The goal of the medical system is to provide equal and optimal care for patients of different cultural and ethnic backgrounds. This course will give the student some idea of the range of cultural behaviors and the need to understand differing patients’ actions from the perspective of the healthcare provider. Students will also explore some alternatives when it comes to providing culturally competent empathy. The purpose of this class is to increase the student’s familiarity and comfort with concepts of cultural analysis, and to show how these notions can increase awareness and understanding of others’, as well as their own life experiences in the healthcare setting. ", "Grading": "Graded", "Course ID": "102684", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must have completed any 100- or 200-level GEP SS with a grade of ‘C’ or better"}, {"Course": "EHS 345", "Name": "Death and Dying", "Credits": "3", "Description": "This course is a broad multidisciplinary approach that examines the theoretical, philosophical and social origins of past and present death attitudes and behavior. Topics include death throughout the life cycle, suicide, euthanasia, grief and bereavement, funeral customs, and the impact of religion and culture on death perspectives.", "Grading": "Graded", "Course ID": "50071", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "SOCY 359 "}, {"Course": "EHS 350", "Name": "Supervision and Operations in Emergency Health Service Systems", "Credits": "3", "Description": "This course provides an introduction and study of principles and methods used in the supervision of personnel within EHS systems. Examines the supervisory process in relation to volunteers and career (paid) personnel, personnel with various levels of skill certification, medical control and the influence of the type of emergency health organization involved.", "Grading": "Graded", "Course ID": "53710", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 200 with a C or better."}, {"Course": "EHS 351", "Name": "Financial Management, Budgeting and Resource Allocation for Emergency Health Administrators.", "Credits": "3", "Description": "The purpose of this course is to provide the student with the budgeting and financial management skills and understanding necessary to manage emergency health systems. Emphasis is on understanding the elements of financial reporting and integrating budget decisions and resource allocations into general management practices in the emergency health care field.", "Grading": "Graded", "Course ID": "53711", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 301 with a C or better."}, {"Course": "EHS 360", "Name": "Instructional Concepts in Emergency Health Services", "Credits": "3", "Description": "This course prepares the student to make educational and/or informational presentations to a wide range of adult audiences including emergency services personnel, administrators, and the public. The focus of the course is on perspectives and methods of adult audience reception with communication, media and interpersonal communication.", "Grading": "Graded", "Course ID": "53713", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 102 or EHS 202 with a C or better."}, {"Course": "EHS 400", "Name": "Emergency Health Services Theory and Practice", "Credits": "3", "Description": "This course provides further development of theory and techniques central to EHS management - program development; organizational theory; management skills; program implementation; evaluation; and manpower, equipment and resource allocation.", "Grading": "Graded", "Course ID": "53714", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 301 with a C or better."}, {"Course": "EHS 430", "Name": "Research Topics in Emergency Health Services", "Credits": "3", "Description": "Research is an essential tool to improve emergency health services effectiveness. This course focuses on basic research design and methods used in emergency health services, and it takes into account many of the barriers to research that are particular to the field. Research design theory is complemented by in-class experience in solving emergency health services research design problems.", "Grading": "Graded", "Course ID": "53716", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed EHS 200 and STAT 121 or STAT 350 with a C or better."}, {"Course": "EHS 450", "Name": "Emergency Health Services Practicum and Seminar", "Credits": "3", "Description": "This intense course is a blend of fieldwork in emergency health services and integrating seminars. Supervised on-site experience in EHS management situations, actual work-related projects, are integrated with knowledge, skills and current issues through seminar sessions. Consideration will be given to students with significant EHS work experience or current employment to complete this required course with less than 15 hours. Placements and focus will be tailored to the needs of the registrants. Open to majors only. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded", "Course ID": "53718", "Consent": "Department Consent Required", "Components": "Practicum"}, {"Course": "EHS 461", "Name": "Introduction to Paramedic Practice", "Credits": "3", "Description": "This is an introductory course to the paramedic track. Topics include roles and responsibilities of the paramedic, EMS systems and communications, documentation, ethics, ambulance operations, MCI command, rescue awareness, hazardous materials incidents, terrorism, and crime scene awareness. Recommended Preparation: You must be an EMT with at least 100 patient contacts as an EMT.", "Grading": "Graded", "Course ID": "102146", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 252 and BIOL 252L with a ‘C’ or higher."}, {"Course": "EHS 462", "Name": "Fundamentals of Patient Management", "Credits": "3", "Description": "This course introduces students to the fundamentals of prehospital patient management. Topics include the pharmacodynamics and pharmacokinetics of medications, administration techniques, and therapeutic communications. Additional topics include medication mathematics, intravenous fluid and oxygen administration, basic and advanced airway management, surgical and non-surgical airways, and pharmacologic adjuncts used in airway management and ventilation.  Recommended Preparation: You must be an EMT with at least 100 patient contacts as an EMT.", "Grading": "Graded", "Course ID": "102213", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete  BIOL 252 and BIOL 252L  with a ‘C’ or higher."}, {"Course": "EHS 463", "Name": "Basics of Cardiology", "Credits": "3", "Description": "This is an intense course designed to discuss the principles of basic electrocardiography and cardiovascular disease. Topics include: 3-lead EKG rhythm strip interpretation, management of cardiovascular related illness, ischemic heart disease and failure, cardiogenic shock, pericardial disorders, and hypo- and hypertensive emergencies. Patient specific assessment and associated pharmacologic interventions will also be discussed. Recommended Preparation: You must be an EMT with at least 100 patient contacts as an EMT.", "Grading": "Graded", "Course ID": "102214", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  BIOL 252  and BIOL 252L  with a ‘C’ or higher."}, {"Course": "EHS 464", "Name": "Advanced Cardiac and Respiratory Emergencies", "Credits": "3", "Description": "This is an intense course designed to discuss the principles of advanced electrocardiography and respiratory system disease. Topics include: 12-lead EKG strip interpretation, introduction to Advanced Cardiac Life Support (ACLS), and the recognition and treatment of illnesses related to the airway and respiratory system. Patient specific assessment and associated pharmacologic interventions will also be discussed. ", "Grading": "Graded", "Course ID": "102216", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete EHS 461, EHS 462, EHS 463, and EHS 481 with a grade of  ‘C’ or better."}, {"Course": "EHS 465", "Name": "Medical Emergencies I", "Credits": "3", "Description": "The medical emergencies I course focuses on assessing and managing patients with specific medical conditions. Topics include: neurologic emergencies, HEENT diseases, abdominal, genitourinary, and renal emergencies, toxicology, anaphylaxis, hematologic and immunologic emergencies, infectious disease, and home health care. Patient specific assessment and associated pharmacologic interventions will also be discussed. ", "Grading": "Graded", "Course ID": "102217", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EHS 461 , EHS 462 , EHS 463 , and EHS 481  with a ‘C’ or better."}, {"Course": "EHS 466", "Name": "Medical Emergencies II", "Credits": "3", "Description": "The medical emergencies II course focuses on assessing and managing patients with specific medical conditions. Topics include: obstetrics and gynecology, neonatology, pediatrics, gerontology, psychiatric and behavioral emergencies and patients with special challenges. Patient specific assessment and associated pharmacologic interventions will also be discussed.", "Grading": "Graded", "Course ID": "102218", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EHS 461 , EHS 462 , EHS 463 , and EHS 481 with a C or better."}, {"Course": "EHS 467", "Name": "Introduction to Trauma Emergencies", "Credits": "3", "Description": "This course covers the pathophysiology, assessment and management of adult and pediatric patients with injuries involving various body systems, mechanisms of injury, and environmental emergencies. Successful completion of all written and practical skills may result in national certification.", "Grading": "Graded", "Course ID": "102219", "Consent": "Department Consent required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EHS 464, EHS 465 , EHS 466 , and EHS 482 with a ‘C’ or better."}, {"Course": "EHS 468", "Name": "EMS Capstone Experience", "Credits": "3", "Description": "This course serves as a capstone experience course at the end of the four semester paramedic program and prepares the student for sitting for national board examinations. Topics include: responding to the field cardiac arrest, ACLS and PALS certification, oral board examinations, cumulative practical skill evaluations, overview of the Candidate Physical Ability Test (CPAT), and preparation for the National Registry written and practical paramedic examination.", "Grading": "Graded", "Course ID": "102220", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EHS 467  and  EHS 483 with a ‘C’ or better."}, {"Course": "EHS 470", "Name": "Emergency Response to Crisis", "Credits": "3", "Description": "This course teaches techniques of immediate intervention in various field crises, communication skills and history-taking techniques. Sample crises include alcohol and substance abuse, family emergencies, sexual assault, suicide, child abuse and other pediatric emergencies, multi-casualty situations, violence and crisis worker stress. Course activities include lectures, discussion groups, simulations and multimedia presentations.", "Grading": "Graded", "Course ID": "53721", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EHS 481", "Name": "ALS Field and Clinical Experience I", "Credits": "3", "Description": "This field and hospital internship is an introduction to the clinical experience. Students will concentrate on patient assessment and intravenous access techniques while in the clinical setting. Students will also work on ALS skills and techniques in a laboratory setting. Appropriate treatment modalities will be stressed. Recommended Preparation: : You must be an EMT with at least 100 patient contacts as an EMT.", "Grading": "Graded", "Course ID": "53732", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 252  and BIOL 252L  with a grade of ‘C’ or better."}, {"Course": "EHS 482", "Name": "ALS Field and Clinical Experience II", "Credits": "4", "Description": "This field and hospital internship is designed to integrate clinical experience with knowledge, skills and techniques presented in EHS paramedic track course work. Supervised experience is provided in hospital and field settings. Emphasis is placed on patient assessment, trauma, respiratory pharmacology, cardiology, pediatrics, geriatrics and medical emergencies. Appropriate treatment modalities will be stressed.", "Grading": "Graded", "Course ID": "53733", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete  EHS 461 , EHS 462 , EHS 463 , and EHS 481 with a ‘C’ or better."}, {"Course": "EHS 483", "Name": "ALS Field and Clinical Experience III", "Credits": "6", "Description": "This is the first course of a two-semester ‘capstone’ field and hospital internship designed to integrate clinical experience with knowledge, skills and techniques presented in EHS paramedic track course work. Supervised experience is provided in hospital and field settings. Emphasis is placed on patients in crisis and refining the skills to assess and appropriately treat patients experiencing a variety of medical and trauma-related illnesses.", "Grading": "Graded", "Course ID": "53734", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete EHS 464 , EHS 465 , EHS 466  and   EHS 482 with a ‘C’ or better."}, {"Course": "EHS 484", "Name": "ALS Field and Clinical Experience IV", "Credits": "6", "Description": "This is the second course of a two-semester ‘capstone’ field and hospital internship designed to integrate clinical experience with knowledge, skills and techniques presented in EHS paramedic track course work. Supervised experiences provided in hospital and field settings. Emphasis is placed on refining the skills to assess and appropriately treat patients experiencing a variety of medical and trauma-related illnesses. Additional internship time is spent with the local EMS agencies learning about the role of supervisors in the field environment.", "Grading": "Graded", "Course ID": "53735", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete EHS 467  and EHS 483   with a ‘C’ or better."}, {"Course": "EHS 490", "Name": "Independent Study", "Credits": "1", "Description": "Students in this course will complete an individual project in a specific emergency health services area under the supervision of emergency health services faculty. This course is repeatable for credit. Recommended Preparation: Junior standing.", "Grading": "Graded", "Course ID": "53736", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "EHS 498", "Name": "Financial Management and Decision Support for Health Service Organizations", "Credits": "3", "Description": "An introduction to the budgetary process, ongoing financial management skills at the department level, and decision support activities in independent, as well as, multi-organizational systems. Emphasis on understanding the reporting mechanisms and the accountability that is expected of the departmental manager with regard to resource allocation, including staffing alternatives, technology procurement, supply utilization, and department goal attainment.", "Grading": "Graded", "Course ID": "50072", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Fin Mgmt/Dec Sup Hso", "Same as Offered": "HAPP498 ", "Prerequisite/Corequisite": "You must complete HAPP 100  or EHS 200  or AGNG 200  and ECON 121  with a C or better."}, {"Course": "ENES 100", "Name": "Spatial Reasoning", "Credits": "1", "Description": "Students will develop the visual and spatial thinking and reasoning skills necessary to be successful in engineering and science. Hands-on techniques and computer software will be used to develop visualization in both 2-D and 3-D.", "Grading": "Graded/Audit", "Course ID": "102110", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed the MATH placement with a  4 or 5."}, {"Course": "ENES 101", "Name": "Introduction to Engineering", "Credits": "3", "Description": "Introduction to engineering that covers dimensional analysis, data analysis, professional practice, and an introduction to engineering subjects such as statics, heat transfer, and linear circuits. Students must work in teams on a design project, which includes design, construction, evaluation, testing, modeling and presentation. Course includes an introduction to computer programming in MATLAB and basic skills in Computer Aided Design (CAD).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054008", "Consent": "No Special Consent Required", "Components": "Lecture, Discussion", "Course Equivalents": "ENES 101H , ENES 101Y ", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must be concurrently enrolled in MATH 151 or have completed this course in a previous semester with a grade of “C” or better."}, {"Course": "ENES 101H", "Name": "Introduction to Engineering", "Credits": "3", "Description": "Introduction to engineering that covers dimensional analysis, data analysis, professional practice, and an introduction to engineering subjects such as statics, heat transfer, and linear circuits. Students must work in teams on a design project, which includes design, construction, evaluation, testing, modeling and presentation. Course includes an introduction to computer programming in MATLAB and basic skills in Computer Aided Design (CAD).", "Grading": "Graded/Audit", "Course ID": "054009", "Consent": "No Special Consent Required", "Components": "Lecture, Discussion", "Course Equivalents": "ENES 101 ,ENES 101Y ", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must be concurrently enrolled in MATH 151 or have completed this course in a previous semester with a grade of “C” or better."}, {"Course": "ENES 101Y", "Name": "Introduction to Engineering", "Credits": "3", "Description": "Introduction to engineering that covers dimensional analysis, data analysis, professional practice, and an introduction to engineering subjects such as statics, heat transfer, and linear circuits. Students must work in teams on a design project, which includes design, construction, evaluation, testing, modeling and presentation. Course includes an introduction to computer programming in MATLAB and basic skills in Computer Aided Design (CAD).", "Grading": "Graded/Audit", "Course ID": "054010", "Consent": "No Special Consent Required", "Components": "Lecture, Discussion", "Course Equivalents": "ENES 101 , ENES 101H ", "Prerequisite/Corequisite": "You must be concurrently enrolled in MATH 151 or have completed this course in a previous semester with a grade of “C” or better."}, {"Course": "ENES 103", "Name": "Introduction to MATLAB for Engineering Applications", "Credits": "1", "Description": "Students will be introduced to the MATLAB computational software tool for engineering applications. Fundamental programming concepts will be covered including data types, arithmetic and Boolean operators, conditional statements, loops, scripts and functions. Additional topics will include plotting, input/output and engineering mathematical toolboxes.", "Grading": "Graded", "Course ID": "102471", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ENES 251", "Name": "Ethical Issues in Science, Engineering and Information Technology", "Credits": "3", "Description": "The primary focus of the course will be inquiry into the ethical responsibilities of scientists, engineers, and information technologists in today’s high-tech information oriented society. Students will be introduced to both historical and contemporary issues involving ethical and professional responsibility through an extensive discussion and analysis of case studies. The key feature of this course will involve learning how to apply this analysis to case study. Teams will be formed early in the semester so each group can meet and discuss in class and before written assignments are due. Each team will also be required to engage in an extended case-study project that will culminate in a team presentation of the case study in Power Point format.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100001", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "ENGL 099", "Name": "Basic English", "Credits": "0", "Description": "Intensive review of basic English skills, with emphasis on sentences and paragraph-level composition. Required (normally during the first semester in residence) of all students whose scores on the written portion of the UMBC freshman placement tests show they need further practice in the fundamentals of written English needed for a college-level composition course. Four institutional credits (not applicable to the degree) are awarded.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54025", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture"}, {"Course": "ENGL 100", "Name": "Composition", "Credits": "3", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC. Recommended Preparation: In consultation with an advisor, a student will self-place into ENGL 100. (Fall/Spring/Summer)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54026", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 100A, ENGL 100C, ENGL 100H, ENGL 100P, ENGL 100Y, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)"}, {"Course": "ENGL 100A", "Name": "Composition", "Credits": "4", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54027", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Course Equivalents": "ENGL 100, ENGL 100C, ENGL 100H, ENGL 100P, ENGL 100Y, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)", "Prerequisite/Corequisite": "Must have scored a 3 on LRC English placement test to enroll in ENGL 100A."}, {"Course": "ENGL 100C", "Name": "Composition", "Credits": "3", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54029", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 100, ENGL 100A, ENGL 100H, ENGL 100P, ENGL 100Y, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)"}, {"Course": "ENGL 100H", "Name": "Composition", "Credits": "4", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100022", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 100, ENGL 100A, ENGL 100C, ENGL 100P, ENGL 100Y, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "ENGL 100P", "Name": "Composition", "Credits": "4", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC.", "Grading": "Graded", "Course ID": "100023", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "ENGL 100, ENGL 100A, ENGL 100C, ENGL 100H, ENGL 100Y, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)"}, {"Course": "ENGL 100Y", "Name": "Composition", "Credits": "4", "Description": "A course in critical thinking, reading, and composing, with an emphasis on integrating academic research and documentation. Students read and produce work for a variety of purposes and audiences, focusing on strategies for researching, organizing, drafting, sharing, and revising. To satisfy the composition general education requirement, this course must be taken within a student’s first 30 credit hours of enrollment at UMBC.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54031", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Course Equivalents": "ENGL 100, ENGL 100A, ENGL 100C, ENGL 100H, ENGL 100P, ENGL 110 ", "Attributes": "English Composition (GEP), English Composition (GFR)", "Prerequisite/Corequisite": "Must have scored 3, 4, 5, 6 or 7 on LRC English placement test to enroll in ENGL 100 or ENGL 100Y."}]