[{"Course": "BIOL 445", "Name": "Signal Transduction", "Credits": "4", "Description": "This course will examine some of the methods by which the reception of signals from the environment leads to the changes in gene and protein activity in responding cells that constitute a biological response. Signal transduction in the context of developmental biology and neurobiology will be the main area of study. Six to eight topics will be emphasized through critical reading, analysis and presentation of original articles from primary literature. The use of genetic, molecular and biochemical techniques to address questions in the field of signal transduction will be examined. Note: This class is Writing Intensive", "Grading": "Graded", "Course ID": "52547", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "BIOL 451", "Name": "Neurobiology", "Credits": "4", "Description": "Covers nervous system function at the cellular level, ionic mechanisms underlying electrical activity in nerve cells, the physiology of synapses, transduction and integration of sensory information, activity in populations of neurons, the specification of neuronal connections, and trophic and plastic properties of nerve cells. ", "Grading": "Graded/Audit", "Course ID": "52548", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302, and BIOL 303, and either BIOL 305 or BIOL 307, and ENGL 100 or equivalent with a grade of “C” or better."}, {"Course": "BIOL 453", "Name": "Physiological Bases of Behavior", "Credits": "4", "Description": "Studies of important adaptive behavioral patterns and their physiological bases. The course begins with some basic principles of the study of animal behavior followed by special topics such as sexual behavior, feeding, communication, prey capture, and predator evasion. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52550", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302, and BIOL 303, and either BIOL 305 or BIOL 307, and ENGL 100 or equivalent with a grade of ‘C’ or better."}, {"Course": "BIOL 454", "Name": "Vision Science", "Credits": "4", "Description": "This course will focus in depth on visual systems of animals and humans. Coverage will span the range of modern research from the biochemistry and physiology of the photoreceptors to the ecology, evolution and functional optimization of visual systems. Topics include visual pigments, biochemical basis of phototransduction, visual processing and organization of visual centers of the brain, eyes, optical arrays, visual evolution and ecology. Note: This class is Writing Intensive", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52551", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete BIOL 302, and BIOL 303, and either BIOL 305 or BIOL 307, and ENGL 100 or equivalent with a “C” or better."}, {"Course": "BIOL 456", "Name": "Plant Molecular Biology", "Credits": "4", "Description": "This course is focused on exploring the molecular mechanisms underlying plant physiology and development and is designed to foster interactive learning. The course begins with a brief review of some important principles and techniques in Molecular Biology and Genetics. A session focusing on familiarizing students with multiple bioinformatics tools via a comprehensive group project is followed. Then the course pursues in depth several topics, such as meristems, flower and embryo development, the circadian clock, signal transduction of environmental cues, hormonal regulation of gene expression and development, host-pathogen interactions, applications of genetic engineering, and other current/hot topics. Molecular genetic approaches using model plant systems are stressed throughout the course. Note: This class is Writing Intensive", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52553", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 302, and BIOL 303, and ENGL 100 or equivalent all with a “C” or better."}, {"Course": "BIOL 457", "Name": "Physiology of Marine and Estuarine Animals.", "Credits": "4", "Description": "A study of the physiological specializations demanded by marine/estuarine environments, including physiological mechanisms for coping with stresses imposed by extremes of temperature, salinity, aerial exposure and low oxygen concentrations; sensory physiology, including visual, chemical and mechanical modalities; exogenous and endogenous rhythms related to tidal or diel cycles; and bioluminescence. The course includes one or more trips to field laboratories.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52554", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302, and BIOL 303, and [BIOL 305 or BIOL 307] with a grade of “C” or better."}, {"Course": "BIOL 463", "Name": "Theoretical and Quantitative Biology", "Credits": "4", "Description": "A course in probability and advanced biostatistics. Topics will include the elementary mathematical techniques used in biology and medicine, the relationships among probability distributions used in standard statistical tests, univariate linear and nonlinear analysis, correlation matrices, multivariate analysis and path analysis, cluster analysis, and discriminant and principal component analysis. Students will present examples of the analysis from the literature. The class will solve problems, and each student will analyze a set of experimental data.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52558", "Consent": "No Special Consent Required", "Components": "Discussion, Laboratory, Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 142, and BIOL 302 and BIOL 303, and STAT 350 or STAT 355, all with a grade of ‘C’ or better. "}, {"Course": "BIOL 466", "Name": "Population and Conservation Genetics", "Credits": "4", "Description": "This course provides a comprehensive overview of the fields of population and conservation genetics. Principles of population genetics are needed to understand evolution, epidemiology, and conservation biology. Forces and processes involved in shaping genetic variation, methods of measuring genetic variation and structure in natural populations, as well as strategies for worldwide conservation of endangered species will be emphasized. The course is a hybrid course and consists of lecture, primary literature discussions, and experimental computer simulations for analyzing or modeling population genetic data.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52561", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 142, and BIOL 302, and BIOL 303, and STAT 350 or STAT 355, all with a ‘C’ or better."}, {"Course": "BIOL 468", "Name": "Ecology of Rivers and Streams", "Credits": "4", "Description": "This course provides an understanding of the structure and functions of lotic ecosystems and how these systems operate in terms of energetics, interactions among component species, and the physical and chemical properties of undisturbed and disturbed watersheds. Special attention will be given to the relationships between biodiversity, species substitutability and ecosystem processing as they relate to the conservation and protection of rivers, streams and non-tidal wetlands.", "Grading": "Graded/Pass Fail", "Course ID": "52563", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 142, and BIOL 302, and BIOL 303, and CHEM 102 with a grade of “C” or better."}, {"Course": "BIOL 470", "Name": "General Virology", "Credits": "4", "Description": "This course is a comprehensive overview of virology, with an emphasis on animal viruses. Topics include the physical and chemical nature of viruses, techniques used to study viruses in the laboratory, virus replication and genetics, virus-host interactions, and antiviral strategies. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52564", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 476", "Name": "Antibiotics: Origin, Mechanism, Resistance", "Credits": "4", "Description": "Infectious agents, the bacteria and viruses, accounted for 57 percent of the deaths in the U.S. in 1900 and less than 4 percent in 1990. The discovery and application of antibiotics and other chemotherapeutic agents are largely responsible for this dramatic reversal. In this course the origin of selected chemotherapeutic agents, their detailed mode of action and the basis for emergence of resistant microbial populations will be discussed. Similarly, the action of selected drugs used in chemotherapy, which attempts to control cancer cell growth, will be outlined. The principle of rational drug design and radical “new” methods of attacking microbial populations will be explored.", "Grading": "Graded", "Course ID": "52566", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 and CHEM 351 with a grade of C or better."}, {"Course": "BIOL 477", "Name": "Applications of Biodetection Approaches", "Credits": "4", "Description": "The ability to detect and identify genetic and protein markers forms a common theme for many different fields of biological sciences including medical diagnostics, environmental microbiology, food/water safety, biodefense/homeland security, and veterinary science. Because of its central role throughout a diverse set of biological disciplines the methods and approaches for biodetection are extremely varied and wide-ranging. This course begins with basic detection approaches and continues with examples of principles guiding biodetection by relating each approach to important present-day challenges facing society. The course will also include an indepth analysis of biological principles guiding detection strategies to understand not only the potential but also the limitations of each approach.", "Grading": "Graded", "Course ID": "100462", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302 and BIOL 303 with a grade of ‘C’ or better."}, {"Course": "BIOL 480", "Name": "Animal Behavior", "Credits": "4", "Description": "This course explores the general themes and important questions in animal behavior. We cover subjects that examine how and why animals interact with each other and with their environment. Topics include: the genetics of behavior, behavioral development, learning, animal communication, habitat selection, foraging, sexual selection, and mating systems, among others. This is a quantitative course; a familiarity with basic statistics and mathematics is assumed.  Note: This course is Writing Intensive.", "Grading": "Graded", "Course ID": "100498", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete BIOL 142, and BIOL 302, and BIOL 303, and ENGL 100 or equivalent with a “C” or better."}, {"Course": "BIOL 481", "Name": "Advanced Topics in Evolutionary Biology", "Credits": "4", "Description": "This advanced course analyzes principles of and current topics in evolutionary biology. The study of evolution informs every facet of biological inquiry and every level of biological organization, from molecules to ecosystems. Topics will vary across semesters according to current research and the interests of faculty. Representative topics may include the origin of species, natural and sexual selection, neutral theory, comparative methods, and evolutionary ecology. The course is a mix of lectures, problem-based learning, and student-led presentations of primary research literature. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits or 2 attempts.", "Grading": "Graded", "Course ID": "102010", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "BIOL 681", "Prerequisite/Corequisite": "You must have completed BIOL 142, and BIOL 302, and BIOL 303 with a grade of “C” or better."}, {"Course": "BIOL 483", "Name": "Evolution: From Genes to Genomes", "Credits": "4", "Description": "This is a combined lecture and hands-on computing course that study the applications of evolutionary theory to the exploration and analysis of phenotypic and biological sequence data. We will begin by building a sound conceptual basis for the theory of evolution, including an introduction to population genetics and phylogenetics. The course consists of one hour lecture, one hour group discussion of current papers in evolution and a two hour computer lab per week. Biological sequence data is analyzed in the computer laboratories to illustrate evolutionary principles and provide practice for data analysis and interpretation. Students will be required to write a review of the literature on a topic in evolution related to their own interests and give presentations on their topic during the last half of the semester.  Note: This course is Writing Intensive.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52567", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed BIOL 142, and BIOL 302, and BIOL 303, and STAT 350 or STAT 355, and ENGL 100 or equivalent with a grade of ‘C’ or better. "}, {"Course": "BIOL 486", "Name": "Genome Science", "Credits": "4", "Description": "Life science at the whole genome level represents a rapidly expanding new paradigm that defines a new field, genome science. BIOL 486 provides students with the requisites for understanding genome science and includes experimental basics of functional genomics and analytical basics of bioinformatics. Biomedical and agricultural research are developing the potential of genome science, in both the public and private sectors. Important questions that have been unapproachable are now thought to be within reach. For example, students in BIOL 486 will learn how genome science may provide tools to unravel the arcane genetics of complex diseases and traits. Information sources will include textbook(s), primary literature and computer methods.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52570", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete STAT 350 or STAT 355, and BIOL 302, and BIOL 303, and CHEM 351 with a grade of ‘C’ or better."}, {"Course": "BIOL 487", "Name": "Medical Case Studies", "Credits": "4", "Description": "In this course, students integrate their knowledge of physics, chemistry, mathematics, and biology to work on complex medical case studies. Working in teams, students apply information they know, seek out new information, hear from experts in each case, and write up their conclusions about each case. At the end of the course, teams will design and present novel case studies of their own.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102397", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 303, and CHEM 351, and (PHYS 112 or PHYS 122), and (MATH 151 or MATH 155) all with a “C” or better."}, {"Course": "BIOL 490", "Name": "Chemical Communication and Brain Disorders", "Credits": "4", "Description": "This course will allow students to develop an understanding of how neurons in the nervous system communicate using synapses, neurotransmitters, and neuroactive compounds. In the context of brain disorders and their resultant defects in chemical communications, students will gain an appreciation for how neurons and neural networks react to internal and external stimuli and how their activity underlies brain function.", "Grading": "Graded", "Course ID": "102329", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete BIOL 303, and either BIOL 305 or BIOL 307 with a “C” or better."}, {"Course": "BIOL 495", "Name": "Seminar Bioinformatics", "Credits": "4", "Description": "This is a “capstone” seminar course for students in the Bioinformatics and Computational Biology Program. Students will be introduced to examples of the integrated uses of the various disciplines that together comprise bioinformatics and computational biology. Integrated into this material is the discussion of concepts that encourage an entrepreneurial attitude and skillset.", "Grading": "Graded/Audit", "Course ID": "52574", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete BIOL 302, BIOL 303, and CMSC 201 with a grade of ‘C’ or better."}, {"Course": "BIOL 497H", "Name": "Honors Capstone course", "Credits": "3", "Description": "Students who are pursuing departmental honors will write and submit a scholarly paper reporting on the outcome of their senior research project, and will present their research either orally or as a poster, at one or more public forums, as decided by the Departmental Honors committee. Students will also be expected to attend at least 12 departmental seminars and prepare at least 6 one page abstracts of these seminars. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52575", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must have been admitted to the Honors College to take this course."}, {"Course": "BIOL 499", "Name": "Undergraduate Laboratory/Field Research", "Credits": "1", "Description": "BIOL students (BS only) may use independent research in the laboratory of a faculty member as a substitute for one of the upper level laboratory classes required by the major. To do so, students must register for BIOL 499 for two semesters in a row. In the second semester they must also register for this course, BIOL 499L, in which they will give oral presentations and write a final paper about their research project. ", "Grading": "Pass/Fail", "Course ID": "52576", "Consent": "Instructor Consent Required", "Components": "Independent Study", "Course Equivalents": "BIOL 499H "}, {"Course": "BIOL 499H", "Name": "Undergraduate Laboratory/Field Research-Honors", "Credits": "1", "Description": "Original laboratory or field research for students in the Biological Sciences Honors Program to be conducted under the supervision of an UMBC faculty member. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52577", "Consent": "No Special Consent Required", "Components": "Independent Study", "Course Equivalents": "BIOL 499 "}, {"Course": "BIOL 499L", "Name": "Undergraduate Research Seminar", "Credits": "1", "Description": "BIOL students (BS only) may use independent research in the laboratory of a faculty member as a substitute for one of the upper level laboratory classes required by the major. To do so, students must register for BIOL 499 for two semesters in a row. In the second semester they must also register for this course, BIOL 499L, in which they will give oral presentations and write a final paper about their research project. Recommended Preparation: BIOL 300L ", "Grading": "Graded", "Course ID": "100637", "Consent": "Instructor Consent Required", "Components": "Independent Study", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENGL 100 or equivelant with a grade of “C” or better. "}, {"Course": "BTEC 300", "Name": "Translational Life Science Technology Survey", "Credits": "3", "Description": "This course will raise awareness on a range of topics that frame the field of translational science and the biotechnology industry. Meetings will cover topics such as what is translational science from the perspective of academia, government and the private sector; legal and ethical issues in biotechnology; and the regulatory process for drug commercialization.", "Grading": "Graded", "Course ID": "102447", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete CHEM 101 , BIOL 142 , and BIOL 302 and ENGL 100 or equivalent all with a grade of ‘C’ or better."}, {"Course": "BTEC 303", "Name": "Applied Cell Biology", "Credits": "4", "Description": "This course will provide an overview of modern cell biology with emphasis on applications in cell-based therapeutics and commercial processes. The course will include a foundation in molecular aspects of cell biology including cell structure, organelle structure and function, protein trafficking, membrane dynamics, cell adhesion, signal transduction, cell cycle control, and cell death. These concepts will be presented in the context of current applications of cell biological approaches in clinical medicine and commercial production of biologicals. The course comprises a 1 CR laboratory component where students will learn hands-on techniques for cell culturing and imaging.", "Grading": "Graded", "Course ID": "102598", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 302  with a ‘C’ or better."}, {"Course": "BTEC 310", "Name": "Instrumentation & Methods for the Biotechnology Laboratory", "Credits": "3", "Description": "Presented from the perspective of the biotechnology industry, this course will give a systematic, understandable, and practical introduction to basic biotechnology laboratory methods and the principles underlying the operation of common and sophisticated instrumentation. The course is intended for students who are interested in learning how to work in a biotechnology research & development laboratory.", "Grading": "Graded", "Course ID": "102604", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CHEM 101 and MATH 151  or  MATH 155 and PHYS 111  or PHYS 121  and BIOL 142 and  BIOL 302  with a grade of ‘C’ or better. "}, {"Course": "BTEC 330", "Name": "Software Applications in the Life Sciences", "Credits": "3", "Description": "This course will provide an overview and basic practical skills in software tools that are used widely in biological research and development in the areas of general productivity, basic data analysis and databasing, statistical analysis and programming, analysis and comprehension of high-throughput genomic data, biological sequence analysis and bioinformatics, image analysis and morphometry.", "Grading": "Graded", "Course ID": "102605", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed either MATH 151  or MATH 155  with a grade of ‘C’ or better."}, {"Course": "BTEC 344", "Name": "Epidemiology", "Credits": "3", "Description": "This course will provide an intensive introduction to epidemiologic concepts and methods for students majoring in Translational Life Science Technology and for others intending to engage in, collaborate in, or interpret the results of epidemiologic research as a substantial component of their career. ", "Grading": "Graded", "Course ID": "10206", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 303  or BTEC 303  with a ‘C’ or better, and STAT 350  or STAT 355  or BTEC 350  with a ‘C’ or better"}, {"Course": "BTEC 350", "Name": "Statistics for Translational Life Science", "Credits": "3", "Description": "This course will introduce statistical methods used commonly by Translational Life Science Technology researchers. Some topics covered include organizing and presenting data with charts, histograms and plots, calculating means, standard deviations, and other statistical measures, statistical computing in biology using R, data collection and sampling, Bayesian statistics, developing statistical estimators hypothesis testing and likelihood ratio analysis. Application examples in epidemiology, genome wide association studies, and biological product quality control will illustrate basic and applied concepts.", "Grading": "Graded", "Course ID": "102448", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 150 (or MATH 151 or MATH 155) and BIOL 302 with a grade of ‘C’ or better."}, {"Course": "BTEC 362", "Name": "Introduction to Python Programming with Translational Applications", "Credits": "3", "Description": "The class will teach Python3 programming language, and students will learn fundamental coding concepts and practices applicable to other major programming languages such as C++ and Java. The class will introduce students to utilizing Python for data analysis in biomedical/translational research, and students will develop their own code to perform statistical analysis and plotting visualizations of a real-world biomedical dataset.", "Grading": "Graded", "Course ID": "102922", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete BTEC 330 and either BTEC 350 or STAT 350 with a grade of ‘C’ or better."}, {"Course": "BTEC 395", "Name": "Translational Bioinformatics", "Credits": "4", "Description": "This course introduces the emerging field of translational bioinformatics, which encompasses the development of algorithms for biological data analysis and their clinical and research applications. It covers four main topics: biological sequence analysis, biological databases and ontologies, whole- and meta-genome analysis and network biology. It includes a primer on evolutionary theory, high-throughput techniques, sequence statistics and other central concepts in bioinformatics, followed by an overview of the history, translational component and scientific impact of bioinformatics.", "Grading": "Graded", "Course ID": "102596", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have taken MATH 151 or MATH 155, BIOL 430 or BTEC 430, STAT 350 or BTEC 350 with a grade of ‘C’ or better."}, {"Course": "BTEC 399", "Name": "Tutorial Projects in Translational Life Science Technology", "Credits": "1", "Description": "Independent tutorial based either on a current TLST course or on an independent study topic identified by the student and accepted by a TLST faculty member. Approved courses will have variable credit, depending upon the relevant TLST course or proposed course outline. All proposals must have the approval an associated TLST faculty member and be approved by the TLST Program Director. (Fall/Spring/Summer)", "Grading": "Graded", "Course ID": "102923", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete BTEC 300 with a grade of ‘C’ or better."}, {"Course": "BTEC 423", "Name": "Machine Learning Applications for Translational Bioinformatics", "Credits": "4", "Description": "This course provides a knowledge and practical experience in ML for bioinformatics applications in the analysis of large clinical and -omics datasets. Students will learn a comprehensive ‘roundup’ of ML algorithms with coursework focusing on bioinformatics and clinical data analytics. Open-source datasets will be utilized including the Framingham Heart Study and Omics studies from NCBI GenBank and Cancer Genome Atlas. Practical coursework will utilize the Python programming language with scikit-learn on Jupyter Notebooks. (Fall)", "Grading": "Graded", "Course ID": "102924", "Consent": "No Special Consent Required", "Components": "Lecture, Laboratory", "Prerequisite/Corequisite": "Complete BTEC 330, BTEC 362, BTEC 395, and BTEC 350 or STAT 350 and with a grade of ‘C’ or better."}, {"Course": "BTEC 424", "Name": "Deep Learning Applications for Biomedical Image Analysis", "Credits": "4", "Description": "This course provides a knowledge and practical experience in analysis of biomedical images using Deep Learning/Neural Networks. Data includes immunofluorescence and confocal microscopy images, clinical radiology, and tumor immunohistopathology images. Deep learning algorithms covered include convolutional neural networks (CNNs), generative adversarial networks (GANs), and graph neural networks (GNNs). Common image analysis methods will be studied using ImageJ. Class projects and exercises will utilize standardized datasets such as MNIST and CIFAR-10, as well as radiology and histopathology images. (Spring)", "Grading": "Graded", "Course ID": "102926", "Consent": "No Special Consent Required", "Components": "Lecture, Laboratory", "Prerequisite/Corequisite": "Complete BTEC 330, BTEC 362, BTEC 395, and BTEC 350 or STAT 350 with a grade of ‘C’ or better."}, {"Course": "BTEC 430", "Name": "Translational Biochemistry and Molecular Biology", "Credits": "4", "Description": "This is an introductory level course focusing on essential concepts of biochemistry and molecular biology. Topics include the purification and analysis of macromolecules, the transmission of genetic information, and high throughput sequencing. This course also includes a six-week laboratory practicum on extraction, purification and analysis of DNA, RNA and proteins from cultured mammalian cells and E.coli.", "Grading": "Graded", "Course ID": "102597", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have CHEM 351 , BIOL 303  or BTEC 303  with a grade of ‘C’ or better."}, {"Course": "BTEC 444", "Name": "Translational Cancer Biotechnology", "Credits": "3", "Description": "This course is designed to provide an in-depth overview of biotechnological aspects of the diagnosis, clinical management, and study of malignant disease. It is designed to provide Translational Biotechnology majors and others whose career path intersects with the course of neoplasia.", "Grading": "Graded", "Course ID": "102599", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BIOL 303  or BTEC 303  with a ‘C’ or better."}, {"Course": "BTEC 453", "Name": "Biochemical Engineering", "Credits": "4", "Description": "An overview of biochemical and microbiological applications, commercial and engineering processes including: industrial fermentation, enzymology, ultrafiltration, chromatography, and food and pharmaceutical processing. Important principles include: enzyme kinetics, cell growth, energetics and mass transfer. Processes of interest include those that are involved in the formation of desirable compounds and products or in the transformation, or destruction of unwanted or toxic substances.", "Grading": "Graded", "Course ID": "102600", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 151  or MATH 155 , PHYS 111  or PHYS 121  and CHEM 351  with a grade of ‘C’ or better"}, {"Course": "BTEC 462", "Name": "Bioprocess Design and Control", "Credits": "4", "Description": "This is a course in bioprocess control theory and applications. The first half of the course focuses on developing mathematical models for basic bioprocesses such as continuous reactor systems and heat transfer equipment. Students learn analytical techniques (MATLAB and Simulink) to find the time domain response of these systems to common types of forcing functions (step, pulse, and impulse functions). The second half of the course focuses on applying classical control theory to bioprocesses. Students construct block flow diagrams for the components of the control loop, and how to calculate the time domain closed loop response. Students also learn how to design feed-back control systems and various controller tuning techniques. The use of MATLAB, SIMULink, and instructor-written software allows students to observe process control behavior for a wide range of systems.", "Grading": "Graded", "Course ID": "102601", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete (BIOL 430 or BTEC 430), (STAT 350 or BTEC 350) and BTEC 453 with a grade of ‘C’ or better."}, {"Course": "BTEC 470", "Name": "Advanced Biomanufacturing", "Credits": "4", "Description": "The course builds upon the foundation of bioprocess design principles and focuses on actual design projects, and includes components associated with financial analysis. Students taking this course are expected to demonstrate working knowledge of these principles in their design choices, reports and presentations.", "Grading": "Graded", "Course ID": "102602", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have competed (BIOL 430 or BTEC 430), (STAT 350 or BTEC 350) and BTEC 453  all with a grade of ‘C’ or better."}, {"Course": "BTEC 490", "Name": "Special Topics in Translational Life Science Technology", "Credits": "1", "Description": "This course allows specialized courses to be taught in the area of translational science not covered in the TLST curriculum on an ad hoc basis. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "102929", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Complete BTEC 300 with a grade of ‘C’ or better."}, {"Course": "BTEC 495", "Name": "Professional Internship and Project-based Research Experience", "Credits": "3", "Description": "This course will give students an opportunity to acquire hands-on training in academic or industrial research labs that will be analogous to the undergraduate research experiences available on the UMBC campus.", "Grading": "Pass/Fail", "Course ID": "102603", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed BTEC 310 and BTEC 350 or STAT 350 with a grade of ‘C’ or better"}, {"Course": "ENCH 210", "Name": "Introduction to Environmental Engineering", "Credits": "3", "Description": "This course will provide an introduction to environmental quality and the development of the background necessary for understanding environmental engineering principles and problem solving. Flow and material balance concepts will be presented for tracking substances in the environment and in engineered systems. Simple quantitative engineering models will be developed describing the fate and transport of chemicals in reactors.", "Grading": "Graded/Audit", "Course ID": "100566", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ENES 101 and CHEM 102 and MATH 152."}, {"Course": "ENCH 215", "Name": "Chemical Engineering Analysis", "Credits": "3", "Description": "Introduction to methods of chemical engineering calculations and analysis. Stoichiometric relations; material and energy balances; and behavior of gases, vapors, liquids and solids. Analytical and computer methods are presented. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53823", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENCH 215H ", "Prerequisite/Corequisite": "Must have completed ENES 101 or ENES 101H or ENES 101Y and CHEM 102 or CHEM 102H with a C or better in both. Can be taken concurrently."}, {"Course": "ENCH 215H", "Name": "Chemical Engineering Analysis-Honors", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53824", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "ENCH 215 ", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must be admitted to the Honors College and have completed ENES 101 or ENES 101H or ENES 101Y and CHEM 102 or ENES102H with a grade of C or better. Can be taken concurrently."}, {"Course": "ENCH 225L", "Name": "Chemical Engineering Problem Solving and Experiment Design Lab", "Credits": "4", "Description": "Introduction to the scientific method as applied to chemical engineering processes associated with thermodynamics and fluid, heat and mass transport. Computational and experimental tools are introduced. Students will formulate hypotheses to test physical phenomena associated with chemical engineering processes, design experiments based on their hypotheses, perform experiments, and use appropriate computational and programming tools as well as statistical methods to analyze their data and its significance. Issues of safety and ethics, as applied to chemical engineering, also will be discussed.", "Grading": "Graded", "Course ID": "53825", "Consent": "Department Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed ENCH 215 or ENCH 215H and ENGL 100 with a grade of C or better."}, {"Course": "ENCH 300", "Name": "Chemical Process Thermodynamics", "Credits": "3", "Description": "Principles of thermodynamics and their application to engineering problems. First and second laws of thermodynamics; properties of gases; liquids and solids; phase equilibrium; flow and non-flow systems; energy conversion; production of work from heat; thermodynamic analysis of processes; equilibrium-stage operations and the thermodynamics of chemically reacting systems. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53828", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 215 and MATH 251 and CHEM 351 with a “C” or better."}, {"Course": "ENCH 333", "Name": "Chemical Engineering Seminar", "Credits": "1", "Description": "Oral and written reports on recent developments in chemical engineering and the process industries.", "Grading": "Pass/Fail", "Course ID": "53829", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "ENCH 410", "Name": "Environmental Chemistry", "Credits": "3", "Description": "This course presents chemical and biological principles in the context of manmade and natural systems. Equilibrium and kinetic concepts are reinforced through the use of chemical equilibrium and kinetic models. Surface and colloid chemistry are also discussed. At the end of the course, the student will be able to understand the basic chemical and biological phenomena that control the fate of pollutants in the environment. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: ENCH 210.", "Grading": "Graded", "Course ID": "100567", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 102 and MATH 225 and take ENCH 300 as a corequisite."}, {"Course": "ENCH 412", "Name": "Environmental Physicochemical Processes", "Credits": "3", "Description": "This course focuses on physicochemical processes that control the fate of contaminants in engineered and natural systems is discussed. Physicochemical phenomenon is first introduced from a phenomenal standpoint, then its role in both engineered and natural systems discussed. At the end of the course, the student will be able to understand the basic physicochemical phenomena that control the fate of pollutants in the environment. Recommended Preparation: ENCH 410", "Grading": "Graded/Audit", "Course ID": "100568", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must be concurrently enrolled in ENCH 427."}, {"Course": "ENCH 414", "Name": "Environmental Biological Processes", "Credits": "3", "Description": "The purpose of this course is to provide students with the fundamental and design aspects of biological processes. The course focuses on engineered biological treatment for both municipal wastewater systems and contaminated soils and sediments. An understanding of biological treatment operations requires knowledge in the fundamental areas of biochemistry, mass transport, microbiology, reaction kinetics and reactor engineering. Recommended Preparation: ENCH 410.", "Grading": "Graded/Audit", "Course ID": "100569", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 425", "Name": "Transport I: Fluids", "Credits": "3", "Description": "Fluid properties, fluid statics, flow concepts and basic equations, and viscous effects. Applications in measurements of flow. Design of fluid flow equipment. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53830", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 215 and MATH 225 with a “C” or better."}, {"Course": "ENCH 427", "Name": "Transport Processes II: Mass Transfer", "Credits": "3", "Description": "Steady and unsteady state heat and mass transfer, interphase transfer, simultaneous heat and mass transfer, boundary layer theory, and mass transfer with a chemical reaction. Design applications in condensation, heat exchanger, evaporating, and mass transfer operations. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53831", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 425 with a grade of “C” or better."}, {"Course": "ENCH 437L", "Name": "Chemical Engineering Laboratory", "Credits": "3", "Description": "Application of chemical engineering process and unit operation principles in small-scale, semi-commercial equipment. Data from experimental observations are used to evaluate performance and efficiency of operations. Emphasis is placed on correct presentation of results in both written and oral form.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53832", "Consent": "Department Consent Required", "Components": "Discussion, Laboratory", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENCH 225L and ENCH 427 and ENCH 440 with a grade of C or better."}, {"Course": "ENCH 440", "Name": "Chemical Engineering Kinetics", "Credits": "3", "Description": "Fundamentals of chemical reaction kinetics and their application to the design and operation of chemical reactors. Reaction rate theory, homogeneous reactions in batch and flow systems, heterogeneous reactions and catalysis, and biochemical reactions. Catalytic reactor design. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53833", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 300 and ENCH 425 and CHEM 301 with a “C” or better. CHEM 303 can be taken concurrently."}, {"Course": "ENCH 442", "Name": "Chemical Process Control and Safety", "Credits": "3", "Description": "Dynamic response of process systems. Analysis, optimization, and design of simple control systems, closed-loop response, and dynamic testing. Design and simulation of systems for chemical process safety.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53835", "Consent": "Department Consent Required", "Components": "Laboratory, Lecture", "Prerequisite/Corequisite": "You must complete ENCH 225L and ENCH 300 and ENCH 425 and MATH 225 all with a grade of C or better."}, {"Course": "ENCH 444", "Name": "Process Engineering Economics and Design", "Credits": "3", "Description": "Principles of chemical engineering economics and process design. Emphasis on equipment types, equipment design principles, capital cost estimation, operating costs and profitability. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53836", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Student must complete ENCH 427 and ENCH 440 with a grade of C or better. ENCH 445 can be taken concurrently as a co-requisite."}, {"Course": "ENCH 445", "Name": "Separation Processes", "Credits": "3", "Description": "Solution thermodynamics. Phase equilibrium. Characteristics of separation processes. Simple and multistage equilibrium processes. Design and operation of binary and multicomponent separation processes. Computational approaches. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53837", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 with a grade of “C” or better."}, {"Course": "ENCH 446", "Name": "Process Engineering Economics and Design II.", "Credits": "4", "Description": "Application of chemical engineering principles for the design of chemical processing equipment. Typical problems in the design of chemical plants. Comprehensive reports are required. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53838", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Prerequisite/Corequisite": "You must complete ENCH 444 and ENCH 445 and ENCH 442 with a grade of C or better. ENCH 442 may be taken concurrently."}, {"Course": "ENCH 450", "Name": "Chemical Process Development", "Credits": "3", "Description": "Chemical process industries from the standpoint of technology, raw materials, products and processing equipment. Operation of major chemical processes and industries, combined with quantitative analysis of process requirements and yields. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53839", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 456", "Name": "Polymeric Materials", "Credits": "3", "Description": "The basic elements of the chemistry, physics, processing methods and engineering applications of polymers.", "Grading": "Graded/Audit", "Course ID": "53843", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 459", "Name": "Statistical Design of Experiments", "Credits": "3", "Description": "Introduces students to a variety of methods that use a statistical approach in the design, execution and analysis of industrial experiments.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53845", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 468", "Name": "Research Projects", "Credits": "1", "Description": "Investigation of a research project under the direction of one of the faculty members. Comprehensive reports are required. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53846", "Consent": "Department Consent Required", "Components": "Research", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 and ENGL 100 with a grade of ’C’ or better."}, {"Course": "ENCH 470", "Name": "Chemical and Environmental Modeling", "Credits": "3", "Description": "This course builds upon mathematical and computational fundamentals from differential equations and chemical engineering problem solving to employ models that simulate chemical and ecological phenomena. Population models for bioreactors and ecosystems will be investigated, as well as mathematical models for simulating water and air chemistry and pollution. Recommended Preparation: ENCH 225L or equivalent programming experience.", "Grading": "Graded/Audit", "Course ID": "101787", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ENCH 427 and ENCH 440 with a C or better."}, {"Course": "ENCH 472", "Name": "Environmental Fate and Transport", "Credits": "3", "Description": "This course covers basic principles of chemical fate and transport in the environment. Course materials include the fundamental concepts and practical, quantitative problem-solving techniques dealing with environmental contaminations. Mass balance; chemical equilibrium and kinetics; environmental transport; and advanced topics, such as groundwater well dynamics and subsurface fate and transport, atmospheric transport of pollutants and Monod kinetics are among those included in the materials. Computer software is also used to solve complex but practical fate and transport problems in the environment.", "Grading": "Pass Fail/Audit", "Course ID": "100570", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 474", "Name": "Air Pollution", "Credits": "3", "Description": "The objective of this course will be to provide an introduction to the sources, chemistry and fate of airborne pollutants. In general, it will be broken into three parts: sources and dispersion processes, gas-phase chemistry and particulate-phase chemistry. The focus will be on the urban atmosphere, but as some pollutants have impacts well beyond their source region some discussion of global cycles will be appropriate. The course should provide a general introduction to atmospheric chemistry including both gas-phase and particulate-phase processes.", "Grading": "Graded/Audit", "Course ID": "100571", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 476", "Name": "Environmental Risk Assessment & Remediation", "Credits": "3", "Description": "The objective of this course is to examine the fundamental principles governing toxic contaminant exposure and risk to humans and ecosystems. The course covers necessary aspects of probability and statistics, physical and chemical behavior of key priority pollutants, mass transfer and exposure pathways of the contaminants, human and environmental toxicology and methodologies for risk assessment. Concepts of green engineering focused on design, commercialization, and use of processes and products to reduce generation of pollution and risk to human health and the environment are studied. Case studies of remediation technology applications with a focus on understanding how human and environmental risk is managed in a real-life situation are presented.", "Grading": "Graded/Audit", "Course ID": "100572", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 482", "Name": "Biochemical Engineering", "Credits": "3", "Description": "Introduction to biochemical, microbiological and physical phenomena relevant in the bioprocess industry: basic biochemistry, enzyme and cell growth kinetics, modern biological techniques (e.g., DNA sequencing, microarray analysis, proteomics) and topics related to industrial fermentation (e.g., operating modes, mixing, mass transfer, scaleup). (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53847", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 484", "Name": "Biomedical Engineering", "Credits": "3", "Description": "Applications of engineering analysis to biomedical issues, including drug delivery, biomaterials, tissue engineering, receptor-mediated processes, cardiovascular mechanics, physiological mass transfer and biomedical device design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53848", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 485L", "Name": "Biochemical Engineering Laboratory.", "Credits": "4", "Description": "Conduct experiments to study microbial growth and product formation kinetics. Study enzyme kinetics. Conduct protein isolation, purification and concentration experiments. Analyze experimental data and prepare written reports and oral presentations. Observe laboratory safety precautions. This course is designed to teach modern chemical and biochemical laboratory practice. Students will learn aspects of heat and mass transfer of relevance to the bioprocess industry. In addition, they will learn aspects of microbial growth and product formation kinetics. Simple cloning techniques and enzyme/antibody assays will be introduced. Students will isolate and purify proteins. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53849", "Consent": "Department Consent Required", "Components": "Discussion, Laboratory", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENCH 225L and ENCH 482 with a grade of C or better"}, {"Course": "ENCH 486", "Name": "A Survey of Sensors and Instrumentation", "Credits": "3", "Description": "This course will provide a broad overview of sensors and instrumentation used in a number of applications. Starting with basic definitions, the course will move on to various principles (physical, chemical and biological) used to sense a variety of parameters. A simple sensor will be contructed during the course to provide hands-on experience in sensor design. This elective is suitable for science and engineering majors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53850", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "Must have completed ENCH 427 and ENCH 440 with a “C” or better."}, {"Course": "ENCH 489", "Name": "Special Topics in Environmental Engineering", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53851", "Consent": "Department Consent Required", "Components": "Lecture", "Topics": "Envirn Fate Transport, Spec Topics In Envr Engr, Biological Treat Process, Physiochemical Processes, Eng. Env. Processes, Eng. Biological Processes, Environmental Biological Processes, Environmental Chemistry, Air Pollution"}, {"Course": "ENCH 657", "Name": "Devices & Combination Products", "Credits": "3", "Description": "This course is designed to provide students with comprehensive coverage of all aspects for the development and Life Cycle Management (LCM) of Combination Products (CP) and Devices. Subject areas discusses will include: routes of submissions of Devices and Combination Products such as NDA, BLA, MAA, 510(k). Scientific background for the development of Devices and CP. Clinical studies vs. Human Factors studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102818", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CHEM 100", "Name": "The Chemical World", "Credits": "3", "Description": "A topical discussion of the science of chemistry and its relationship to our everyday lives. While no previous knowledge of chemistry is required, this course does involve the use of chemical formulas and such basic math as algebra and scientific notation. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52670", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "CHEM 101", "Name": "Principles of Chemistry I", "Credits": "4", "Description": "An introduction to chemistry for science majors and other students who require a thorough grounding in the principles of chemistry. Topics treated include the atomic-molecular theory of matter, stoichiometry, states of matter, chemical nomenclature, energetics of chemical and physical processes, solutions, periodic properties, VSEPR, molecular orbital theory and chemistry of familiar elements. Note: Credit may not be obtained for both CHEM 101 and CHEM 123. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content. More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52671", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CHEM 101H", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete MATH 106 or MATH 106Y or MATH 150 or MATH 151 or MATH 155 with a C or better or have AP credit for MATH 150 or MATH 151 or have a MATH placement score of 4 or 5."}, {"Course": "CHEM 101H", "Name": "Principles of Chemistry I - Honors", "Credits": "4", "Description": "", "Note": "This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content. More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52672", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture, Seminar", "Course Equivalents": "CHEM 101 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "CHEM 102", "Name": "Principles of Chemistry II", "Credits": "4", "Description": "Principles of chemical and physical equilibrium, liquids and solids, elementary thermodynamics, electron and proton transfer reactions, electrochemistry, chemical kinetics and a further study of the periodic properties of the elements. (Fall/Spring/Summer)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52673", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "CHEM 102H ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must have completed CHEM 101 or CHEM 101H with a grade of “C” or better."}, {"Course": "CHEM 102H", "Name": "Principles of Chemistry - Honors", "Credits": "4", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52674", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture, Seminar", "Course Equivalents": "CHEM 102 ", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must have completed CHEM 101 or CHEM 101H with a grade of “C” or better and also be admitted to the Honors College."}, {"Course": "CHEM 102L", "Name": "Introductory Chemistry Lab I", "Credits": "2", "Description": "Companion course to CHEM 102, intended for all students who require two or more years of chemistry. (Fall/Spring/Summer)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52675", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must complete CHEM 101 or CHEM 101H and CHEM 102 or CHEM 102H all with a C or better. CHEM 102 or CHEM 102H can be completed or taken concurrently."}, {"Course": "CHEM 110L", "Name": "Scientific Glass Blowing Lab", "Credits": "1", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52679", "Consent": "No Special Consent Required", "Components": "Laboratory"}, {"Course": "CHEM 123", "Name": "Introduction to General Organic and Biochemistry I", "Credits": "4", "Description": "A two-semester chemistry course intended for students preparing for health sciences. Topics include atomic molecular theory, properties of the elements, bonding and molecular structure, solutions, elementary organic chemistry, proteins, lipids, carbohydrates and nucleic acids. Recommended Preparation: A working knowledge of elementary algebra is required. (Fall/Summer)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52682", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)"}, {"Course": "CHEM 124", "Name": "Introduction to General Organic and Biochemistry II", "Credits": "3", "Description": "Continuation of CHEM 123. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52683", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP), Science (non-lab) (GFR)", "Prerequisite/Corequisite": "You must complete CHEM 123 with a C or better."}, {"Course": "CHEM 124L", "Name": "General Organic and Biochemistry Lab", "Credits": "2", "Description": "A companion laboratory course to CHEM 124. This course, together with CHEM 123 and CHEM 124, will complete the chemistry requirement for nurses, dental hygienists, physical therapists and others in health-related sciences, with the exception of premed and predental students. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52684", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Lab Component for Science (GEP), Lab Component for Science (GFR)", "Prerequisite/Corequisite": "You must have completed CHEM 123 and CHEM 124 both with a C or better. CHEM 124 can be taken concurrently."}, {"Course": "CHEM 299", "Name": "Training in Experimental Chemistry (Cooperative Education)", "Credits": "1", "Description": "This course cannot be applied to the requirements of the major in chemistry. It does, however, provide a mechanism whereby a student intending to pursue a career in chemistry may acquire academic credit for training obtained while employed outside of the university. The number of credits assigned, which may not exceed three per semester, is based upon the instructor’s assessment of the scientific level of the employment and its contribution to the professional development of the student. The grade assigned is based upon a report written by the student and the instructor’s appraisal of the student’s performance. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "52688", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "CHEM 300", "Name": "Analytical Chemistry", "Credits": "4", "Description": "A lecture-laboratory course covering the theory and practice of quantitative chemical analysis. The emphasis is on homogeneous and heterogeneous equibilibria involved in gravimetric and volumetric methods. Introduction to instrumental techniques includes potentiometry, spectrophotometry and chromatographic separations. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52689", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed CHEM 102 or CHEM 102H and CHEM 102L with a grade of “C” or better."}, {"Course": "CHEM 301", "Name": "Physical Chemistry I", "Credits": "4", "Description": "A lecture course covering the laws of thermodynamics, with emphasis on their application to chemical systems. Topics considered include thermochemistry, equations of state, physical and chemical equilibrium, electrochemistry, kinetic theory of gases, chemical kinetics and the theory of rate processes. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52690", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CHEM 102 or CHEM 102H and MATH 152 or MATH 152H and PHYS 122 all with a C or better. PHYS 122 can also be taken concurrently."}, {"Course": "CHEM 302", "Name": "Physical Chemistry II", "Credits": "3", "Description": "Continuation of CHEM 301. Topics considered include molecular structure and bonding, interpretation of spectra, and introductory quantum and statistical mechanics. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52691", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CHEM 301 with a C or better."}, {"Course": "CHEM 303", "Name": "Physical Chemistry for the Biochemical Sciences", "Credits": "3", "Description": "This course is designed to familiarize students with the qualitative and quantitative concepts of physical chemistry as they apply to biochemical systems and macromolecules. Approximately one-third of the course will be devoted to topics in thermodynamics, kinetics, and spectroscopy. Topics considered include general equilibrium thermodynamics emphasizing biochemical applications, ligand binding, biological oxidation-reduction reactions, membranes, colligative properties and transport properties, kinetics including elementary rate laws, reaction mechanisms and activated processes, and relaxation and enzyme kinetics, and an introduction to quantum chemistry, electronic structure and bonding, and molecular spectroscopy (including vibrational, electronic and magnetic spectroscopy). The use of modern instrumentation will be discussed throughout the course. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52692", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 351 and MATH 152 with a C or better. PHYS 112 or PHYS 122 must be completed with a C or better and can be taken concurrently"}, {"Course": "CHEM 311L", "Name": "Advanced Laboratory I", "Credits": "3", "Description": "Laboratory exercises encompassing experimental problems in physical, inorganic, synthetic and instrumental analytical chemistry. Emphasis is placed on the analysis of data, the techniques of measurement and computer-interfaced instrumentation. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52695", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed CHEM 102L with a C or better and have completed CHEM 301 with a ‘C’ or better or be enrolled in CHEM 301 concurrently."}, {"Course": "CHEM 312L", "Name": "Advanced Laboratory II", "Credits": "3", "Description": "Continuation of CHEM 311L. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52696", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00, Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed CHEM 311L and CHEM 302 both with a C or better. You can also take CHEM 302 concurrently."}, {"Course": "CHEM 351", "Name": "Organic Chemistry I", "Credits": "3", "Description": "The chemistry of aliphatic and aromatic compounds, including bonding, stereochemistry and reactions of functional groups. Reaction mechanisms, synthetic methods and characterization of organic molecules. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52697", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CHEM 102 or CHEM 102H with a C or better."}, {"Course": "CHEM 351L", "Name": "Organic Chemistry Laboratory I", "Credits": "2", "Description": "Companion laboratory course to CHEM 351. (Fall/Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52698", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CHEM 102 or CHEM 102H and CHEM 102L and CHEM 351 all with a C or better. CHEM 351 can be taken concurrently."}, {"Course": "CHEM 352", "Name": "Organic Chemistry II", "Credits": "3", "Description": "Continuation of CHEM 351. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52699", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 102 or CHEM 102H and CHEM 351 with a C or better."}, {"Course": "CHEM 352L", "Name": "Organic Chemistry Laboratory II", "Credits": "2", "Description": "Companion laboratory class to CHEM 352 and continuation of CHEM 351L. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52700", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CHEM 102L and CHEM 351 and CHEM 351L and CHEM 352 all with a C or better. CHEM 352 can be taken concurrently."}, {"Course": "CHEM 396", "Name": "Undergraduate Learning Assistantship", "Credits": "1", "Description": "This service-learning course is designed for undergraduate learning assistants in non-laboratory chemistry courses. Students must be recommended in writing by the faculty member teaching the course and be approved by the department. Student work must be performed in a course taught by Chemistry and Biochemistry and must have a significant learning component. In addition to their classroom responsibilities, students will participate in a weekly session on effective learning methods and pedagogy taught by a member of the chemistry faculty. Credit will be earned for the mandatory weekly session and for the preparation for and interaction with students in the classroom. This course is repeatable for credit. Students may complete a maximum of 8 credits. Recommended Preparation: A grade of B or higher in the course that they will serve as a Learning Assistant.", "Grading": "Pass/Fail", "Course ID": "102073", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "CHEM 397", "Name": "Ethics and Integrity in Scientific Research", "Credits": "1", "Description": "Individuals involved in contemporary scientific research have ethical responsibilities for their conduct. The goal of this course is to provide students considering a career in scientific research with an appropriate framework for establishing appropriate scientific integrity. Various topics relevant to scientific integrity, including defining, handling and responding to fraud and misconduct; peer review; obligations and rights of students and mentors; ethical conduct in animal and human experimentation; ownership of data; reagents; and intellectual property, authorship and conflict of interest will be presented and discussed. Specific research situations and examples of past ethical violations will be used to illustrate appropriate ethical standards.", "Grading": "Pass/Fail", "Course ID": "52701", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CHEM 398", "Name": "Seminar in Chemistry", "Credits": "2", "Description": "In this course, the problem of lead poisoning will serve as a focal point to develop perspective, insight and retrospection into an important societal problem. The course will be presented as a series of seminars that cover in-depth the many facets of lead and lead poisoning. Some of the topics include the chemistry of lead, its history, toxicology, ecology, legal and political ramifications, and its remediation. The culmination of the course will be the student projects, which will meld their knowledge, interpretation of lecture material and personal experience.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52702", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "CHEM 399", "Name": "Tutorial Projects in Chemistry", "Credits": "1", "Description": "Independent study supervised by a faculty member. The course is intended for students who wish to study topics in chemistry not covered by the regular course offerings. One credit hour is equal to a minimum of four hours of work in the laboratory per week. CHEM 399 may be taken for a maximum of 3 credits and may only be taken once. A maximum of eight credits from the combination of BIOL 398, BIOL 399, BIOL 499, CHEM 399 and CHEM 499 may be applied toward the 120 credits for graduation. Variable credit course repeatable up to 6 credits.", "Grading": "Pass/Fail", "Course ID": "52703", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "CHEM 401", "Name": "Chemical and Statistical Thermodynamics", "Credits": "3", "Description": "Basic methods of classical and statistical thermodynamics developed at a level appropriate for first-year graduate students and advanced undergraduates. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52704", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 302 with a C or better."}, {"Course": "CHEM 405", "Name": "Inorganic Chemistry", "Credits": "3", "Description": "Basic theoretical concepts of inorganic chemistry, including a study of the periodic table, the elements and their physical and chemical properties. Several theories of bonding are discussed, as well as the mechanisms of inorganic reactions, coordination chemistry and the chemistry of transition metals. (Spring)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52705", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CHEM 352 with a C or better."}, {"Course": "CHEM 405L", "Name": "Advanced Inorganic Chemistry Lab", "Credits": "3", "Description": "The course skills that will be emphasized in the course are anaerobic synthesis and advanced characterization methods. These methods will be applied to inorganic complexes important in biological/medicinal inorganic chemistry and nanomaterials. This interdisciplinary course aims to combine traditional inorganic chemistry concepts/methods with areas of inorganic chemistry not covered in lower-level courses.", "Grading": "Graded", "Course ID": "100099", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must complete CHEM 300 and CHEM 352L and CHEM 405 with a C or better."}]