[{"Course": "CMSC 411", "Name": "Computer Architecture", "Credits": "3", "Description": "This course covers the design of complex computer systems making heavy use of the components and techniques discussed in CMSC 313, CMPE 212 and CMPE 310. All parts of the computer system - CPU, memory and input/output - are discussed in detail. Topics include information representation, floating-point arithmetic, instructions set design issues (RISC vs. CISC), microprogrammed control, hardwired control, pipelining, memory caches, bus control and timing, input/output mechanism and issues in the construction of parallel processors.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52922", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 313 or CMPE 212 and CMPE 310 with a grade of C or better."}, {"Course": "CMSC 421", "Name": "Principles of Operating Systems", "Credits": "3", "Description": "An introduction to the fundamentals of operating systems. Topics include interprocess communication, process scheduling, deadlock, memory management, virtual memory, file systems and distributed systems. Formal principles are illustrated with examples and case studies of one or more contemporary operating systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52928", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 and (CMSC 313 or CMPE 212 and CMPE 310) all with a grade of C or better."}, {"Course": "CMSC 426", "Name": "Principles of Computer Security", "Credits": "3", "Description": "This course will provide an introduction to computer security, with specific focus on the computing aspects. Topics covered will include: Basics of computer security including an overview of threat, attack, and adversary models; social engineering; essentials of cryptography; traditional computing security models; malicious software; secure programming; Operating system security in practice; trusted operating system design; public policy issues including legal, privacy, and ethical issues; network and database security overview.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52931", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and CMSC 313 or (CMPE 212 and CMPE 310) all with a grade of C or better."}, {"Course": "CMSC 427", "Name": "Wearable Computing", "Credits": "3", "Description": "This course covers fundamental concepts, methodologies, and algorithms related to wearable computing, including the following: Emotional Design, Convergent Design Processes, Wearability Considerations, Wearable Sensors Networks, Wearable Networks, Physiological Wearable Sensors, Innovation Processes, Marketing and business considerations, Human Aware Computing, Context Awareness, Wearable Communities, Future Mobility and Wearable Systems Applications.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52932", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Senior CMSC Major"}, {"Course": "CMSC 431", "Name": "Compiler Design Principles", "Credits": "3", "Description": "A detailed study of the design and implementation of a compiler for a high-level programming language. Topics include lexical analysis, parsing techniques (including LL and LR parsers), semantic routines, run-time storage allocation, code generation and optimization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52933", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 313 and CMSC 331 and CMSC 341 with a C or better."}, {"Course": "CMSC 432", "Name": "Object-Oriented Programming Languages and Systems", "Credits": "3", "Description": "This course covers the concepts of object-oriented programming (OOP) languages and systems, including an introduction to fundamental abstraction, modularity and encapsulation mechanisms in OOP from a software engineering and representational perspective. Basic OOP concepts covered in this course include polymorphism and operator overloading, message passing via generic functions, late- vs. early-binding times, and inheritance mechanisms and their relationship to the type systems of programming languages. Other topics include a survey of OOP languages and systems, OOP languages vs. imperative programming languages and contrasting pure OOP environments vs. mixed paradigm languages.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52934", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 331 and CMSC 341 with a C or better."}, {"Course": "CMSC 433", "Name": "Scripting Languages", "Credits": "3", "Description": "This course is a study of a class of programming languages and tools known as scripting languages. Topics include: writing scripts to control and connect other programs, strengths and weaknesses of interpreted languages, extending scripting languages to include new functionality, embedding functions of a scripting language in other tools, and the syntax and usage of regular expressions. Programming projects in multiple languages will be required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52935", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 331 with the grade of C or better."}, {"Course": "CMSC 435", "Name": "Computer Graphics", "Credits": "3", "Description": "An introduction to the fundamentals of interactive computer graphics. Topics include graphics hardware, line drawing, area filling, clipping, two-dimensional and three-dimensional geometrical transforms, three-dimensional perspective viewing, hidden surface removal, illumination, color and shading models.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52936", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 313 and CMSC 341 and MATH 221 with a C or better."}, {"Course": "CMSC 436", "Name": "Data Visualization", "Credits": "3", "Description": "This course addresses the theoretical and practical issues in creating visual representations of large amounts of data. It covers the core topics in data visualization: data representation, visualization toolkits, scientific visualization, medical visualization, information visualization, and volume rendering techniques. Additionally, the related topics of applied human perception and advanced display devices are introduced. Open to computer science students with a background in computer graphics or students in data-intensive fields who are familiar with the use of the computer for data collection, storage or analysis.", "Grading": "Graded", "Course ID": "52937", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 436H ", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 436H", "Name": "Data Visualization Honors", "Credits": "3", "Description": "This course addresses the theoretical and practical issues in creating visual representations of large amounts of data. It covers the core topics in data visualization: data representation, visualization toolkits, scientific visualization, medical visualization, information visualization, and volume rendering techniques. Additionally, the related topics of applied human perception and advanced display devices are introduced. Open to computer science students with a background in computer graphics or students in data-intensive fields who are familiar with the use of the computer for data collection, storage or analysis.", "Grading": "Graded", "Course ID": "100490", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 436 ", "Prerequisite/Corequisite": "CMSC 435 with a C or better."}, {"Course": "CMSC 437", "Name": "Graphical User Interface Programming", "Credits": "3", "Description": "This is a practical, hands-on course in how to program interactive 2-D graphical user interfaces using the X11/Motif package and OpenGL. Graphical user interfaces are taken here to mean not just standard widget sets, but also various interactive, pointer-based techniques that comprise the modern desktop metaphor. This course also will introduce some of the concepts and software techniques used to implement such applications. In addition, it briefly will review some of the larger issues, history and future directions of programming graphical interfaces. While the primary emphasis of the course is on 2-D interfaces, there will be a short introduction to some of the 3-D capabilities of OpenGL,as well as a discussion of 3-D interaction and virtual reality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52938", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and MATH 221 with a C grade or better."}, {"Course": "CMSC 441", "Name": "Design and Analysis of Algorithms.", "Credits": "3", "Description": "This course studies fundamental algorithms, strategies for designing algorithms, and mathematical tools for analyzing algorithms. Fundamental algorithms studied in this course include algorithms for sorting and searching, hashing, and graph algorithms. Mathematical tools include asymptotic notations and methods for solving recurrences. Algorithm design strategies include the greedy method, divide-and-conquer, dynamic programming, and randomization.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52940", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 and CMSC 341 and one of the following (STAT 355, STAT 451, or CMPE 320)  with a grade of C or better."}, {"Course": "CMSC 442", "Name": "Information and Coding Theory", "Credits": "3", "Description": "An introduction to information and coding theory. Topics include error-control coding problems, entropy, channels, Shannon’s theorems, error-correcting codes, applications of coding theory, algebraic codingtheory, block codes, linear codes, cyclic codes, decoding algorithms, BCH codes, convolutional codes, linear sequential circuits and sequential decoding.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52941", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 203 and MATH 221 with a grade of C or better."}, {"Course": "CMSC 443", "Name": "Cryptology", "Credits": "3", "Description": "An introduction to cryptology, the science of making and breaking codes and ciphers. Topics include: conventional and public-key cryptosystems, including DES, RSA, shift register systems and selected classical systems; examples of cryptanalytic techniques; digital signatures; pseudo-random number generation; cryptographic protocols and their applications; and an introduction to the theories of cryptographic strength based on information theory and complexity theory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52942", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and MATH 221 and STAT 355 with a C or better."}, {"Course": "CMSC 444", "Name": "Information Assurance", "Credits": "3", "Description": "Selected recent research topics in information assurance, such as social engineering, buffer overflow, malicious code, spyware, denial of service, information warfare, computer forensics, recovery and response, enterprise security, clandestine channels and emissions security, security analysis, security models and formal techniques, best practices, and national policy for information assurance. Taking a broad, practical view of security - including people, policies and procedures, and technology - this course will help students devise and implement security solutions that meaningfully raise the level of confidence in computer systems. This course will minimize discussion of intrusion detection, firewalls, operating systems security, and mathematical cryptology, which are emphasized in other CMSC security courses.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52943", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 421 and CMSC 481  with a C or better."}, {"Course": "CMSC 446", "Name": "Introduction to Design Patterns", "Credits": "3", "Description": "This course is an introduction to software design patterns. Each pattern represents a best practice solution to a software problem in some context. The course will cover the rationale and benefits of object-oriented software design patterns. Several example problems will be studied to investigate the development of good design patterns. Specific patterns, such as observer, state, adapter, strategy, decorator and abstract factory will be discussed. Programming projects in the Java language will provide experience in the use of these patterns. In addition, distributed object frameworks, such as RMI and Jini, will be studied for their effective use of design patterns.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52945", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 331 and  CMSC 341 with a C or better."}, {"Course": "CMSC 447", "Name": "Software Engineering I", "Credits": "3", "Description": "This course introduces the basic concepts of software engineering, including software life cycle, requirements analysis and software design methods. Professional ethics in computer science and the social impact of computing are discussed as an integral part of the software development process. Additional topics may include tools for software development, software testing, software metrics and software maintenance. Note: Credit will not be given for both CMSC 345 and CMSC 447.", "Grading": "Graded", "Course ID": "101927", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must compete CMSC 341 one other CMSC 400-level course with a grade of C or better."}, {"Course": "CMSC 448", "Name": "Software Engineering II", "Credits": "3", "Description": "A continuation of the study of software engineering with emphasis on topics not fully covered in CMSC 345 and CMSC 447. Topics may include software maintenance; metrics; quality assurance; configuration management; deployment; project planning and management; and modern software development processes, techniques and tools. Students will be given multiple individual and cooperative hands-on assignments. Note: Credit will not be given for both CMSC 445 and CMSC 448.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52944", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 345 and CMSC 447 with a grade of a C or better."}, {"Course": "CMSC 449", "Name": "Malware Analysis", "Credits": "3", "Description": "Malicious software (malware) is a constant threat to the information and intellectual property of organizations. By analyzing malware using both state and dynamic methods, students will be introduced to those increasingly sophisticated attacks. This course will provide a foundation for understanding emerging trends in malware designs, including efforts to deter analysis. Discussions and hands-on exercises will cover object file formats, and the use of  tools such as debuggers, virtual machines, and disassemblers. Finally, obfuscation and packing schemes will be discussed, along with various issues related to operating systems internals.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102811", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  CMSC 313  and CMSC 341 with a ‘C’ or better."}, {"Course": "CMSC 451", "Name": "Automata Theory and Formal Languages", "Credits": "3", "Description": "This course introduces the basic concepts in the theory of formal languages. Topics include regular grammars and finite automata, context-free grammars and push-down automata, Turing machines and the halting problem, and an introductory treatment of computable and non-computable functions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52947", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 451H ", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 451H", "Name": "Automata Theory and Formal Languages", "Credits": "3", "Description": "This course introduces the basic concepts in the theory of formal languages. Topics include regular grammars and finite automata, context-free grammars and push-down automata, Turing machines and the halting problem, and an introductory treatment of computable and non-computable functions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100242", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 451 ", "Prerequisite/Corequisite": "You must have completed CMSC 202 and CMSC 203 with a grade of C or better"}, {"Course": "CMSC 452", "Name": "Logic for Computer Science", "Credits": "3", "Description": "This course covers the fundamental topics in sentential and first-order logic, including models, logical consequence, deduction and the completeness theorem. Other topics include: undecidability theorems, including Goedel’s incompleteness theorem and Tarski’s theorem; Herbrand’s theorem; and applications including resolution, logic programming, automatic deduction, program specification and program verification.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52948", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 203 with the grade of C or better."}, {"Course": "CMSC 453", "Name": "Applied Combinatorics and Graph Theory", "Credits": "3", "Description": "An introduction to the application of combinatorial methods to computer science. Topics include enumeration methods, recurrence relations, generating functions, graph theory and graph algorithms, and connectivity, Euler tours, Hamiltonian cycles, flow graphs and transport networks, matching theory, planarity, Kuratowski’s theorem and NP-complete combinatorial problems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52949", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and MATH 221 and MATH 152 or MATH 142 with a C or better."}, {"Course": "CMSC 455", "Name": "Numerical Computations", "Credits": "3", "Description": "Topics include numerical linear algebra, interpolation, solving non-linear systems and the numerical solution of differential equations. This course also provides some emphasis on numerical algorithms and computation in a parallel environment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52951", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and MATH 221 and MATH 152 or MATH 142 with a C or better."}, {"Course": "CMSC 456", "Name": "Symbolic Computation", "Credits": "3", "Description": "The theme of this course is abstract algebra from an algorithmic perspective. Algorithms for computing in groups, rings, fields, ideals, quotient rings and other algebraic objects are studied. For example, the Coxeter coset enumeration and the Groebner basis algorithms are studied. Algebraic varieties play a key role in this course. The course also covers many applications of symbolic computation, such as applications to algebraic coding theory, robotics and automatic theorem proving. There are various projects using a symbolic computation package such as Maple or Mathematica.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "052952", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete CMSC 341 and MATH 221 and MATH 152 or MATH 142 with a C or better."}, {"Course": "CMSC 457", "Name": "Quantum Computation", "Credits": "3", "Description": "The course begins with a brief overview of those topics in quantum mechanics and mathematics needed for the understanding of quantum computation. It will then focus on quantum algorithms, covering such topics as quantum superposition and quantum entanglement, quantum decoherence, quantum teleportation, quantum Turing machines, Shor’s Algorithm, Grover’s algorithm, Hallgren’s algorithm, quantum information theory, quantum data compression, quantum cryptographic protocols, quantum error-correcting codes, implementation issues.", "Grading": "Graded/Audit", "Course ID": "100191", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 203 and MATH 221 with a grade of C or better."}, {"Course": "CMSC 461", "Name": "Database Management Systems", "Credits": "3", "Description": "This course covers database management and the different data models used to structure the logical view of databases. The course also covers database design and implementation techniques, including file organization, query processing, concurrency control, recovery, integrity and security.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52954", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 462", "Name": "Introduction to Data Science", "Credits": "3", "Description": "Data science is a field that involves data manipulation, analysis, and presentation, all at scale. It’s typical for an organization to have a few terabytes of data maintained for different purposes by different business units stored in different formats and for someone to have an idea about how the data might bring significant value, often uncovering novel insights and novel beneficial ways to use the data in the process.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102810", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete STAT 355, STAT 451, or CMPE 320 each with a grade of ‘C’ or better. "}, {"Course": "CMSC 465", "Name": "Introduction to Electronic Commerce", "Credits": "3", "Description": "Electronic commerce is the use of electronic means to pursue business objectives. It relies on a wide range of modern technologies, such as the World Wide Web, telecommunications, database technologies, agent technologies, business intelligence, multimedia and user interfaces. This course puts special emphasis on the student’s ability to do research in existing and emerging technology and to summarize and present findings clearly. An important part of this course is the development of technical writing skills. The second part of the course concentrates on the issues that are not solely technical, such as trust management, privacy and personalization, and the role of electronic market in revolutionizing traditional industries.", "Grading": "Graded", "Course ID": "52955", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 461 and CMSC 481 with a C or better."}, {"Course": "CMSC 466", "Name": "Electronic Commerce Technology", "Credits": "3", "Description": "This course is designed to prepare students to be e-commerce developers. It introduces students to the changing and competitive landscape of e-commerce technology, products and solutions. It begins with an introduction to WWW technology and an overview of Web applications and services. It further discusses networking technologies with the view toward mobile and wireless commerce and object orientation and Web programming. An overview of Java language and relational databases is given. Database-Web connectivity is discussed. The course proceeds with the study of inter-process communications in a distributed environment concentrating on Java RMI and COBRA technologies. Development of interactive Web pages with JavaScript and dynamic HTML, one of the basic skills in the area of e-commerce development, is covered.", "Grading": "Graded", "Course ID": "52956", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 461 and CMSC 481 with a C or better."}, {"Course": "CMSC 471", "Name": "Introduction to Artificial Intelligence", "Credits": "3", "Description": "This course provides a broad introduction to artificial intelligence, its sub-fields and their applications. Topics include problem-solving approaches, problem spaces and search, knowledge representation and reasoning, logic and deduction, planning, expert systems, handling uncertainty, learning and natural language understanding.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52958", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 473", "Name": "Introduction to Natural Language Processing", "Credits": "3", "Description": "Natural language processing (NLP), the first non-numerical application of computing, was first studied more than 50 years ago. The ultimate goal of NLP is to enable computers to communicate with people the same way that people communicate among themselves. To do so, the computers must be able to understand and generate text. The course will introduce the students to the problems, methods, and applications of NLP.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52960", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "CMSC 475", "Name": "Introduction to Neural Networks", "Credits": "3", "Description": "This course is an in-depth introduction to neural networks. Topics include: characteristics of neural network computing; major neural network models and their related algorithms; supervised, unsupervised and reinforcement learning; and neural network application in function approximation, pattern analysis, optimization and associative memories.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52962", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 476", "Name": "Information Retrieval", "Credits": "3", "Description": "This course is an introduction to the theory and implementation of software systems designed to search through large collections of text. The first course objective is to cover the fundamentals of Information Retrieval (IR): retrieval models, search algorithms and IR evaluation. The second is to give a taste of the implementation issues through the construction and use of a text search engine.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52963", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 477", "Name": "Agent Architectures and Multi-Agent Systems", "Credits": "3", "Description": "This course covers fundamental techniques for developing intelligent agents and multi-agent systems, including cognitive, logic-based, reactive and belief-desire-intention architectures; inter-agent communication languages and protocols; distributed problem-solving, planning and constraint satisfaction methods; distributed models of rational behavior; and learning and adaptation in multi-agent systems. This course is repeatable for credit. Students may complete a maximum of 3 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52964", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 471 with a grade of C or better."}, {"Course": "CMSC 478", "Name": "Introduction to Machine Learning", "Credits": "3", "Description": "This course covers fundamental concepts, methodologies, and algorithms related to machine learning, which is the study of computer programs that improve some task with experience. Topics covered include decision trees, perceptrons, logistic regression, linear discriminant analysis, linear and non-linear regression, basic functions, support vector machines, neural networks, genetic algorithms, reinforcement learning, naive Bayes and Bayesian networks, bias/variance theory, ensemble methods, clustering, evaluation methodologies, and experiment design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52965", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 478H "}, {"Course": "CMSC 478H", "Name": "Introduction to Machine Learning", "Credits": "3", "Description": "This course covers fundamental concepts, methodologies, and algorithms related to machine learning, which is the study of computer programs that improve some task with experience. Topics covered include decision trees, perceptrons, logistic regression, linear discriminant analysis, linear and non-linear regression, basic functions, support vector machines, neural networks, genetic algorithms, reinforcement learning, naive Bayes and Bayesian networks, bias/variance theory, ensemble methods, clustering, evaluation methodologies, and experiment design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100216", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "CMSC 476 ", "Prerequisite/Corequisite": "You must have completed CMSC 471 with a grade of C or better."}, {"Course": "CMSC 479", "Name": "Introduction to Robotics", "Credits": "3", "Description": "This course covers fundamental concepts, methodologies, and algorithms related to autonomous mobile robotics, touching on mechanical, motor, sensory, perceptual, and cognitive aspects of the problem of building robots that move about and decide what to do on their own. Specific topics covered include legged and wheeled location, kinematic models and constraints, mobile robot maneuverability, motion control, sensors and sensing, perception, localization, belief representations, map representations, probabilistic map-based localization, autonomous map building, planning, reacting, and navigation architectures.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52966", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 471 with a grade of C or better."}, {"Course": "CMSC 481", "Name": "Computer Networks", "Credits": "3", "Description": "This course introduces the fundamentals of data communication and computer networking, including circuit and packet switching; network architectures and protocols; local/metropolitan/wide-area networks, OSI and TCP/IP standards; network programming and applications; and network management.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52968", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341 or CMSC 341H with the grade of C or better."}, {"Course": "CMSC 483", "Name": "Parallel and Distributed Processing", "Credits": "3", "Description": "This course provides a project and applications-oriented approach to parallel and distributed programming. Students will learn a specific parallel language and programming environment and will complete a large programming project. Topics include a selected parallel programming language, a survey of parallel and distributed architectures and associated programming styles, an introduction to parallel and distributed algorithms, and a study of trade-offs between computation and communication in parallel processing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52970", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 421 with a C or better."}, {"Course": "CMSC 484", "Name": "Java Server Technologies", "Credits": "3", "Description": "This course is an in-depth look at several of the technologies currently in use to develop applications for the Web. Topics include the use of Java Servlets and Java Server Pages (JSP) and their benefits over traditional CGI programs, the development of web services using SOAP and XML, the use of Enterprise Java Beans to encapsulate server-side business logic and the use of application servers. Several programming projects will be done using these technologies and an appropriate Webserver, such as Apache Tomcat. In addition, several related technologies, such as PHP and Javascript, will be covered.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52971", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 202 or CMSC 202H with the grade of C or better."}, {"Course": "CMSC 486", "Name": "Mobile Radio Communications", "Credits": "3", "Description": "This course provides a technical introduction to mobile radio telephony. Topics include: the evolution of mobile radio communications, transforming signal representation between time and frequency domains, allocation and assignment of communication channels for cellular phones, signal modulation techniques and wireless networks. An in-depth study of the GSM and IS-95 CDMA cellular phone systems also will be presented.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52972", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMPE 313 or CMPE 212, MATH 152 with a C or better."}, {"Course": "CMSC 487", "Name": "Introduction To Network Security", "Credits": "3", "Description": "The objective of this course is to teach the fundamental concepts, architectures, and protocols related to network security. Topics covered include: Overview of network security; Basics of cryptography; Threat models; Authentication and Authorization Mechanisms and Standards; Public Key Infrastructure; Electronic Mail Security; Network Layer Security; Transport layer and web security; Packet filtering; Firewalls; Intrusion Detection, and Virtual Private Networks; Recent topics in Network Security.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52973", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "CMSC 421 or CMSC 481 with a C or better."}, {"Course": "CMSC 491", "Name": "Special Topics in Computer Science", "Credits": "3", "Description": "Special topics in computer science. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52975", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 341  or CMSC 341H  with a grade of C or better."}, {"Course": "CMSC 493", "Name": "Capstone Games Group Project", "Credits": "3", "Description": "The computer games capstone course is designed to allow students completing the computer science games track to engage in a complete group project development experience. This will help them to integrate the various technical concepts they have learned in earlier courses. The course aims to impart a foundation in team leadership and project management ability that will allow graduates to function effectively within multi-disciplinary teams.", "Grading": "Graded", "Course ID": "52976", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed CMSC 435 and CMSC 471 with a grade of C or better."}, {"Course": "CMSC 495", "Name": "Honors Thesis", "Credits": "3", "Description": "Under the supervision of a faculty advisor, students in the Computer Science Honors Program will write and submit a scholarly paper reporting on their senior project.", "Grading": "Graded/Pass Fail", "Course ID": "52977", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "CMSC 498", "Name": "Independent Study in Computer Science for CMSC Interns and Coop Students", "Credits": "3", "Description": "Consult the department Web page on CMSC 498 for more information.", "Grading": "Pass/Fail", "Course ID": "52980", "Consent": "Department Consent Required", "Components": "Independent Study"}, {"Course": "CMSC 499", "Name": "Independent Study in Computer Science", "Credits": "1", "Description": "A student may enroll in this course to study computer science topics that are not available in a regular course. The student and the faculty member supervising the independent study must determine the objectives of the project, the number of credits to be earned and the evaluation criteria for the project. Students are limited to two independent study courses in computer science. This course is repeatable for credit. Students may complete a maximum of 4 credits.", "Grading": "Pass/Fail", "Course ID": "52981", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must be Junior Standing"}, {"Course": "COMP 101", "Name": "Computational Thinking and Design", "Credits": "4", "Description": "Broad survey of the power, challenges, and specialties of computing fields. Topics include algorithmic problem solving, the design and development of computing solutions, human-centered computing, graphics and games, data management and exploration, hardware and systems, intelligent solutions, and academic and professional skills. Assumes no prior experience with computing. Restricted to those declared or considering a computing major (BTA, IS, CMSC, and CMPE). Intended to be taken in the first or second semester.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "52865", "Consent": "Department Consent Required", "Components": "Lecture, Discussion", "Course Equivalents": "COMP 101Y "}, {"Course": "COMP 101Y", "Name": "Computational Thinking and Design", "Credits": "4", "Description": "Broad survey of the power, challenges, and specialties of computing fields. Topics include algorithmic problem solving, the design and development of computing solutions, human-centered computing, graphics and games, data management and exploration, hardware and systems, intelligent solutions, and academic and professional skills. Assumes no prior experience with computing. Restricted to those declared or considering a computing major (BTA, IS, CMSC, and CMPE). Intended to be taken in the first or second semester.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102641", "Consent": "Department Consent Required", "Components": "Lecture, Discussion", "Course Equivalents": "COMP 101 "}, {"Course": "DANC 100", "Name": "Introduction to Contemporary Dance", "Credits": "3", "Description": "This course examines the principles, philosophies and choreographies of such pivotal figures in contemporary dance as Martha Graham, Merce Cunningham, Alvin Ailey, Doris Humphrey, Paul Taylor, Bill T. Jones, Rudolf von Laban, Mary Wigman and others through regular studio classes in dance technique, readings, lectures and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53134", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "DANC 101", "Name": "Dance Appreciation", "Credits": "3", "Description": "This course will introduce the student to the social and cultural genres of dance in present and past societies across the globe. It will compare them in terms of movement, practices and purpose. The student will learn what the roles of choreographers, dancers, musicians and audience are and how they differ across cultures.", "Grading": "Graded", "Course ID": "53135", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "DANC 106", "Name": "Introduction To Ballet", "Credits": "3", "Description": "This course examines both historic and contemporary beliefs in the context of performance through regular studio classes in classical technique, readings, lectures and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53138", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "DANC 110", "Name": "Beginning Contemporary Dance Techniques I", "Credits": "2", "Description": "First in a series of courses that emphasize the technical aspects of and growth of students’ skill in dance. This course is repeatable for credit. Students may complete a maximum of 4 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53139", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00"}, {"Course": "DANC 115", "Name": "Jazz Dance", "Credits": "2", "Description": "A high-energy movement class emphasizing proper dance technique, stylistic development and correct body alignment. All students are required to participate in a concert at the end of the semester. This course is repeatable for credit. Students may complete a maximum of 4 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53140", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 116", "Name": "Ballet I–Elementary Ballet", "Credits": "2", "Description": "First in a series of courses based on the study of classical technique. The emphasis at this level is on alignment and exposure to the basic movement vocabulary of ballet. No previous experience necessary. This course is repeatable for credit. Students may complete a maximum of 4 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53141", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00, Arts and Humanities (GFR)"}, {"Course": "DANC 125", "Name": "Musical Comedy Dance", "Credits": "2", "Description": "A survey of musical comedy dance with emphasis placed not only on proper technique, but also on performing style. Several types of theatre dance are explored during this course. All students are required to participate in a concert at the end of the semester.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53143", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 201", "Name": "Dance History I: Cultural and Classical Forms", "Credits": "3", "Description": "History of dance as a theater art form from ancient and primitive cultures through the 19th century. The course traces the development of ballet from the Renaissance and Baroque periods through Romanticism and the Russian classics. Movement classes to extend the understanding derived from reading, lectures, discussions and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53146", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "DANC 201H ", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR)"}, {"Course": "DANC 201H", "Name": "Dance History I: Cultural and Classical Forms Honors", "Credits": "3", "Description": "History of dance as a theater art form from ancient and primitive cultures through the 19th century. The course traces the development of ballet from the Renaissance and Baroque periods through Romanticism and the Russian classics. Movement classes to extend the understanding derived from reading, lectures, discussions and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100198", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "DANC 201 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must have been admitted to the Honors College to take this course."}, {"Course": "DANC 202", "Name": "Dance History II: Contemporary Forms", "Credits": "3", "Description": "History of dance from 1900 to the present. This course traces the development of modernism in dance from Isadora Duncan and the Diaghilev era to the avant-garde. Movement classes extend the understanding derived from reading, lectures, discussions and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53148", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "DANC 202H", "Name": "Dance History II -Honors", "Credits": "3", "Description": "History of dance from 1900 to the present. This course traces the development of modernism in dance from Isadora Duncan and the Diaghilev era to the avant-garde. Movement classes extend the understanding derived from reading, lectures, discussions and films.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53149", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "DANC 202 ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must be admitted to the Honors College."}, {"Course": "DANC 216", "Name": "Ballet II–Intermediate Ballet", "Credits": "2", "Description": "Continued study and refinement of classical technique. Students at this level must be competent at the beginning level and ready to perform longer and more complex movement phrases. This course is repeatable for credit. Students may complete a maximum of 8 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53153", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00", "Prerequisite/Corequisite": "You must have completed two semesters of DANC 116 before you can take this course."}, {"Course": "DANC 220", "Name": "Beginning Contemporary Dance Techniques II", "Credits": "2", "Description": "Second in a series of dance courses having to do with the technical aspect of and growth of students’ skill in dance. This course is repeatable for credit. Students may complete a maximum of 4 credits or 2 attempts. Recommended Preparation: DANC 110 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53154", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00"}, {"Course": "DANC 230", "Name": "Improvisation", "Credits": "2", "Description": "This course develops the student’s ability to generate movement through creative exploration of dance’s relationship to space, time, weight, energy, patterns, form, and non-traditional performance spaces. Through an increased awareness of the physicality of the body and its potential for movement expression, students expand their ability to invent and structure movement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53155", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "DANC 240", "Name": "Music for Dance", "Credits": "2", "Description": "Designed to develop essential music skills for performance, choreography, teaching dance, and communicating with musicians. Topics include: rhythm and meter, terminology, notation and other music-related skills, an overview of major composers and stylistic periods, with a special emphasis on the contemporary and modern periods of music and dance, and the relationship between music and choreography. Readings, lectures, listening, viewing, and in-class music/movement exercises combine to provide a breadth of experience that will expand and enhance knowledge about the myriad relationships between music and dance.", "Grading": "Graded/Audit", "Course ID": "100512", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC230 with a C or better."}, {"Course": "DANC 252", "Name": "Dance Production Lab", "Credits": "1", "Description": "An elective laboratory course designed to provide the student an opportunity to gain knowledge of lighting and sound for dance through contracted departmental projects. The number of credits assigned is determined by the instructor. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53156", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 260", "Name": "Introduction to African Dance", "Credits": "3", "Description": "Course offers an understanding of the role of dance in daily life in African societies. Types of African dance are distinguished; basic movements are identified, and relationship of dance to other African arts is shown.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50006", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AFST 215"}, {"Course": "DANC 275", "Name": "Introduction to Umfundalai Contemporary African Dance Technique", "Credits": "3", "Description": "This course introduces dance traditions of Africa and the Diaspora in a contemporary context. Umfundalai technique combines essential elements of traditional African dance with techniques and choreography of progenitor Dr. Kariamu Welsh, dance pioneers Katherine Dunham and Pearl Primus, and others.  Students learn Umfundalai movement concepts, vocabulary and choreography through embodied studio work supported by lectures, readings, films and percussion study. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Audit", "Course ID": "102776", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "DANC 110, DANC 116, DANC 216, DANC 220, DANC 260, DANC 310, DANC 316, DANC 320, DANC 410, or DANC 420 with a grade of “C” or better."}, {"Course": "DANC 280", "Name": "Performance Practicum", "Credits": "1", "Description": "Practical experience in rehearsing a dance for performance. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Students cast in projects for DANC 400 or DANC 460 should obtain permission to register for this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53157", "Consent": "No Special Consent Required", "Components": "Practicum", "Prerequisite/Corequisite": "You must be concurrently enrolled in DANC 216 or DANC 220 or DANC 310 or DANC 316 or DANC 320 or DANC 410 or DANC 416 or DANC 420. You must get a C or better in these classes."}, {"Course": "DANC 299", "Name": "Dance Denmark -Dance and Culture", "Credits": "3", "Description": "DANCE DENMARK is an intensive three-week long faculty-led study abroad program that foregrounds dance as a lens through which students learn about the cultural fabric of Denmark, community engagement and meaningful social change. The program consists of two key components: 1) Dance studies-embodied study of contemporary and urban dance forms; and 2) Danish culture immersion. The cultural component includes looking at the influence dance and other performance forms have on the rise and shaping of social democracy in Denmark; first experiences of Danish culture through authentic social exchange; and visits to historical and cultural sites.", "Grading": "Graded", "Course ID": "102692", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "DANC 301", "Name": "Special Studies in Dance", "Credits": "1", "Description": "Provides for workshops and clinics in particular techniques. The course may be organized in a series of three- to six week modules depending on the type of activity. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53159", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 310", "Name": "Intermediate Contemporary Dance Techniques I", "Credits": "3", "Description": "Third in a series of courses that emphasize the technical aspect of and growth of students’ skill in contemporary dance. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: DANC 220 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53160", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00"}, {"Course": "DANC 315", "Name": "Beyond Technique: The Body and Motion", "Credits": "3", "Description": "This course focuses on techniques that enable dancers to move with physical awareness, efficiency, and enhanced expressivity. Study of the musculoskeletal system will provide students with knowledge of sound skeletal alignment and principles or movement. The course will introduce students to a variety of alternative modalities and approaches to achieving personal movement goals and to move fully and successfully in traditional dance classes of any style. Students will learn techniques for moving with increased range of motion, energy, joint ease, and less muscular tension. Students will explore the use of breath and methods for increasing flexibility and strength.", "Grading": "Graded/Audit", "Course ID": "100513", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC 310 or DANC 216 with a C or better."}, {"Course": "DANC 316", "Name": "Ballet III - High Intermediate Ballet", "Credits": "2", "Description": "A study of advanced intermediate classical technique. Students must have a knowledge of ballet vocabulary and have demonstrated facility in ballet at the intermediate level. This course is repeatable for credit. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53162", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00", "Prerequisite/Corequisite": "You must have completed two semesters of DANC 216 before you can take this course."}, {"Course": "DANC 320", "Name": "Intermediate Contemporary Dance Techniques II", "Credits": "3", "Description": "Fourth in a series of courses that emphasize the technical aspects of and growth of students’ skill in contemporary dance. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: DANC 310 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53163", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00"}, {"Course": "DANC 325", "Name": "Dance and the Contemporary Arts", "Credits": "3", "Description": "The study of new directions in the visual and performing arts through the perspective of dance, focusing on contemporary artistic imperatives, the artistic process, and interrelationships among arts disciplines. Students develop writing skills for critical inquiry and analysis of the arts in purpose, process and performance. The course includes a sampling of works of contemporary art, drawing upon events such as: exhibits at the Center for Art, Design and Visual Culture, the AOK Library and local museums. On campus performances by Baltimore Dance Project and visiting Dance Companies, the UMBC music department, and guest musicians, the UMBC theater department and local theater company performances, guest lectures, and events like the Baltimore Transmodern Festival provide opportunities for experiencing live, contemporary performance.", "Grading": "Graded", "Course ID": "100514", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete DANC 202 and DANC 240 or VPA 225 with a C or better."}, {"Course": "DANC 330", "Name": "Dance Composition I", "Credits": "3", "Description": "This course introduces students to choreographic methods and processes for dance-making. Through studio work, readings, choreography assignments, discussions and critiques, students develop and hone choreographic skills that culminate in the creation of one or more choreographed dance studies by each student.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53165", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "DANC 331", "Name": "Dance Composition II", "Credits": "3", "Description": "A second course in choreographic methods and dance-making in which more complex structures and sequencing of movement are explored through studio work, discussion and reading, culminating in the creation of one or more dances by each student.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53166", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC 320 and DANC 330 with a C or better."}, {"Course": "DANC 335", "Name": "Projects in Choreography", "Credits": "1", "Description": "Required for dance majors. Each student will choreograph an original group work, usually 5-8 minutes in length, for an informal public presentation. Students complete the process of creating a dance piece from formulating a proposal for the work, conducting an audition, scheduling, preparing for, and conducting rehearsals, choosing music, and formulating a costume concept. This course is repeatable for credit. Students may complete a maximum of 3 credits or 3 attempts.", "Grading": "Graded", "Course ID": "53158", "Consent": "Department Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete DANC 230, DANC 310, and DANC 330 with a grade of ‘C’ or better."}, {"Course": "DANC 340", "Name": "Dance and Technology", "Credits": "3", "Description": "Practical experience in working with a variety of technologies related to dance documentation, choreography and performance. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53167", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC 320 and DANC 330 with a C or better."}, {"Course": "DANC 350", "Name": "Dance Workshop", "Credits": "2", "Description": "Planning, composition and presentation of dances and dance demonstration, intermediate level.  This course is repeatable for credit. Students may complete a maximum of 4 credits. Recommended Preparation: DANC 220 or DANC 230.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53168", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 356", "Name": "Studies in Ballet", "Credits": "2", "Description": "Studio work focusing on selected areas of ballet such as pointe, advanced allegro or a particular style of ballet. The specific area of study is announced each time the course is offered. This course is repeatable for credit. Recommended Preparation: DANC 216 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53169", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 390", "Name": "Dance Production Workshop", "Credits": "3", "Description": "This course is designed to develop skills in the preparation and performance of faculty choreography on an advanced level. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53170", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 399", "Name": "Dance Practicum", "Credits": "3", "Description": "Practical experience in the non-performing elements of dance production, including dance lighting, stage management, sound and public relations. Projects include student concerts and workshops. Recommended Preparation: DANC 350 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53171", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 400", "Name": "Independent Studies in Dance", "Credits": "1", "Description": "Independent Studies in dance. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: DANC 335 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53172", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "DANC 406", "Name": "Teaching Dance Techniques", "Credits": "3", "Description": "This course covers basic dance pedagogy and its application to both private studio and academic environments. Students will learn best dance teaching practices and how to create a safe and nurturing environment for dancers of all ages and abilities, through classroom demonstrations, readings, field observations, lesson plan design, and feedback on studio sessions. Topics include warm-up and cool down, progressive sequencing of skills, age appropriate content, the flow of the dance lesson, and giving effective corrections and feedback. Recommended Preparation: DANC 316 ", "Grading": "Graded/Audit", "Course ID": "102710", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC 320 with a ‘C’ or better."}, {"Course": "DANC 410", "Name": "Advanced Contemporary Dance Techniques I", "Credits": "3", "Description": "Fifth in a series of courses that emphasize the technical aspects of and growth of students’ skill in contemporary dance. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53173", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00", "Prerequisite/Corequisite": "You must have completed DANC 320 with a C or better before you can take this course."}, {"Course": "DANC 416", "Name": "Ballet IV - Advanced Ballet", "Credits": "2", "Description": "Studio work in classical ballet at the advanced level. Students must have demonstrated achievement at the high intermediate level. This course is repeatable for credit. Students may complete a maximum of 8 credits or 4 attempts. Note: Minimum of two semesters of DANC 316 required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53175", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $30.00"}, {"Course": "DANC 420", "Name": "Advanced Contemporary Dance Techniques II", "Credits": "3", "Description": "Sixth in a series of courses that emphasize the technical aspects of and growth of students’ skill in contemporary dance. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53176", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed DANC 410  with a C or better before you can take this course."}, {"Course": "DANC 425", "Name": "Special Topics in Dance Research", "Credits": "3", "Description": "This course is oriented around a specific topic to be chosen by the professor. Topics may range from a critical examination of the work of one or more noteworthy choreographers to the dances of a specific period in history. Topics will be published in the Schedule of Classes. Recommended Preparation: DANC 201 and DANC 202 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53177", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 426", "Name": "Methods of Teaching Dance", "Credits": "3", "Description": "Focuses on designing developmentally appropriate strategies for teaching dance techniques and creative movement to all age levels, with an emphasis on secondary education. The course will include defining objectives, constructing lesson plans and units, observations and practical experience.", "Grading": "Graded", "Course ID": "53164", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete DANC 230 and DANC 320 with a C or better."}, {"Course": "DANC 430", "Name": "Group Forms of Dance Composition", "Credits": "3", "Description": "Explorations in choreographing for two or more dancers. Studio work, videotaping, discussion, culminating in the creation of one or more dances by each student, presented in concert. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: DANC 330 and DANC 331 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53178", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 450", "Name": "Repertory", "Credits": "3", "Description": "Designed for advanced students, this course, often taught by the artist-in-residence, involves the preparation and performance of a challenging work of choreography. This may be through the mounting of an existing work or the premiering of a new work. This course is repeatable for credit. Students may complete a maximum of 12 credits or 4 attempts. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53179", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 460", "Name": "Performance and Production", "Credits": "4", "Description": "Planning and presentation of a major dance production, with emphasis on elements of performance. Advanced- level students enrolled in this course can expect to take the production on tour to two local high schools. This course is repeatable for credit. Students may complete a maximum of 8 credits or 2 attempts. Recommended Preparation: Two semesters of DANC 450  (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53180", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "DANC 475", "Name": "Senior Projects in Dance", "Credits": "3", "Description": "A course in which senior dance majors complete a project of substantial depth in the area of performance, choreography or research. Students meet in regular seminars to discuss and refine their proposals. Documentation and a rigorous analysis of each project is required. Recommended Preparation: DANC 202, DANC 331 and DANC 450.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53181", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ECAC 121", "Name": "Principles of Accounting I Practice Set", "Credits": "1", "Description": "This course reviews the accounting principle applications covered in ECON 121 using computerized practice sets. The course is an excellent review for transfer students and those students who wish to review accounting concepts and procedures before taking additional coursework in this area.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53264", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ECON 121 with a grade of C or better to take this course."}, {"Course": "ECAC 122", "Name": "Principles of Accounting II Practice Set", "Credits": "1", "Description": "This course reviews accounting principle applications covered in ECON 122 using computerized practice sets. The course is an excellent review for transfer students and those students who wish to review accounting concepts and procedures before taking intermediate-level coursework.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53266", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed ECON 122 with a grade of C or better to take this course."}, {"Course": "ECAC 200", "Name": "Survey of Accounting for Entrepreneurs", "Credits": "3", "Description": "The course is designed to meet the needs of non-accountants who want a basic understanding of financial statements and who want to learn how to use accounting information in the decision-making process. Topics will include organizational structure, financial reporting with an overview of the accounting cycle, cost management and management control. This survey course is designed for students who have not had previous accounting instruction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "53268", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "ECAC 300", "Name": "Special Topics in Accounting", "Credits": "3", "Description": "The study of a particular topic in the field of accounting. Students should refer to the course description, including any additional prerequisites, published in the schedule of classes. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100100", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Taxation of Business Entities", "Prerequisite/Corequisite": "You must have completed ECON 121 with a grade of C or better to take this course."}, {"Course": "ECAC 317", "Name": "Accounting Information Systems", "Credits": "3", "Description": "This course examines accounting systems concepts and technologies, transaction processing systems and the control of accounting information. The roles and uses of technology will be explored in regard to accounting systems design, financial and processing controls, performance evaluation and information security.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50061", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "IS 317 ", "Prerequisite/Corequisite": "You must have completed ECON 122 with a grade of C or better to take this course."}]