[{"Course": "JPNS 309", "Name": "Business Japanese", "Credits": "3", "Description": "Students acquire advanced oral and writing skills along with specific terminology used in a diverse range of business fields in Japan. In addition to language use, students learn proper business etiquette and culture in specific situations by role-playing, mock interviews, formal presentations, intensive reading and descriptive writing. They are also required to think critically about the relationship between practice and perspective in Japanese business culture.", "Grading": "Graded/Pass Fail", "Course ID": "102163", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete JPNS 301 or JPNS 302 with a grade of C or better"}, {"Course": "JPNS 319", "Name": "Japanese Translation", "Credits": "3", "Description": "This course prepares students for translating materials from Japanese into English. After learning translating techniques and terminology, students practice translating short documents covering many fields and disciplines. For their Final Project, they will choose a document in the discipline of their choice to translate.", "Grading": "Graded", "Course ID": "102264", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete JPNS 301  or JPNS 302  with a grade of C or better"}, {"Course": "JDST 100", "Name": "Introduction to Judaic Studies", "Credits": "3", "Description": "A survey of the Judaic experience and expression, including varieties of religious expression, philosophical issues, literary and artistic dimensions, the role of Jewish law and the contemporary status of Jewish intellectual activity.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55027", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "JDST 200", "Name": "Israel and the Ancient Near East", "Credits": "3", "Description": "A survey of the cultures of the ancient Near East including Assyria, Persia, and especially the development of ancient Judaism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50041", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "ANCS 200, RLST 201"}, {"Course": "JDST 201", "Name": "Judaism in the Time of Jesus and Hillel", "Credits": "3", "Description": "This course surveys the history of Judaism and the Jewish people from the onset of Hellenism through the second Jewish revolt against the occupation by the Roman Empire. This formative period in the history of Judaism, of early Christianity and of Jewish-Christian relations is interpreted in light of extant primary and secondary literary and archaeological sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50038", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "ANCS 220, RLST 202"}, {"Course": "JDST 230", "Name": "Introduction to the Jewish Bible (TaNaKH)", "Credits": "3", "Description": "An examination of the structure and content of the Jewish Bible (the Torah, the Prophets and the Writings). Topics include the Bible’s historical and socio-cultural background, translations, exegesis, and classical and contemporary commentaries. Recommended Preparation: JDST 100 or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55028", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "JDST 273", "Name": "History of the Jews in Modern Times, From the Middle Ages to1917", "Credits": "3", "Description": "Political and socioeconomic forces at work in Europe and within the Jewish community during this period. Hassidism and enlightenment, emancipation and reform. The French and Russian revolutions. Jewish existence in Eastern Europe. Zionism and Aliyah.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50160", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 273, RLST 273"}, {"Course": "JDST 274", "Name": "Contemporary Jewish History: 1917 to the Present", "Credits": "3", "Description": "Jewish civilization in the 20th century with attention to interwar years, the attempted destruction of European Jewry in World War II and the resistance of the Jews. Post-war issues are examined: including the Allies and the United Nations, the emergence of new centers in Europe and Israel, Jews in the former Soviet Union, Jewish identity struggle in America and post-Holocaust thought.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50147", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "HIST 274, RLST 274 "}, {"Course": "JDST 290", "Name": "Topics in Judaic Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55029", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Judaism &Christian Begin, Intro Jew Phil Thought, Topics In Judaic Studies, Jewish Interpretation, Jewish Great Books, Yiddish:Lang/Lit/Culture, Jewish American Lit, Images Of Jewish Women, Interpret The Torah, Intro Jewish Phil Tought, The Holocaust in American Memory, Jewish Detective Fiction, Women of the Hebrew Bible"}, {"Course": "JDST 310", "Name": "Modern Israel: The Land, Its People, Culture, and Society", "Credits": "3", "Description": "A multidisciplinary study of the historical background and current issues in the modern State of Israel. Topics may include physical and cultural geography; population demographics; immigration and absorption; religious and ethnic diversity; social and political structures; the economy and economic institutions, including the Kibbutz and Moshav; the Israeli educational system; and Israeli international relations.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55030", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "JDST 311", "Name": "Modern Israel in Film", "Credits": "3", "Description": "From its founding to the present, films (features and documentaries) about Israel have shaped public opinion and been molded by it. The course explores issues and problems addressed by these films and those that have been ignored. Recommended Preparation: JDST 100, JDST 274, JDST 310, or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55031", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GFR)"}, {"Course": "JDST 320", "Name": "Literature of the Holocaust", "Credits": "3", "Description": "An examination of the experiences of the Holocaust through works of poetry, drama, autobiography and/or the novel. Most of the selections relate the Holocaust as it was experienced after the writers translated those experiences into art, including film and video, making their personal tragedies into recognizable truths. Recommended Preparation: Junior standing or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55032", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "JDST 321", "Name": "Jewish Writing in World Literature", "Credits": "3", "Description": "This course will study the development of modern Jewish writing from its beginnings in the Yiddish works of Eastern Europe through its diasporic extension into Western Europe, North Africa, Latin America, North America and Israel. Special attention will be given to the analysis of Jewish humor, in literature as well as other cultural forms, from the novels of Sholom Aleichem to the films of Woody Allen. Jewish literary responses to the Holocaust also will be discussed. The course will emphasize the cross-cultural nature of Jewish diasporic writing in its attachment both to common Jewish traditions and to diverse national, historical, geographical and linguistic contexts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50179", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "MLL 321"}, {"Course": "JDST 323", "Name": "Modern Hebrew Literature", "Credits": "3", "Description": "A survey of various forms of Hebrew literature in English translation from throughout the world since the 19th century. In addition, modern Hebrew literature is compared to, and contrasted with, pre-modern Hebrew literature and Yiddish literature. Recommended Preparation: An English or world literature course in any language at the 200 level or above or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50178", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "MLL 323 "}, {"Course": "JDST 330", "Name": "Jewish Ethics", "Credits": "3", "Description": "An examination of the sources on Jewish ethics; Jewish ethical analyses of issues in medicine, business, sexual behavior and politics; Jewish approaches to dilemmas raised during the Holocaust. Recommended Preparation: JDST 100 or PHIL 150 or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55034", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "JDST 340", "Name": "Origins of Antisemitism", "Credits": "3", "Description": "The evolution of anti-Jewish sentiments in the pagan and later Christian world are examined, along with images of the Jew as evil, devil consort and Christ-killer, and the development and spread of myths about Jews, such as their involvement in well-poisonings, the blood libel and host desecration. Study of the changes in beliefs in the modern era includes analysis of how pseudoscientific race theories produced the modern phenomena of anti-Judaism and anti-Semitism.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55036", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP), Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "JDST 370", "Name": "History Of The Jews In The United States", "Credits": "3", "Description": "The history of the Jews in the United States from the earliest settlements to the present. The course focuses on political, economic, religious and cultural developments, anti-Semitism, and the rise of American Jewry to a position of leadership and responsibility in the world Jewish community. Special emphasis is placed on comparing and contrasting the American-Jewish historical experience with prior Jewish historical experiences in Europe. Recommended Preparation: One course in American or European history.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50167", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 370 "}, {"Course": "JDST 371", "Name": "The Jewish American Experience in Film", "Credits": "3", "Description": "This course explores the experiences of Jews in twentieth century America as portrayed in film through various themes that have helped to shape American Jewish identity. By examining cinematic representations in light of historical background, students will evaluate stereotypes and fictional images presented of Jews. Students will acquire critical movie-viewing skills as well as insight into the contemporary popular Jewish imagination. Recommended Preparation: HIST 102 or JDST 274 or JDST 370 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50169", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "HIST 377 "}, {"Course": "JDST 373", "Name": "History of the Holocaust", "Credits": "3", "Description": "An interdisciplinary examination of the attempted destruction of the Jews of Europe and their culture, as well as the persecution of others on the basis of physical and emotional disabilities, ethnicity, politics, religion and sexual orientation at the hands of the Nazis and their collaborators during WWII. The course will briefly survey the migration of Jews to Europe, the history of anti-Semitism and “scientific” racism, the circumstances in Europe that allowed the rise of the National Socialist movement and the pre-WWII Nazi policies of discrimination. It then will focus on the perpetrators, victims and bystanders of the “Final Solution” and conclude with an analysis of the legacy of the Holocaust. Recommended Preparation: Any 100-level Social Science course or junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50155", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 373H, JDST 373H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "JDST 373H", "Name": "History of the Holocaust", "Credits": "3", "Description": "An interdisciplinary examination of the attempted destruction of the Jews of Europe and their culture, as well as the persecution of others on the basis of physical and emotional disabilities, ethnicity, politics, religion and sexual orientation at the hands of the Nazis and their collaborators during WWII. The course will briefly survey the migration of Jews to Europe, the history of anti-Semitism and “scientific” racism, the circumstances in Europe that allowed the rise of the National Socialist movement and the pre-WWII Nazi policies of discrimination. It then will focus on the perpetrators, victims and bystanders of the “Final Solution” and conclude with an analysis of the legacy of the Holocaust. Recommended Preparation: Any 100-level Social Science course or junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100340", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": " HIST 373, JDST 373 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "JDST 390", "Name": "Topics in Judaic Studies", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55037", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "JDST 400", "Name": "Special Study or Project in Judaic Studies", "Credits": "1", "Description": "Tutorial or independent study, archival or empirical research, or field placement. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55040", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "JDST 410", "Name": "Dynamics of the Arab-Israeli Conflict", "Credits": "3", "Description": "The course starts with a focus on the development of the Arab-Israeli conflict from its beginnings in the period when Palestine was controlled by the Ottoman Empire. The growth of Arab nationalism and Zionism will be compared, as will the conflicting promises made by the British to both Zionists and Arab nationalists during World War I. Next is a review of British rule over both Arabs and Zionists during the Palestine Mandate. The second half of the course is an examination of the Arab-Israeli wars since 1948, the Camp David and Oslo peace processes, the Al-Aksa Intifadah and developments since then. The conflict is analyzed against the background of great powers intervention in the Middle East, and the dynamics of intra-Arab politics, political Islam and oil. Recommended Preparation: One of the following: JDST 274, JDST 310, POLI 280 or POLI 373 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50185", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "POLI 485 "}, {"Course": "JDST 463", "Name": "Jews, Christians and Muslims in the Middle Ages", "Credits": "3", "Description": "This course examines moments of contact and conflict between the three major monotheistic faiths of the medieval period: Judaism, Christianity, and Islam. Topics will include an examination of the scriptural foundations of the three faiths and their influence on topics such as law, violence, conversion, ritual, and legend. The course provides an overview of how individuals and leadership within the three faiths interacted with each other. Recommended Preparation: HIST 100 or HIST 110, or HIST 111 or JDST 100 or RLST 100 or 200-level course, and junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50151", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 463, RLST 463 "}, {"Course": "JDST 490", "Name": "Topics in Judaic Studies", "Credits": "1", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55041", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Arab-Israeli Conflict"}, {"Course": "KORE 101", "Name": "Elementary Korean I", "Credits": "4", "Description": "An introduction to Korean language and culture through a communicative approach. Language is learned in a thematic context based on real-life situations. Students will be introduced to the Korean alphabet, grammatical aspects and commonly used phrases in communicative situations. Aspects of everyday life, work and leisure activities and customs and traditions will also be introduced.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55051", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)"}, {"Course": "KORE 102", "Name": "Elementary Korean II", "Credits": "4", "Description": "This course is the continuation of KORE 101. More advanced grammatical concepts will be introduced. Emphasis is on intensive vocabulary building and the development of more complex speaking and writing skills within the context of real life situations. Cultural aspects will include an introduction to Korean business culture and Korea’s position in the world community.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55053", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete KORE 101 with a C or better before taking this class or have completed 2 years of high school Korean."}, {"Course": "KORE 201", "Name": "Intermediate Korean I", "Credits": "4", "Description": "This course is the continuation of the 101-102 sequence. Emphasis is on the communicative aspect. Students will not only use everyday spoken Korean, but will also be introduced to formal interaction in the language. Advanced grammar and short essay writing will also be stressed. In addition, students will be introduced to aspects of Korean culture in greater detail and will begin to read short authentic texts (literary and non-literary).", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55055", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete KORE 102 with C or better before taking this class or have completed 3 years of high school Korean."}, {"Course": "KORE 202", "Name": "Intermediate Korean II", "Credits": "4", "Description": "This course is the continuation of KORE 201. The course emphasizes advanced grammar instruction and vocabulary building and will focus on developing more complex speaking and writing skills. More complex authentic texts will be introduced to provide a deeper understanding of Korean culture from an intercultural perspective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55057", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "You must complete KORE 201 with a C or better before taking this class or have completed 4 years of high school Korean"}, {"Course": "KORE 300", "Name": "Special Projects in Korean Language", "Credits": "1", "Description": "Intensive individualized program of study in Korean language in an area determined by the student’s particular needs. This course is repeatable for credit. Students may complete a maximum of 9 credits. Recommended Preparation: KORE 201 or KORE 202. Note: Credits earned in KORE 300 may not be used to satisfy the basic requirements for any track in the MLLI major, minor or certificate of Korean studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLLI.", "Grading": "Graded/Pass Fail", "Course ID": "100678", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "KORE 301", "Name": "Advanced Korean I", "Credits": "3", "Description": "An advanced Korean language course in the four language skills (listening, speaking, reading, and writing) with focus on socio-cultural issues and current events. In addition to regular oral practice, the course will include such activities as formal presentations, intensive reading and some expository writing.", "Grading": "Graded", "Course ID": "100205", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed KORE 202 with a grade of C or better."}, {"Course": "KORE 302", "Name": "Advanced Korean II", "Credits": "3", "Description": "An advanced Korean language course in the four language skills (listening, speaking, reading and writing) with focus on socio-cultural issues and current events. In addition to regular oral practice, the course will include such activities as formal presentations, intensive reading and some expository writing.", "Grading": "Graded", "Course ID": "100259", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed KORE 301 with a grade of C or better."}, {"Course": "KORE 309", "Name": "Business Korean", "Credits": "3", "Description": "A further advanced Korean language course that emphasizes advanced oral skills in formal situations and specialized vocabulary used in a wide range of Korean business. Korean business etiquette and Korean customs and culture will also be taught. The course will include such activities as oral practices including formal presentations, intensive reading and expository writing.", "Grading": "Graded", "Course ID": "100260", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed KORE 301 or KORE 302 with a grade of C or better."}, {"Course": "KORE 310", "Name": "Korean Language in Social and Cultural Context", "Credits": "3", "Description": "An advanced Korean language course that deals with the content of Korean linguistics in relation to the culture and society. It will help students understand how language, culture, and society are interrelated. More specifically, students will study how the Korean language reflects and affects the culture and society by learning the history of the language, cultural terms, and other sociolinguistic aspects. This course will also help students extend their listening comprehension, speaking, and writing skills in Korean. Students will be trained not only to understand lectures, but also to participate in discussions and write short papers in Korean.", "Grading": "Graded", "Course ID": "100314", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP)", "Prerequisite/Corequisite": "You must have completed KORE 301 or KORE 302 with a grade of C or better."}, {"Course": "LATN 101", "Name": "Elementary Latin I", "Credits": "4", "Description": "Fundamentals of Latin. Students with two years of high school Latin continue their language in LATN 102.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55059", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "LATN 102", "Name": "Elementary Latin II", "Credits": "4", "Description": "Continuation of LATN 101.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55061", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed LATN 101 or two years high school Latin."}, {"Course": "LATN 201", "Name": "Intermediate Latin", "Credits": "4", "Description": "Review and reading selections from Caesar, Nepos, Florus, etc.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55063", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": " Must have completed LATN 102  with a C or better, or three years of High School Latin"}, {"Course": "LATN 301", "Name": "Selections from Roman Historians", "Credits": "3", "Description": "Caesar, Sallust, Livy and Tacitus. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55065", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 302", "Name": "Roman Comedy Selections from Plautus and Terence.", "Credits": "3", "Description": "Selections from Plautus and Terence. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55066", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": " Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 311", "Name": "Roman Poetry: Catullus, Horace", "Credits": "3", "Description": "The lyric temper in Roman poetry. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55067", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 312", "Name": "Silver Age", "Credits": "3", "Description": "Selections from prose and poetry in the era from Tiberius to Hadrian. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55068", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 321", "Name": "Prose Composition and Grammatical Review", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55069", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 331", "Name": "Tibullus, Propertius, Ovid", "Credits": "3", "Description": "Elegy in the age of Augustus. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55070", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent"}, {"Course": "LATN 332", "Name": "Vergil", "Credits": "3", "Description": "Readings in the Eclogues, Georgics and Aeneid. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55071", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 341", "Name": "Cicero", "Credits": "3", "Description": "The life and writings of Cicero. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55072", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 383", "Name": "History of Roman Literature I", "Credits": "3", "Description": "Lectures and assigned readings on the development of Roman literature. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55073", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 384", "Name": "History of Roman Literature II", "Credits": "3", "Description": "Continuation of LATN 383. This course is repeatable for credit. Students may complete a maximum of 15 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55074", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)", "Prerequisite/Corequisite": "Must have completed LATN 201 or Equivalent with a C or better."}, {"Course": "LATN 390", "Name": "The Teaching of Latin", "Credits": "3", "Description": "Intended for students preparing to teach Latin.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55075", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LATN 396", "Name": "Independent Reading in Latin", "Credits": "1", "Description": "This course is repeatable for credit. Students may complete a maximum of 15 credits. Recommended Preparation: LATN 201", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55076", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "LATN 402", "Name": "Special Author Seminar", "Credits": "3", "Description": "The author to be studied will be assigned by the instructor. This course is repeatable for credit. Students may complete a maximum of 15 credits. Recommended Preparation: LATN 201 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55077", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LAS 120H", "Name": "Introduction to the Arts I", "Credits": "3", "Description": "The course is an introductory overview of contemporary art making processes for Linehan Artist Scholars. Students participate in workshops with professional and faculty artists, attend exhibitions and performances and collaborate on art-making projects.", "Grading": "Graded", "Course ID": "100130", "Consent": "Instructor Consent Required", "Components": "Lecture"}, {"Course": "LAS 121H", "Name": "Introduction to the Arts II", "Credits": "3", "Description": "The course is an introductory overview of contemporary art making processes for Linehan Artist Scholars. Students participate in workshops with professional and faculty artists, attend exhibitions and performances and collaborate on art-making projects.", "Grading": "Graded", "Course ID": "100131", "Consent": "instructor Consent Required", "Components": "Lecture"}, {"Course": "LAS 300", "Name": "Collaborative Projects in the Arts", "Credits": "1", "Description": "This course focuses on the creation of collaborative, inter-disciplinary visual and performing artworks. The course provides a platform for students to form a collaboration team (in at least two arts disciplines) to design and pursue a rigorous art-making process that leads to the completion of an inter-disciplinary artwork for presentation. Participants will meet on a regular basis to plan, rehearse, discuss and reflect on their creative processes. Students must submit a proposal in writing and specify the number of credits sought. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: LAS 121H or permission of the instructor. Sophomore, Junior or Senior standing.", "Grading": "Graded", "Course ID": "102105", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 190", "Name": "The World of Language: Structural and Biological Aspects", "Credits": "3", "Description": "Language as a distinctive characteristic of the human species. In this course, we examine the structure of both written and spoken forms of language across cultures, comparing them with animal communication and human gestural systems. We explore language’s neurological basis, theories of origin, and first- and second-language learning.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50095", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "MLL 190H ", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "ENGL 190, MLL 190 "}, {"Course": "LING 191", "Name": "The World of Language: Cultural and Social Aspects", "Credits": "3", "Description": "Language as both a reflection and a determiner of social relationships. In this course, we examine the varying idioms of the scientist, the politician, the media, the poet, the child and the magician, and we investigate how language changes and how it marks social groups. Communication strategies and social taboos reflected in language are discussed for various cultures. Although this course continues work begun in The World of Language I, it is designed so that students can easily enter MLL 191 without having taken MLL 190.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50073", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Arts and Humanities (GFR), Culture (GFR)", "Same as Offered": "ENGL 191, MLL 191 "}, {"Course": "LING 210", "Name": "Introduction to Language Structures", "Credits": "3", "Description": "An introduction to the relationship between form and meaning across languages and basic notions in phonology, morphology, syntax and semantics. Practical exercises are drawn from a variety of languages. This course and LING 290 are designed as gateway courses to the applied linguistics major.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55085", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "LING 220", "Name": "Survey of Traditional Grammar", "Credits": "3", "Description": "A survey of traditional grammar from a linguistic perspective, with focus on the properties of various languages. Topics include the parts of speech (lexical categories), sentence structure, word order, grammatical relations (subject, object, indirect object), thematic relations (agent, patient, theme, goal), case assignment (nominative, accusative, dative, instrumental), tense, mood, aspect, voice, concord and anaphora.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55086", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 230", "Name": "World Language Communities", "Credits": "3", "Description": "A course designed to expand the cultural awareness of students by introducing them to the study of language in a broad context of historical, political and social issues. Special emphasis is placed on the question of bi- or multi-lingual states and on the explosiveness of the language issue in many regions. Taught in English.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50198", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "MLL 230"}, {"Course": "LING 280", "Name": "Studies in General Linguistics", "Credits": "3", "Description": "This course provides an examination of specific issues in general linguistics, with special reference to various languages (including English) and their dialects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55089", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 290", "Name": "Introduction to Applied Linguistics", "Credits": "3", "Description": "A survey of the many areas in which the study of language intersects with the analysis of social and psychological issues. Readings and discussions on language learning and processing, bilingualism, attitudes toward language varieties, language planning and the structure of everyday conversation.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55090", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 300", "Name": "Special Projects in Linguistics", "Credits": "1", "Description": "A directed reading course on an agreed-upon topic. A critical review-of-the-literature term paper is required. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Two LING courses relevant to the project, including at least one course at the 300 level.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55091", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "LING 310", "Name": "Phonology and Morphology", "Credits": "3", "Description": "A survey of sound systems, phonological and morphological processes across a range of languages. The principles of modern phonology and morphology are examined, and phonological and morphological data are analyzed and interpreted within those principles.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55093", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete LING 210 with a grade of C or better."}, {"Course": "LING 320", "Name": "Syntax", "Credits": "3", "Description": "The principles of the scientific description of sentences within the framework of generative grammar. Strong emphasis on the analysis of linguistic data, formulation of hypotheses and scientific argumentation, with special reference to English and other languages.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55094", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete LING 190 and LING 210 both with a C or better before you can take this course."}, {"Course": "LING 330", "Name": "Language in Context", "Credits": "3", "Description": "An examination of the principles that govern language use. This course studies linguistic performance issues, particularly the ways in which context influences the shape and meaning of utterances. Pragmatics, discourse analysis, and conversation analysis provide the theoretical orientations for an in-depth examination of language in action. Students will complete an original research paper. Recommended Preparation: MLL 301 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55095", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  MLL 190 with a C or better."}, {"Course": "LING 350", "Name": "Historical Linguistics", "Credits": "3", "Description": "An investigation of various aspects of language change over time, relatedness between languages, the reconstruction of earlier stages of a language, and the factors, both internal and external, that motivate language change.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55096", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete  LING 210 with a grade of C or better before taking this class."}, {"Course": "LING 360", "Name": "Sociolinguistics and Dialectology", "Credits": "3", "Description": "Language varieties in their relation to social structures. Geographical and social dialects. Attitudes toward language diversity. Bilingualism and language situations in the world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55097", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete either LING 190 or LING 191 or LING 210 with a grade of C or better before taking this class."}, {"Course": "LING 380", "Name": "Studies in Linguistics", "Credits": "3", "Description": "This course focuses on specific issues in a linguistic subfield (e.g., morphophonemics, language and cognition), with special reference to various languages (including English) and their dialects. Recommended Preparation: One LING course at the 200-level or above and permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55099", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 390", "Name": "Linguistic Typology", "Credits": "3", "Description": "This course investigates the crosslinguistic distribution of structural properties in phonology, morphology, syntax, and lexicon, in terms of absolute and non-absolute universals as well as implicational universals: what properties do languages share and what is the extent of structural diversity. Motivations for crosslinguistic structural preferences are considered, as well as typological change over time.", "Grading": "Graded", "Course ID": "055100", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed LING 310 and LING 320 with a grade of ‘C’ or better."}, {"Course": "LING 400", "Name": "Advanced Special Projects in Linguistics", "Credits": "1", "Description": "A directed reading- and research-oriented course on an agreed-upon topic. A theory-significant and original term paper is required. This course is repeatable for credit. Students may complete a maximum of 6 credits. Recommended Preparation: Two LING courses relevant to the project including at least one LING course on the 400 level.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55101", "Consent": "Instructor Consent Required", "Components": "Independent Study"}, {"Course": "LING 401", "Name": "Pragmatics", "Credits": "3", "Description": "The course investigates the linguistic and semiotic underpinnings of human communication: the sorts of structuring that communicative codes themselves impose on interaction, the social constraints within which human communication operates and the role context plays in understanding the complexities of discourse.", "Grading": "Graded", "Course ID": "102629", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MLL 301 and LING 210 with a ‘C’ or better."}, {"Course": "LING 410", "Name": "Language Planning", "Credits": "3", "Description": "This course examines the language planning choices that have been made in a variety of multilingual settings in the world, with particular reference to the role of ethnic or national identity. It also identifies the impact of those choices on the political, cultural, educational and socioeconomic domains.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55104", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete MLL 230 or LING 290 or LING 360 with a grade of C or better."}, {"Course": "LING 450", "Name": "Workshop in Applied Linguistics", "Credits": "3", "Description": "A linguistic investigation of the structure of several uncommonly-taught languages. Students elicit language data from native-speaker informants, construct a corpus of data in IPA transcription, and analyze the data linguistically, applying principles acquired in previous LING courses.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55105", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Workshop In Applied Ling, Workshop Applied Ling, Applied Linguistics", "Prerequisite/Corequisite": "You must complete LING 310  and LING 320  both with a grade of C or better."}, {"Course": "LING 470", "Name": "Language and Cognition", "Credits": "3", "Description": "This course examines the implications of current linguistic theory and research for first- and second-language acquisition, language disorders, aphasia studies and speech therapy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55106", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed LING 310 and LING 320 both with a grade of C or better."}, {"Course": "LING 480", "Name": "Advanced Studies in Theoretical Linguistics", "Credits": "3", "Description": "This course provides an in-depth examination of specific issues in either general or subfield-specific linguistic theory, with special reference to various linguistic phenomena observable in different languages, including English. A theory-significant and original term paper is required. Recommended Preparation: Two LING courses at the 300- or 400-level and permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55107", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "LING 490", "Name": "Seminar in Applied Linguistics", "Credits": "3", "Description": "This course is centered around advanced research on a particular applied linguistics topic. Students are expected to give frequent oral reports and complete work on a theory-significant and original term paper. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "55109", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed two LING courses at the 300 or 400 level with a grade of C or better."}, {"Course": "LING 499H", "Name": "Honors Paper in Linguistics", "Credits": "3", "Description": "Original research on a linguistics topic, under the supervision of a linguistics faculty member. The research will result in an extended paper, to be presented orally before an examining committee that includes the student’s research advisor and another linguistics faculty member. Students should consult with their linguistics advisor regarding eligibility and details.", "Grading": "Graded", "Course ID": "55113", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Your academic level must be senior to enroll."}, {"Course": "MGMT 210", "Name": "The Practice of Management", "Credits": "3", "Description": "The study of the role of the manager in leading and controlling organizations ranging from small entrepreneurships to large corporate environments. Topics will include management theories, corporate culture, goal-setting and measuring performance. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053281", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "MGMT 310", "Name": "Human Resource Management", "Credits": "3", "Description": "Examination and review of human resource management and of resource materials in the field. Examination of human resource policies as dictated by legal and cultural constraints and traditions within the organization. May include extensive use of case studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053284", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MGMT 210 or ECAD 210 with a C or better."}, {"Course": "MGMT 360", "Name": "Business Law", "Credits": "3", "Description": "A study of legal principles and laws that affect business activities. Topics include foundations of law and organization of the legal system. Additionally, the course will focus on legal issues involving business organizations, business torts and crimes, as well as the common law topics of contracts, property law, warranty, liability and intellectual property issues. The course also will include legal issues involved in competition, marketing and employment. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053286", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed  MGMT 210 or ECAD 210 with a C or better."}, {"Course": "MGMT 385", "Name": "Business Ethics & Society", "Credits": "3", "Description": "Study of the standards of business conduct and the role of business in society with consideration of the sometimes conflicting interests of the firm and society. The course will survey applied topics relating to business ethics, including corporate social responsibility, the relationship of law and ethics, and the ethical decision-making process.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053291", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed  MGMT 210 or ECAD 210 with a C or better."}, {"Course": "MGMT 399", "Name": "Administrative Internship", "Credits": "1", "Description": "This course provides the student with an opportunity to obtain training and experience in positions related to management or administration. The course may include on-the-job training, as well as directed reading and research. The course grade will depend on reports that demonstrate the student’s professional development and on the instructor’s evaluation (which may be based in part on information provided by the supervisor) of the student’s internship performance. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Pass/Fail", "Course ID": "053293", "Consent": "Department Consent Required", "Components": "Practicum", "Prerequisite/Corequisite": "MGMT 210 "}, {"Course": "MGMT 410", "Name": "Operations and Supply Chain Management", "Credits": "3", "Description": "This course presents a balanced approach to the interrelationship between operations, planning, and supply chain management in the service and manufacturing industries.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053294", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MGMT 210 with a C or better."}, {"Course": "MGMT 425", "Name": "Marketing", "Credits": "3", "Description": "An inquiry into the theory and practice of marketing. Consideration is given to methods of analysis and prediction of demand and marketing costs.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053295", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete ECON 101 and ECON 102 and ECON 121 and ECON 122 with a C or better"}, {"Course": "MGMT 489", "Name": "Seminar on Management in Business", "Credits": "3", "Description": "This class explores methods of revenue generation and supporting systems in technology-focused businesses with an emphasis on electronic commerce business development, maintenance and expansion. Both business-to-consumer and business-to-business aspects of management will be covered with an emphasis on products and services in electronic marketplaces. It reflects the current research in technology companies with special emphasis on e-commerce activities. Customer service, selling services and goods, customer relationship management and more are emphasized. The business method and revenue generation strategy of a leading company is analyzed in each week’s class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "053296", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "MGMT 210 with a grade of ‘C’ or better."}, {"Course": "MGMT 498", "Name": "Special Topics in Management", "Credits": "1", "Description": "This course will provide students with a survey of gaming and gambling technologies and venues now available in the marketplace. Topics covered include casinos, racinos, lotteries, internet, etc., with particular attention paid to management, marketing, advances in technology as well as social and economic issues. This course is repeatable for credit.", "Grading": "Graded/Pass Fail", "Course ID": "100250", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AGNG 100", "Name": "Aging and the Longevity Economy", "Credits": "3", "Description": "This course explores an aging population, both globally and in the United States. Historical, cultural and socioeconomic factors that shape the experience of aging will be addressed. Implications of this demographic wave for the creation of the longevity economy, a new social and entrepreneurial landscape, are discussed. Students will apply this multidimensional analysis to past and future cohorts to understand the revolutionary nature of an aging population what this means to each of us.", "Grading": "Graded", "Course ID": "52104", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AGNG 100Y ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "AGNG 100Y", "Name": "Aging and the Longevity Economy", "Credits": "4", "Description": "This course explores an aging population, both globally and in the United States. Historical, cultural and socioeconomic factors that shape the experience of aging will be addressed. Implications of this demographic wave for the creation of the longevity economy, a new social and entrepreneurial landscape, are discussed. Students will apply this multidimensional analysis to past and future cohorts to understand the revolutionary nature of an aging population what this means to each of us.", "Grading": "Graded", "Course ID": "100016", "Consent": "Department Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "AGNG 100 ", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "AGNG 110", "Name": "Growing Older in a Technological World", "Credits": "3", "Description": "This course will introduce students to aging with supporting technology, as a social, cultural and economic phenomenon that has shaped the lives of those entering their later years, as well as an enabler to improve and enhance quality of life for aging communities. Real-world devices and applications are utilized to cover topics such as social media and connection, smart home, wearables, telehealth, gaming, assistive tech, robots, and tech support senior drivers. Recommended Preparation: Any AGNG course and any IS course or CMSC course or COMP 101 with a ‘C’ or better", "Grading": "Graded", "Course ID": "102902", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AGNG 200", "Name": "Aging People, Policy and Management", "Credits": "3", "Description": "Based in the life-course perspective, this course blends academic analysis of human aging in social context with more experiential learning, including exposure to literature on older adults, awareness exercises about aging in the news and talking with older adults in and out of class to debunk common myths and stereotypes regarding aging and older adults. Academic content is broadly social, in terms of understanding family and community contexts of aging, the individual experience of aging including productivity, spirituality and typical engagement, normal changes and diseases common in physical and psychological health, and a focus on how society views aging. Finally, students will be encouraged to identify themselves as aging individuals, on a trajectory toward later life.", "Grading": "Graded/Pass Fail", "Course ID": "52105", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "AGNG 200Y ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "AGNG 200Y", "Name": "Aging People, Policy and Management", "Credits": "4", "Description": "Based in the life-course perspective, this course blends academic analysis of human aging in social context with more experiential learning, including exposure to literature on older adults, awareness exercises about aging in the news and talking with older adults in and out of class to debunk common myths and stereotypes regarding aging and older adults. Academic content is broadly social, in terms of understanding family and community contexts of aging, the individual experience of aging including productivity, spirituality and typical engagement, normal changes and diseases common in physical and psychological health, and a focus on how society views aging. Finally, students will be encouraged to identify themselves as aging individuals, on a trajectory toward later life.", "Grading": "Graded/Pass Fail", "Course ID": "100132", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "AGNG 200 ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)"}, {"Course": "AGNG 298", "Name": "Special Topics in Management of Aging Services", "Credits": "3", "Description": "This course addresses special topics in the area of aging services for lower-level students, without substantial background. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57341", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Strength Based Approaches to Promoting Health"}, {"Course": "AGNG 300", "Name": "Introduction to Policy and Aging Services", "Credits": "3", "Description": "This course introduces students to the policy making process and the resultant services and products that affect older persons. Social and economic foundations of policy, the role of government and interest groups, basics of policy analysis, legal and ethical considerations are examined. The current aging services network and the service and business opportunities needed to meet the needs of aging persons now and in the future are viewed as they are affected by the nature of the aging cohorts, the essentials of policy development, and electoral politics.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57342", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AGNG 200 "}, {"Course": "AGNG 301", "Name": "Intermediate Policy Analysis for Aging Issues", "Credits": "3", "Description": "A continuation of AGNG 300, this course emphasizes the further exploration and application of policy tools and processes. Field trips will exhibit first hand governmental policy processes as well as the relevance of current policy issues and application in the private sectors. Through these visits students will witness programs in action and gain perspectives of participants, program staff and managers about the challenges and rewards of community programs at work. The course will focus student discussion and debate on a range of current aging service policy issues including entitlements, housing, human resources (care-givers), end-of-life, retirement and pensions and community service.", "Grading": "Graded", "Course ID": "100183", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Completion of AGNG 300 "}, {"Course": "AGNG 310", "Name": "Introduction to the Management of Aging Services", "Credits": "3", "Description": "The objective of this course is to provide students with a fundamental understanding of the unique challenges inherent in managing aging services organizations, and to learn the aging services manager’s role in planning, organizing, staffing, leading, and evaluating. The course uses practical applications to enable students to apply the fundamental principles of both project management and transactional management in an aging services environment, as well as, in understanding the challenges and contemporary issues facing the 21st century manager in aging services organizations. Students will be exposed to the hierarchy of management competencies, and be prepared to make the transition to entry level management positions in aging services while learning how to effectively manage people, understanding how to create a strategic management framework to capture and grow an organization to its full potential. This course reviews a variety of organizational management issues, as they are unique in the aging services sector, such as organizational performance, organizational culture, management theories, and reviews a number of quality assessment tools.", "Grading": "Graded", "Course ID": "100444", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "AGNG 311", "Name": "Intermediate Management of Aging Services", "Credits": "3", "Description": "The objective of this course will build on AGNG 310, and provide students with an intermediate level, practical, evidence based perspective of management in an aging services organization. The course will provide an opportunity for students to build and expand on the introductory theory and practice course by applying their management competency and philosophy to learn about organizational culture, staffing, leadership, and evaluation skills in an aging services environment. The course will develop the students’ practical application, critical thinking and analytical skills involving complex aging services management issues, including change management, project management, managing a multicultural aging services organization, transactional management, and the unique challenges of the 21st century manager in today’s aging services organizations. Students will be exposed to core management theories as they apply to the aging services sector, including: building a learning organization, effective change management, handling conflict management, management by objectives, total quality management, and organizational performance management. Students will become knowledgeable in practicing and applying these theories to critical matters as managers and leaders will foresee themselves in the future in aging services organizations.", "Grading": "Graded", "Course ID": "100483", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "Completion of AGNG 310 "}, {"Course": "AGNG 315", "Name": "Health and the Aging Process", "Credits": "3", "Description": "This course provides an introduction to the biological processes of aging as a normal life experience. We will study multidisciplinary perspectives of the aging process; biological, psychological, social, and health care systems. This course will highlight optimal aging, the diversity of the older adult population and the aging process/experience of aging, and the plasticity of the aging process. Factors that serve to promote health aging and accelerate or decelerate the aging process will be identified. Recommended Preparation: AGNG 200 ", "Grading": "Graded", "Course ID": "102860", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Science (non-lab) (GEP)"}, {"Course": "AGNG 320", "Name": "Strength-Based Approaches to Promoting Health and Wellness in the Aging Services", "Credits": "3", "Description": "This course introduces students to primary, secondary, and tertiary levels of disease prevention and successful aging in older adults along the long term care continuum. Students will learn about the health promotion programs in the community and in long term care settings. They acquire an understanding of the different levels of disease prevention to promote neurosensory, musculoskeletal, and cardiovascular health in older adults in the community and in long term care settings. In addition, students will learn about health assessment, influencing health behavior change (especially nutrition and physical activity), organizational change to support primary, secondary and tertiary prevention in long term care settings, and promoting well-being at end of life.", "Grading": "Graded", "Course ID": "100436", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)"}, {"Course": "AGNG 321", "Name": "Strength-Based Approaches to Achieving Mental Wellness in the Older Adult", "Credits": "3", "Description": "AGNG 321 is designed for students who are interested in leading innovation and change in mental health and wellness among the older adult population and from a lifespan perspective. This course provides a broad overview of mental health and factors that impact mental health promotion and wellness in older adults. AGNG 321 prepares students in creating strength-based programs and services to achieve mental wellness using the older adult’s existing skills, resources, and adaptive capacities. Recommended Preparation:  AGNG 200 (Fall)", "Grading": "Graded", "Course ID": "100484", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "Complete ENGL 100 with a grade of ‘C’ or better."}, {"Course": "AGNG 351", "Name": "Business Decision Making for Aging Services", "Credits": "3", "Description": "The course develops a knowledge base sufficient to allow students to both appreciate and become conversant with the application of basic individual and business-related decision making skills to issues facing all individuals especially older adults as well as organizations engaged in the provision of aging services. Through a case study approach based firmly in aging services, it surveys a range of topics including economic behavior (motivation), marginal analysis, the market forces of supply & demand, illustrations of market failure, the mechanics of profit maximization, the time value of money and personal financial strategies to cope with the predicted sea changes resulting from the aging of the population.", "Grading": "Graded", "Course ID": "100969", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete AGNG 200 "}, {"Course": "AGNG 355", "Name": "The Experience of Dementia", "Credits": "3", "Description": "This course will provide an overview of Alzheimer’s disease and other forms of dementia using person-centered philosophy. The experience of dementia will be explored from the perspectives of the person diagnosed, family members and friends and informal and formal caregivers. Students will gain a holistic insight into these disorders and their implications for both individuals and communities. The foundational concept of this course will be the personhood of those diagnosed and living with dementia. Recommended Preparation: AGNG 100 or AGNG 200.", "Grading": "Graded", "Course ID": "102736", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}]