[{"Course": "HIST 349", "Name": "Citizen Soldiers: American Veterans from the Civil War to the War on Terror", "Credits": "3", "Description": "This is an interdisciplinary course situated at the intersection of American foreign policy, public policy, and public history. The course explores veterans’ experiences returning from war or leaving the military, the transition into civilian life, and the history of the Department of Veterans Affairs. The course will place particular emphasis on returning veterans of the Civil War, World War Two, Vietnam, and post-9/11 conflicts, as well as other conflicts and peacetime issues. Recommended Preparation: HIST 102 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102480", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 350", "Name": "History of Medicine", "Credits": "3", "Description": "This class will examine the History of Medicine through the lens of the physician¿s evolving professional role.Students will examine the doctoring profession from the colonial period onward. They will learn about how physicians have interacted with public health reformers and government policy makers. And they will look at how groups with less power¿patients, alternative medical practitioners, immigrants, women, and minorities have interacted with the health system. Recommended Preparation: 100 or 200 level SS course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54675", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 352", "Name": "Environmental History", "Credits": "3", "Description": "This course offers an introduction to the specific approaches of environmental history and the historical relationship between the human and nonhuman world. We will analyze changing ideas about the natural world, the history of the environmental movement, how modern societies have shaped the natural world, and how the natural world has in turn impacted history. Recommended Preparation: Lower level SS course. (Fall/Spring)", "Grading": "Graded", "Course ID": "102918", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "HIST 354", "Name": "West African History", "Credits": "3", "Description": "History of West Africa from the period of the medieval empires through the era of the slave trade, the revolutionary 19th century, colonial rule and independence. Recommended Preparation: AFST 211 or AFST 212 or HIST 242 or HIST 243, or permission of instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50021", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Same as Offered": "AFST 312 ", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "HIST 355", "Name": "Selected Topics in History", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Any 100-level social science course, junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54680", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 356", "Name": "Special Topics in U.S. History", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Any 100-level Social Science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100469", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 358", "Name": "Art and Society in the Renaissance", "Credits": "3", "Description": "An analysis of the relationship between the art of the Renaissance and its social and economic background. The course traces the development of Renaissance art, changes in style and content, and the emergence of new art forms. It focuses on the social characteristics of artists and patrons, the organization of the arts, their status and function, and the evolution of an art market.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54683", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 360", "Name": "Islam in Africa", "Credits": "3", "Description": "This course is presented to provide the student with an introduction and overview of the history of Islam in Africa. This requires a discussion of Islam itself, its origins, philosophical thought, praxis and expansion. We then will turn to a more detailed examination of the penetration of Islam in Africa, eventually concentrating on its sub-Saharan influences. Recommended Preparation: AFST 211 or AFST 212 or HIST 242 or HIST 243.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50013", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "AFST 314, RLST 314 "}, {"Course": "HIST 361", "Name": "The French Revolution", "Credits": "3", "Description": "The French Revolution from its origins in feudal, aristocratic society to the revolutionary wars and Napoleonic era. The European reaction to the revolution is examined as is its relationship to the contemporaneous American Revolution. The decline of Court society and values and their replacement by a democratic society are central issues. Two outstanding historical movies are part of the course. Recommended Preparation: Any 100-level Social Science course or junior/ senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54685", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 362", "Name": "The Medieval Mediterranean", "Credits": "3", "Description": "This course considers the medieval Mediterranean as an historical space and traces the development of the Latin West, Byzantium, and the Islamicate world within the Mediterranean frame. The course covers themes of conflict and coexistence, the movement of bodies and goods, and the lives of religious and ethnic minorities, while seeking to understand how Jews, Christians, and Muslims interacted with and reacted to each other. Students will learn how the legacy of medieval Mediterranean thinking about difference shaped European encounters with non-European cultures.  Recommended Preparation: HIST 110, or HIST 111.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54733", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 363", "Name": "The Crusades", "Credits": "3", "Description": "The Crusades is a study of peace and war in the middle ages. This course will examine medieval society at the time of the crusades, including society in Byzantium and in Islamic territories; we will examine and analyze the development of the idea of crusading, and how the crusades permanently changed the political and social structure of Europe, the Balkans, and the Middle East. Students will read both primary and secondary sources. Recommended Preparation: Any 100-level Social Science course (this is the same recommendation for all 300-level History courses)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101749", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 364", "Name": "The Rise of Islam", "Credits": "3", "Description": "This course explores the origins and development of the culture and society of Islam, a community that today represents over 1.2 billion people. We will examine Islam’s genesis in central Arabia in the sixth century, its expansion into the Mediterranean basin and east to India, and its main intellectual and philosophical currents. The course ends with the rise of the Ottoman Empire, the Islamic “superpower” that lasted until the 20th century. Recommended Preparation: Any 100 or 200 level SS course", "Grading": "Graded", "Course ID": "101747", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 365", "Name": "War in the Modern World", "Credits": "3", "Description": "This course will examine the evolution of modern European warfare from the Middle Ages up to the First World War. The class will focus on connections between the evolution of warfare (e.g. weapons, equipment, tactics) and social, political and economic development; dominant or repeating trends in modern warfare; and connections between warfare and science and technology. Recommended Preparation: 100 or 200 level SS course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54686", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "HIST 366", "Name": "Doin’ It: Case Studies in the History of Western Sexuality", "Credits": "3", "Description": "This course will explore how sexuality works in Western history. We will work with the contention that sexuality, along with connected notions of masculinity and femininity, are largely social constructions, and have been the object of intense social scrutiny and political regulation. We will investigate sexual desire and behavior, and sexual and gender ideologies, and will explore how they relate to a variety of topics such as race, marriage, reproduction, same-sex relations, religion, and the politics of state building. Recommended Preparation: Any 100 SS or C course", "Grading": "Graded", "Course ID": "101930", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)", "Same as Offered": "GWST 366 "}, {"Course": "HIST 369", "Name": "Darwinism: The Evolutionary Perspective", "Credits": "3", "Description": "The spread of evolutionary thought in Europe and America, the nature of the Darwinian revolution, its transformation of the biological and social sciences, and its effect in the larger culture. Recommended Preparation: Any 100-level Social Science course or junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54687", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 370", "Name": "History Of The Jews In The United States", "Credits": "3", "Description": "The history of the Jews in the United States from the earliest settlements to the present. The course focuses on political, economic, religious and cultural developments, anti-Semitism, and the rise of American Jewry to a position of leadership and responsibility in the world Jewish community. Special emphasis is placed on comparing and contrasting the American-Jewish historical experience with prior Jewish historical experiences in Europe. Recommended Preparation: One course in American or European history.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50167", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "JDST 370 "}, {"Course": "HIST 371", "Name": "History And Film", "Credits": "3", "Description": "This course looks at film and history of the 1930s in Nazi Germany, Stalinist Soviet Union and New Deal America. Using films as historical sources, the course will study images, representations and daily life as it was reflected and refracted through popular, entertainment film.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54688", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR), Culture (GFR)"}, {"Course": "HIST 373", "Name": "History of the Holocaust", "Credits": "3", "Description": "An interdisciplinary examination of the attempted destruction of the Jews of Europe and their culture, as well as the persecution of others on the basis of physical and emotional disabilities, ethnicity, politics, religion and sexual orientation at the hands of the Nazis and their collaborators during WWII. The course will briefly survey the migration of Jews to Europe, the history of anti-Semitism and “scientific” racism, the circumstances in Europe that allowed the rise of the National Socialist movement and the pre-WWII Nazi policies of discrimination. It then will focus on the perpetrators, victims and bystanders of the “Final Solution” and conclude with an analysis of the legacy of the Holocaust. Recommended Preparation: Any 100-level Social Science course or junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50155", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 373H, JDST 373H ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "JDST 373 "}, {"Course": "HIST 373H", "Name": "History of the Holocaust", "Credits": "3", "Description": "An interdisciplinary examination of the attempted destruction of the Jews of Europe and their culture, as well as the persecution of others on the basis of physical and emotional disabilities, ethnicity, politics, religion and sexual orientation at the hands of the Nazis and their collaborators during WWII. The course will briefly survey the migration of Jews to Europe, the history of anti-Semitism and “scientific” racism, the circumstances in Europe that allowed the rise of the National Socialist movement and the pre-WWII Nazi policies of discrimination. It then will focus on the perpetrators, victims and bystanders of the “Final Solution” and conclude with an analysis of the legacy of the Holocaust. Recommended Preparation: Any 100-level Social Science course or junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100340", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 373, JDST 373 ", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "JDST 373H "}, {"Course": "HIST 374", "Name": "European Women’s History 1200-1750", "Credits": "3", "Description": "An examination of the status and roles of women in European society through out the Middle Ages and Early Modern period. Through a mixture of secondary readings, primary sources, and film, this course investigates ideas about women and gender as well as the actions and ideas of women in the past. Topics include women and religion, women and work, women’s household and familial roles, women and sexuality, women and politics, and women’s education and writings. Recommended Preparation: Any 100-level social science course or junior/senior status", "Grading": "Graded", "Course ID": "50135", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "GWST 374 "}, {"Course": "HIST 375", "Name": "European Women’s History 1750-Present", "Credits": "3", "Description": "Examination of women in European society from the mid-eighteenth century to the present. The course emphasizes women’s life experiences within the context of larger historical changes in Europe (including the economy, cultural life, and social movements). Thus, a major goal of the course is to present women’s history both as an integral part of European social and cultural history and as a unique subject of historical investigation. Students will learn to think critically about historical arguments and to understand both the difference that gender makes in history and the differences among women’s historical experiences. The course will examine how diversity of class, race and nation shaped women’s lives by focusing on white aristocratic, middle-class and working- class women, as well as colonized and women of color. Recommended Preparation: Any 100-level social science course, 100-level literature course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50123", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "GWST 375 "}, {"Course": "HIST 376", "Name": "European Women’s History, 1914", "Credits": "3", "Description": "An examination of the role of women in European society from the eve of World War I until the present. Because the approach will be from a political, social, economic and cultural history perspective, readings will include a women’s history textbook, primary documents, autobiographical and biographical sketches, historical fiction and scholarly analysis of the role of gender in 20th-century Europe. Recommended Preparation: Any 100-level social science course, 200-level literature course, junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50104", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "GWST 376 "}, {"Course": "HIST 377", "Name": "The Jewish American Experience in Film", "Credits": "3", "Description": "This course explores the experiences of Jews in twentieth century America as portrayed in film through various themes that have helped to shape American Jewish identity. By examining cinematic representations in light of historical background, students will evaluate stereotypes and fictional images presented of Jews. Students will acquire critical movie-viewing skills as well as insight into the contemporary popular Jewish imagination. Recommended Preparation: HIST 102 or JDST 274 or JDST 370.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50169", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)", "Same as Offered": "JDST 371 "}, {"Course": "HIST 378", "Name": "Eastern Europe Since 1878", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54691", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GFR)"}, {"Course": "HIST 379", "Name": "“Do Muslim Women Need Saving?” -Women and Gender in Islam", "Credits": "3", "Description": "This course will introduce students to the study of Islam and gender, explore the evolution of scholarship that uses gender as a category of analysis, and uses case studies to bring theories into everyday lived experiences in Muslim societies. Topics will cover: new interpretations from feminist scholars over the Quran and early Islam, questions of veiling, seclusion, and sexuality in Muslim empires, the status of women in debates over colonialism and nationalism, gender and revolution, masculinities, and Islamism. Recommended Preparation: Any 100-level social science course, any 100-level humanities course.", "Grading": "Graded", "Course ID": "102797", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 373 "}, {"Course": "HIST 380", "Name": "Women and Gender in Asia", "Credits": "3", "Description": "An examination of the role of women and gender in Japan, China and Korea since ancient times. Topics include the influence of gender roles in work, marriage, sexuality and birth control practices. Scholarly analysis, historical fiction and film will be used.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50127", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "GWST 380"}, {"Course": "HIST 381", "Name": "From Samurai to “Salariman”: Japanese History through Film and Literature", "Credits": "3", "Description": "A study of Japanese history from 1600 to the present through the media of film and literature. It also explores the relationship between history and drama, in particular how they can illuminate or conceal basic truths and values of the past. Views of life and modern times, obsessions with honor and suicide, the changing role of women in society, the encounter between Japanese and foreign cultures, and themes of war and pacifism will be investigated. Recommended Preparation: Any 100-level social science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54692", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "HIST 382", "Name": "Pacific Crossings: Race, War, and Gender in Asian Migrations", "Credits": "3", "Description": "In this course, we will study the transnational history of Asian migrations from the mid-nineteenth century to the present, placing particular focus on Chinese, Japanese, Korean, Filipino, Indian, Vietnamese, and Hmong migrations. We will examine the tumultuous history that both sparked migrations and, at times, tried to prevent them in an effort to understand what was happening in homelands left behind and American destinations, along with the networks of communication and travel that connect them. Recommended Preparation: Any lower level SS course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101748", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP)"}, {"Course": "HIST 383", "Name": "Japan in the Shogun Age", "Credits": "3", "Description": "The history of Tokugawa (1600-1868) or early modern Japan: the age of shogun, samurai, castle-towns, kabuki actors, geisha courtesans and woodblock prints. Emphasis will be placed on the problem of how warriors produced more than two centuries of peace. The course also will investigate the political, economic and cultural patterns that laid the foundation for Japan’s emergence as a modern nation. Recommended Preparation: Any 100-level social science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54693", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "HIST 384", "Name": "Viewing History through Maps: East Asia in Native and European Cartography", "Credits": "3", "Description": "This course examines how knowledge of East Asia was created, reshaped, and imposed through maps by both native and European cartographers. As a source of knowledge and a format of power, maps provide and distort information of a certain space. Map-making combines science, art, and politics. The course pays special attention to the period from the 16th to 19th centuries, when Asian and European cartographies encountered each other and stimulated an early globalization of geographic imagination. Recommended Preparation: HIST 103.", "Grading": "Graded", "Course ID": "102727", "Consent": "No Special Consent Required"}, {"Course": "HIST 385", "Name": "Contemporary Japan, 1945 to the Present", "Credits": "3", "Description": "History of Japan from the end of the World War II to the present: the American occupation, political and constitutional changes, economic recovery and the politics of Japanese capitalism, social changes, education and student radicalism, problems of a postindustrial society and the foreign policy of Japan.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54694", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 386", "Name": "Hindus, Muslims, and their Others: The Construction of Identities in India and Pakistan", "Credits": "3", "Description": "This course explores the complexities of the categories of Hindus, Muslims, and their Others from the mid 19th century to the present in South Asia (the regions that would become India, Pakistan, and Kashmir). Beginning with the Indian Mutiny of 1857, it will explore the language and events of Partition and how the new states of India and Pakistan tried to define those new nations. Religious and cultural controversies and violence up to the present century will also be covered. Recommended Preparation: Lower level SS course.", "Grading": "Graded", "Course ID": "102733", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Culture (GEP)"}, {"Course": "HIST 387", "Name": "Medicine and Health Care in China", "Credits": "3", "Description": "This course examines the historical development of modern medicine and health care in modern and contemporary China. Topics include the indigenous medical system, especially acupuncture and pharmacology; the role of Western medical missionaries; the activities and contributions of the Rockefeller Foundation; the legacy of the pre-Communist medical system; health policies of the Communists after 1949; the mass line in medicine; traditional medicine in contemporary China; health care organizations; barefoot doctors and the rural health care network; recent changes and the impact of the Four Modernizations on the health system. Recommended Preparation: Any 100-level social science course, junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54696", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "HIST 388", "Name": "Society and Culture in China", "Credits": "3", "Description": "This course is a study of Chinese society and culture focusing on the main features of society, cultural developments and currents of thought in traditional and modern times. Recommended Preparation: Any 100-level social science course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54697", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "HIST 389", "Name": "Islamic Culture and Society: 570-1560 CE", "Credits": "3", "Description": "This course traces the origins and development of the culture and society of Islam, a community that today represents over 1.2 billion people. Beginning with the origin of Islam in the cultural norms and ideal of central Arabia in the late sixth century, the course proceeds to examine the physical expansion of Islam into the Mediterranean basin and east to India, intellectual and philosophical currents, and finally the development of the Ottoman Empire, the Islamic “superpower” that lasted until the 20th century. Particular attention will be paid to cross-cultural influences and communication with western Europe, including the reception and assimilation of Islamic philosophical tradition by medieval European universities.", "Grading": "Graded/Audit", "Course ID": "100187", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 390", "Name": "Wars in 20th Century East Asia", "Credits": "3", "Description": "This course examines the political, social, economic, cultural and military aspects of the four major Asian wars of the last century: the Pacific War, the Chinese Civil War, the Korean War, and the Vietnam War. We will explore theories about “absolute war” and “people’s war.” We then explore alternative approaches to understanding the origins and impacts of wars in East Asia, including the perspectives of international relations, sociology, anthropology, cultural studies, and literature. Recommended Preparation: HIST 103 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102432", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 391", "Name": "Internship in History", "Credits": "3", "Description": "This course is repeatable for credit. Recommended Preparation: Formal application and acceptance by the history department", "Grading": "Pass Fail/Audit", "Course ID": "54698", "Consent": "No Special Consent Required", "Components": "Field Studies"}, {"Course": "HIST 392", "Name": "Art and Power in Japan: 1600 to the Present", "Credits": "3", "Description": "The aim of this course is to view art and architecture as instrumental to change in pre-modem and modern Japan. Rather than restricting “art” to the realm of leisure, we will emphasize art’s ability to serve as a visual placeholder for political motivations. The course will begin by analyzing sites in Nara and Kyoto but will also highlight the design of temples, shrines, and memorial spaces in locations such as Nagoya, Hiroshima, and Tokyo. Recommended Preparation: HIST 103 ", "Grading": "Graded", "Course ID": "102879", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ASIA 392 "}, {"Course": "HIST 400", "Name": "Special Projects in History", "Credits": "1", "Description": "This course is repeatable for credit. Students may complete a maximum of 6 credits. Note: Open to junior/senior history majors with special study projects and at least a B average in history. In extraordinary circumstances, exceptions may be made with permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54702", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "HIST 401", "Name": "The American South to 1865", "Credits": "3", "Description": "This course explores the history of the American South from the arrival of Europeans until the beginning of the Civil War. We will explore this region as a place where three cultures - Native American, European, and African - intersected, and trace the ways in which they influenced each other, as well as, the role the South played in the history of the American nation as a whole. Recommended Preparation: HIST 101 or HIST 102, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54703", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 402", "Name": "The American South Since Reconstruction", "Credits": "3", "Description": "This course will examine the contours of life in the American South since the end of the Civil War. Given the South’s history of segregation, race is central to understanding Southern identity. We will explore life on both sides of the color line, and will consider ways in which racial identity interacted with class and gender to inform economic development, political and social change, and popular culture in the nineteenth and twentieth century South. Recommended Preparation: HIST 101 or HIST 102, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54704", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 405", "Name": "Comparative Slavery: Africa and the New World", "Credits": "3", "Description": "Historical examination and comparison of the emergence of domestic slavery in Africa and chattel slavery in the New World and the Americas. Explores the social conditions that shaped these institutions and that led to overt and covert forms of resistance and slavery’s eventual decline. Recommended Preparation:  AFST 212 or AFST 352 or junior/senior standing", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50017", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "AFST 420 "}, {"Course": "HIST 406", "Name": "The Atlantic World: The Shared History of Europeans, Africans, and Native Americans", "Credits": "3", "Description": "Starting in the 1400s, people around the Atlantic began to interact, using the ocean as their highway. In the process of connecting with each other, Africans, Europeans and Americans transformed themselves and each other, creating new worlds, both in the Americas and at home, for all. The relatively new field of Atlantic history was developed to study these connections and transformations in the early modern period as well as how they changed over time. This course will not concern itself exclusively with one area, nor follow necessarily a chronological path. We will study the making of an Atlantic working class, coerced labor, piracy, maronage, native rebellions and anti-colonial revolutions. Recommended Preparation: HIST 341.", "Grading": "Graded", "Course ID": "100518", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 408", "Name": "Mayhem and Murder: Women & Crime in American Historical Memory", "Credits": "3", "Description": "This is an advanced seminar that explores how gender norms have influenced popular media and historical scholarship on women criminals and victims of crime in  American historical memory. We will deconstruct select “crimes of the century” and determine how definitions of “victims” and “perpetrators” are altered through the lens of gender, class, and racial analysis.  Potential themes include feminism and 1930s bank robbery cases, motherhood and 1950s adoption ring cases, and multiculturalism and the 1990s police brutality trials. Recommended Preparation: HIST 201 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102569", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 411", "Name": "Service Learning in Public History", "Credits": "3", "Description": "This is a research intensive course designed to provide students with real-world experience in the development and implementation of a public history project. The course will typically be taught in cooperation with an external partner for whom the class project meets a pressing need. The specific content of the course will vary based on instructor expertise and partner needs. Students in the course will receive intensive training in a marketable skill, such as oral history interviewing, historic site documentation, digital storytelling, program development, or interpretation. They will complete a project on behalf of a local public history organization, building a relevant work history with faculty guidance and supervision. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Students may complete a maximum of 6 credits or 2 attempts.", "Grading": "Graded", "Course ID": "101989", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Public History Practice, Service Learning in Public History, Games in the History Classroom", "Prerequisite/Corequisite": "You must have completed HIST 201 and HIST 300 "}, {"Course": "HIST 413", "Name": "American Revolution", "Credits": "3", "Description": "This course will explore the era of the American Revolution. We will examine what many historians call the “long Revolution,” from the 1760s until about 1800. The course will emphasize the internal revolution within American society that was sparked by the conflict with Britain. This internal revolution saw different groups of peoples trying to enact conflicting visions of freedom and democracy. As part of this project, we’ll try to understand what the Revolution meant to prominent “founding fathers” such as Thomas Jefferson and John Adams as well as what it meant to ordinary people: farmers, artisans, women, slaves, and Indians. Recommended Preparation: HIST 101  or HIST 340 or HIST 341 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101934", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 414", "Name": "Historic Preservation in the US", "Credits": "3", "Description": "Historic preservation is the practice of protecting and preserving historic places.  It strengthens local economies, fosters civic beauty, and enhances the appreciation of local and national history.  But who decides what should be preserved?  This course provides an introduction to the field, examining its history and practice in the United States. Students will gain an essential set of tools for critically observing historic sites, interpreting their historic context, evaluating their significance, and developing preservation plans. Recommended Preparation: HIST 201 and/or HIST 300 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102304", "Consent": "NO Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 415", "Name": "Advanced Public History", "Credits": "3", "Description": "This is a seminar style course for students considering graduate study or a career in public history. Public historians produce original interpretations that build bridges between scholarship and everyday life by respecting the ways in which their partners and audiences use history, and by balancing professional authority against community needs. Students will read and discuss texts that explore the history, best practices, and core values of public history. Students will also gain experience in the collaborative methodologies that distinguish public history from other forms of historical professionalism.", "Grading": "Graded", "Course ID": "101990", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed HIST 201 and either HIST 300 or AMST 205 "}, {"Course": "HIST 418", "Name": "The American House: Everyday Architecture in America", "Credits": "3", "Description": "Our homes are a central part of the American dream. This course explores the relationship between the ideal house and family and the reality of American domestic life from colonial settlement to the mid-twentieth century. Topics include the development of domestic architecture; evolving standards of living; the “consumer revolution” and household consumption; household labor and production; class formation and identity; residential space and domestic artifacts; industrialization and home life; and evolving domestic technologies. Recommended Preparation: HIST 101 or HIST 102 and HIST 300 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102305", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 420", "Name": "American Political Development", "Credits": "3", "Description": "In this course we will explore the changing institutions - which include both the ideas and organizations - that have undergirded America’s governing system. The course will provide students with fundamental historical knowledge about key issues in American political and policy history, particularly after 1865. Second, this course will help students explore historiographical debates and scholarly discussions about the factors driving political change. Finally, students will examine the notion and meaning of “American exceptionalism.”", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101936", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 422", "Name": "Seeing and Obscuring: Documenting America in the Modern Era, 1877-1945", "Credits": "3", "Description": "For some Americans, the broad transformations that led to the emergence of modern America inspired great optimism and encouraged innovation. For others, changes in American habits and values inspired fear and nostalgia. Interestingly, both reactions can be found underneath a broad cultural trend prevalent during this period: the impulse to define, document, and interpret an authentic American culture. This seminar style American history class will examine this trend, training students to think about the ways in which four specific forms of cultural production –photography, preservation, tourism/spectacle, and documentary film –shaped Americans’ collective identity and continue to impact our sense of who we are as a nation. Recommended Preparation: HIST 102  or HIST 319 or AMST 100 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101991", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 423", "Name": "Creating the Constitution", "Credits": "3", "Description": "HIST 423 explores the creation of the federal Constitution of 1787 and the Bill of Rights. The course examines the many crises that the Constitution was designed to solve. We will investigate the politics that brought about the Constitutional Convention and the debates over the scope and structure of the new national government, the contest between “Federalists’ and “Antifederalists” over ratification, and the Bill of Rights and its place in the Early Republic. Recommended Preparation: HIST 101 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102422", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP)"}, {"Course": "HIST 425", "Name": "Making a Buck: The History of American Capitalism", "Credits": "3", "Description": "The word “capitalism” immediately calls to mind foundational works of modern economics, particularly Adam Smith and Karl Marx. In this course you will indeed read some of the most important philosophers and economists of capitalism. We will supplement this intellectual framework with the work of historians who discuss the political and economic developments that have shaped American capitalism. Topics to be discussed include slavery, risktaking, the rise of corporations, income inequality, and modern finance. Recommended Preparation: HIST 101  or HIST 102 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102407", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 426", "Name": "Objects in History/Objects as History: Material Culture and Museum Studies for Historians", "Credits": "3", "Description": "This course introduces students to the theories and methods that historians use to analyze and interpret material culture. In this seminar style course, students will explore and discuss the history of American museums and their collections. They will also analyze the value of material culture as historical evidence. This class is intended for upper level students who have experience in conducting primary and secondary source research. Recommended Preparation: HIST 201 or HIST 300 ", "Grading": "Graded", "Course ID": "102565", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 427", "Name": "Digital Public History: Using Digital Tools to Interpret Difficult Pasts", "Credits": "3", "Description": "Digital Public History is a service-learning course that explores the entrepreneurial aspects of public history practice. This course trains students to use open-source digital tools to develop creative responses to persistent interpretive problems or challenges in the field of public history. The course creates an opportunity for students to take the lead in their own learning, build an original portfolio, learn marketable skills, and establish a professional network. No coding is required. Recommended Preparation: HIST 201 or HIST 300 ", "Grading": "Graded", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 428", "Name": "Making Digital History", "Credits": "3", "Description": "How has the digital revolution changed the ways we think about, produce, and consume history? Students will explore the intersection of the historical and the digital from a variety of perspectives and approaches. They will look at the ways that computers and data analysis such as topic modeling and network analysis can shape and transform historical arguments. Students will also think about how historical content can be expressed digitally, through websites, films, apps, and games. Finally, they will build their own digital portfolios through hands-on projects. Students do not need a background in programming for this class.  Recommended Preparation: 100 or 200 level History course", "Grading": "Graded", "Course ID": "102709", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 429", "Name": "The History of Baltimore", "Credits": "3", "Description": "An examination of the growth of Baltimore from the 18th century to the present. Major themes are the evolution of urban government and politics, the development of the urban economy from a commercial port to an industrial center and then to the post-industrial era, the growth of the urban physical plant and its expansion into the metropolitan region in the 20th century, and the changing relationships of Baltimore’s socio-economic groups. Recommended Preparation: HIST 101 or HIST 102, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54714", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 434", "Name": "The Vietnam Wars in International Context", "Credits": "3", "Description": "This course studies the Vietnam Wars of 1946 to 1975: the French Colonial War as well as the American War in international context. Students will study the conflicts from a variety of perspectives, including those of North and South Vietnam, China, the Soviet Union, France, and the United States. They will also learn about the experience of the war at all levels, from presidential policy-making down to army private or civilian casualty. Recommended Preparation: HIST 102  or HIST 304 or HIST 347 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54661", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 436", "Name": "The Rise of China and the United States’ Response", "Credits": "3", "Description": "The relationship between the United States and China is one of the most critical for peace and stability in world affairs. The long history of cooperation and competition between the two powers dates to the 18th century, long before either emerged as a superpower, but continues today. This course helps students analyze developments in this diplomatic relationship on all levels, from the presidential to the personal, while keeping an eye on the future. Recommended Preparation: Upper division course in History or Political Science, U.S. Foreign Policy", "Grading": "Graded", "Course ID": "102278", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 445", "Name": "History of Science to 1700", "Credits": "3", "Description": "This course examines the growth of scientific knowledge in the World. Topics will include views of nature in traditional societies, Babylonian mathematics and astronomy, Egyptian medicine, the work of the ancient Greeks, medieval European and Arabic science, the Copernican revolution, the relationship between religion and science, and the Scientific Revolution. Recommended Preparation: Lower level Social Sciences or Culture course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54721", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 445H ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must have completed ENGL 100  or equivalent with a grade of “C” or better"}, {"Course": "HIST 445H", "Name": "History of Science to 1700", "Credits": "3", "Description": "The story of the growth of scientific knowledge in the West. Topics include views in nature in traditional societies, Babylonian mathematics and astronomy, Egyptian medicine, the work of the ancient Greeks, medieval European and Arabic science, the Copernican revolution, the relationship between religion and science, and the Scientific Revolution. Recommended Preparation: HIST 100 or HIST 110 or HIST 111 and junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100041", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 445 ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete HIST 100 or HIST 110 or HIST 111 with a C or better and have Junior/Senior status."}, {"Course": "HIST 446", "Name": "History of Science Since 1700", "Credits": "3", "Description": "This course provides an overview of the history of Western science since the 18th century. It will emphasize the development of various scientific fields within their institutional settings and the professionalization of the role of the scientist. Recommended Preparation: Lower level Social Sciences course", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54722", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 446H ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)"}, {"Course": "HIST 446H", "Name": "Honors-History of Science Since 1700", "Credits": "3", "Description": "A survey of the history of Western science since the 18th century, emphasizing the development of various scientific fields within their institutional settings and the professionalization of the role of the scientist. Recommended Preparation: RHIST 100, HIST 110 , or HIST 111 , junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100306", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "HIST 446 ", "Attributes": "Social Sciences (GEP), Writing Intensive (WI), Social Sciences (GFR)", "Prerequisite/Corequisite": "You must complete HIST100 or HIST 110 or HIST 111 with a C or better and have Junior/Senior status."}, {"Course": "HIST 447", "Name": "The Civil Rights Movement", "Credits": "3", "Description": "This course explores the African American struggle for full citizenship rights in the United States during the middle years of the twentieth century. It will focus on the individuals and organizations that used litigation, boycott, and nonviolent civil disobedience to desegregate America society during the period 1954 to 1968, when they achieved their greatest legislative and judicial victories. This class will also explore alternative strategies available to African Americans during this period, why nonviolence and desegregation became dominant, and how/why they were challenged as the 1960s came to a close. Recommended Preparation: HIST 101 or HIST 102 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "054723", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 449", "Name": "From Black Power to Black Lives Matter: The Black Freedom Struggle in the Post-Civil Rights Period", "Credits": "3", "Description": "This course explores the myriad and changing ways that African Americans struggled for equality in the fifty years after the civil rights reforms of the mid-1960s. It pays particular attention to issues of political economy and structural shifts in U.S. politics in order to situate black activists activism in context. Recommended Preparation: HIST 201 or any 300 level Humanities or SS course.", "Grading": "Graded", "Course ID": "102365", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 649"}, {"Course": "HIST 450", "Name": "Social History of American Medicine", "Credits": "3", "Description": "The history of American health care, hospitals and ambulatory care facilities, the role of government, public health programs, and social issues such as smoking and abortion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50156", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "SOCY 457 ", "Prerequisite/Corequisite": "You must complete one Social Science, Biology, or Chemistry course and your academic standing must be junior."}, {"Course": "HIST 453", "Name": "Ancient Greece", "Credits": "3", "Description": "This course surveys the history of Greece from the earliest times to the death of Alexander. Topics include the Aegean Bronze Age, Greek colonization and the emergence of tyranny, the development of the city-state in Sparta Athens, the Persian Wars, the classical age and the Peloponnesian War, the rise of Macedonia, and the conquests of Alexander the Great and their impact. Recommended Preparation: ANCS 201, ARCH 200, or HIST 110, junior/senior status.", "Grading": "Graded/Audit", "Course ID": "054726", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "ANCS 453 "}, {"Course": "HIST 454", "Name": "Hellenistic World and Rome", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54727", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 455", "Name": "The Roman Republic", "Credits": "3", "Description": "This course surveys the history of ancient Rome from the earliest times to 31 B.C.E. Topics include Roman imperialism in Italy and the Mediterranean, the conflict of the orders, the Punic Wars and the collapse of the republic. Recommended Preparation: ANCS 202, ARCH 201, or HIST 110; junior/senior status", "Grading": "Graded/Audit", "Course ID": "054728", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 456", "Name": "The Roman Empire", "Credits": "3", "Description": "A history of ancient Rome from the Augustan Age to the disintegration of the empire in the West. Topics include the Pax Romana, the military monarchy and anarchy, the reorganization of the empire by Diocletian and Constantine, the rise of Christianity and the final collapse of the empire. Recommended Preparation: ANCS 202, ARCH 201, or HIST 110; junior/senior status.", "Grading": "Graded/Audit", "Course ID": "054729", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "ANCS 456 "}, {"Course": "HIST 457", "Name": "Byzantine Civilization", "Credits": "3", "Description": "Byzantine state, with particular attention to the art, institutions and ideals that shaped its long history. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54730", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)"}, {"Course": "HIST 458", "Name": "Japan to 1800", "Credits": "3", "Description": "The history of Japan from the origins of the Japanese people through the height of Tokugawa rule. Some areas of focus will be an examination through archaeological sources of Japan’s beginnings, the transition of Japanese society from courtier to warrior rule during the 11th through 14th centuries and the process of political unification of the 16th century. Recommended Preparation: HIST100 or HIST 110 or HIST 111, junior/senior status", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54731", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 459", "Name": "The Rise of Modern Japan: From the “Black Ships” to Hatsune Miku", "Credits": "3", "Description": "Beginning with Japan’s early modern past and its forced emergence from isolation, this course will explore Japan’s rise as a modern state, its plunge into militarism and war, and its subsequent rapid emergence as one of the world’s leading nations. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54732", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 463", "Name": "Jews, Christians and Muslims in the Middle Ages", "Credits": "3", "Description": "This course examines moments of contact and conflict between the three major monotheistic faiths of the medieval period: Judaism, Christianity, and Islam. Topics will include an examination of the scriptural foundations of the three faiths and their influence on topics such as law, violence, conversion, ritual, and legend. The course provides an overview of how individuals and leadership within the three faiths interacted with each other. Recommended Preparation: HIST 100 or HIST 110, or HIST 111 or JDST 100 or RLST 100 or 200-level course, and junior/senior standing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50151", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "JDST 463, RLST 463 "}, {"Course": "HIST 465", "Name": "The Renaissance", "Credits": "3", "Description": "A history of Europe from 1300 to 1500 with emphasis on the economy, institutions and culture of the Italian city-state; the movement toward capitalism and the national state; the erosion of the medieval synthesis and the growth of religious heterodoxy. Recommended Preparation: HIST 100, HIST 110, or HIST 111, junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54734", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Social Sciences (GEP), Social Sciences (GFR)"}, {"Course": "HIST 466", "Name": "The Reformation", "Credits": "3", "Description": "The economic and political conditions, the popular movements and the theological controversies that led to the overthrow of the Catholic Church’s monopoly of religious loyalties, thereby turning Europeans against one another on a national/religious basis. Attention is focused on the lives and ideas of the leading reformers. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50157", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)", "Same as Offered": "RLST 466 "}, {"Course": "HIST 468", "Name": "The Age of Enlightenment", "Credits": "3", "Description": "A study of the major works of the Enlightenment in Western Europe. The literature and philosophy of the Enlightenment are examined within the political and social history of the 18th century. Readings include Voltaire, Rousseau, Hume and Kant. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54735", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 469", "Name": "Masculinity and Femininity in the Middle Ages", "Credits": "3", "Description": "This course considers how medieval society defined femininity and masculinity, appropriate male and female behavior, and men and women’s bodies. Close study of primary and secondary sources will help answer these  questions: What did it mean to be masculine/feminine within medieval culture? Who created these definitions? How were the definitions challenged? What role does sexual behavior play in these definitions? How do other categories, like economic class, religion, and ethnicity complicate ideas about gender? Recommended Preparation: HIST 201  and HIST 362  or HIST 366  or GWST 100  or GWST 210 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102172", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 469 "}, {"Course": "HIST 470", "Name": "Tudor and Stuart England: 1485-1714", "Credits": "3", "Description": "An introduction to British politics, society, economy, religion and culture during the 16th and 17th centuries. It is under the Tudors that England developed into a strong and relatively wealthy nation state. The country also underwent revolutions in culture (the Renaissance) and religion (the Reformation). The 17th century was a turbulent one, with unemployment and poverty, witchcraft accusations and civil wars affecting the British people. But Britain also was emerging as a colonial naval and trading power, as well as a center of the Scientific Revolution. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54736", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 471", "Name": "Britain in the Industrial Revolution: 1714-1848", "Credits": "3", "Description": "An examination of the impact of the Industrial Revolution on British society, with particular reference to the themes of social and economic change, the rise of social classes and class consciousness, early feminism and gender relations, and the genesis of modern party politics. Recommended Preparation: HIST 100 or HIST 110 or HIST 111 and junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54737", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 472", "Name": "Victorian Britain", "Credits": "3", "Description": "An examination of the main social, political and economic trends in Victorian Britain, with particular reference to the themes of parliamentary reform and the genesis of modern party politics, the Irish problem and new imperialism, the condition of the people question, the revival of socialism and the struggle for women’s suffrage. Recommended Preparation: HIST 100 or HIST 110 or HIST 111 and junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54738", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 473", "Name": "Twentieth-Century Britain: The Age of Decline", "Credits": "3", "Description": "An examination of the causes and consequences of Britain’s 20th-century descent from its preeminent position of the Workshop of the World in the 19th century to its present-day status as the Sick Woman of Europe. Particular attention will be paid to the contemporary debates around the various dimensions of decline, the succession of counter-strategies adopted or canvassed to halt or reverse this process, the impact of the two world wars, and the evolution of domestic social and economic policy. Recommended Preparation: HIST 100 or HIST 110 or HIST 111 and junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54739", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 477", "Name": "History of China to 1644", "Credits": "3", "Description": "Chinese history from ancient times to the mid-17th century, with special attention paid to the development of society, thought, economy and political institutions. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, plus junior/ senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54743", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 478", "Name": "From Marco Polo to the Opium Wars: China in the Early Modern World", "Credits": "3", "Description": "This course examines China’s interactions with the world from the 13th to the 19th century from the perspective of global history. By reviewing China’s active and significant influence in shaping the modern world, the course aims at reinterpreting the early modern period, the globalization, and Chinese history in a more comprehensive way. Recommended Preparation: HIST 103 ", "Grading": "Graded", "Course ID": "054744", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 479", "Name": "China’s Long Revolution", "Credits": "3", "Description": "This course examines the history of China from the late nineteenth century to the mid-twentieth century through the lens of revolution. It explores the transition of China from a Manchu empire to a modern nation-state. The course highlights the idea of revolution-racial, political, national, social, and cultural-in the Chinese context. Recommended Preparation: HIST 103 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54745", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete ENGL 100 or equivalent with a C or better."}, {"Course": "HIST 480", "Name": "Mao and After: History of Contemporary China", "Credits": "3", "Description": "This course examines the history of the People’s Republic of China, focusing on the successes and failures of socialist revolutions under Mao and capitalist reforms after Mao. The course highlights the following themes: the relations between central and local authorities; revolution and society; rural v.s. urban developments; culture, ideology and gender; territory and ethnicity; and international relations. Recommended Preparation: HIST 103 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54746", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 481", "Name": "History of Modern France, 1789-1989", "Credits": "3", "Description": "A survey and an analysis of French society and political institutions from the era of the great revolution to its bicentennial anniversary, covering the impact of Napoleon and 19th-century conservatism, as well as the formation of republican regimes in the 20th century. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54747", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 483", "Name": "German History: 1789 to 1914", "Credits": "3", "Description": "History of the German states from the French Revolution through national unification, the Bismarckian era and the Wilhelminian era up until the outbreak of World War I. Emphasis is on the struggles between nationalism, conservatism, liberalism and social democracy in the new German empire. Includes a cultural, social and political approach. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54749", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 484", "Name": "German History: 1914 to the Present", "Credits": "3", "Description": "History of Germany from World War I, through the Weimar Republic, the Third Reich, the Allied occupation, and the founding and development of the two Germanies. Emphasis is on the development of economic and military strength, political and social upheaval, cultural responses to war and role of Nazism in modern German history. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54750", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 485", "Name": "Russia to 1900", "Credits": "3", "Description": "A history of Russia from its origins to the end of the 19th century. Topics covered include Kievan Russia, the rise of Muscovy, the reforms of Peter the Great, the evolution of society under Peter’s successors, the “golden age” of Russian culture and industrialization, and the development of the revolutionary movement. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54751", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 486", "Name": "Soviet History on Trial", "Credits": "3", "Description": "Students try four important cases in Soviet history and examine the full range of 20th century Russian history: radical socialism and the Russian Revolutions of 1917, the socialist social and cultural experiments of the twenties, the Stalinist Revolution, World War II, the Khrushchev Thaw, Brezhnev-era stagnation, the Gorbachev experiment, the collapse of the Soviet Union, and aftermath. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, plus junior/ senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54752", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 487", "Name": "Europe, 1815-1914", "Credits": "3", "Description": "An examination of European history from the Congress of Vienna, which ended the Napoleonic Wars, until the eve of World War I. Emphasis will be placed on the impact of the Industrial Revolution on social classes, ideologies, gender roles, cultural trends, nation- and empire-building, and international competition in the 19th century. Recommended Preparation: HIST 100 or HIST 110, or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54753", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 488", "Name": "Europe, 1914 to the Present", "Credits": "3", "Description": "The history of Europe from the outbreak of World War I until the present. Emphasis on the origins and the social and political impact of the two world wars, the Russian Revolution, the rise of fascism in inter-war Europe, and the decline and the division of Europe after 1945, as well as its more recent revival and developing unity. Recommended Preparation: HIST 100 or HIST 110 or HIST 111, plus junior/senior status.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54754", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Social Sciences (GEP), Culture (GFR), Social Sciences (GFR)"}, {"Course": "HIST 490", "Name": "Honors - Selected Topics in History", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits or 2 attempts. Recommended Preparation: Honors College student status and any 100-level Social Science course, junior/senior status.", "Grading": "Graded", "Course ID": "54755", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 493", "Name": "Seminar in European History", "Credits": "3", "Description": "Intensive study and discussion of the historical literature on a particular issue, problem or period of European history. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54758", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Colloquium European Hist, Seminar in Family History, Hist of Family in Britain/U.S."}, {"Course": "HIST 494", "Name": "Seminar in World History", "Credits": "3", "Description": "Intensive study and discussion of the historical literature on a particular issue, problem or period of world history. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54759", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 495", "Name": "Seminar in American History", "Credits": "3", "Description": "Intensive study and discussion of the historical literature on a particular issue, problem or period of American history. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54760", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "HIST 496", "Name": "Historical Research", "Credits": "3", "Description": "Historical methodology with respect to research, organization and preparation of materials. Written and oral reports and a research paper are required. The course is oriented around a specific topic in American history, to be chosen by individual professor. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54761", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "US Contesting Nationalism in America, Continuity/Change in Hist of Americas, Contin/chg Outside Amer., American Social Development, Maryland in the 19th Century, Protest, Unrest, & Change in American Hist, American Cultures, Civil War, Gender/Amer. Protest Movements", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must have completed HIST 201 and ENGL 100  or equivalent with a ‘C’ or better"}, {"Course": "HIST 497", "Name": "Historical Research:", "Credits": "3", "Description": "Historical methodology with respect to research, organization and preparation of materials. Written and oral reports and a research paper are required. The course is oriented around a specific topic in European and world history, to be chosen by individual professor. Topics will be published in the Schedule of Classes. This course is repeatable for credit. Recommended Preparation: Junior/senior status or permission of the instructor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54762", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": "You must complete HIST 201 and ENGL 100   or equivalent with a ‘C’ or better"}, {"Course": "HIST 498", "Name": "Honors Thesis in History I", "Credits": "3", "Description": "Research and writing of honors thesis in history. HIST498 and HIST 499 comprise a two-semester sequence and are part of the departmental honors program. (For further information on HIST 498 and HIST 499 and on the Honors Program in history, inquire at the departmental office.)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "54763", "Consent": "No Special Consent Required", "Components": "Independent Study"}]