[{"Course": "SOCY 401", "Name": "Thesis Research", "Credits": "3", "Description": "This course sequence (401 and SOCY 402) partially fulfills the requirement for the major in sociology with honors. Information describing the requirements for the honors major is available from the departmental office.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56803", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete SOCY 300 with a minimum grade of C."}, {"Course": "SOCY 402", "Name": "Honors Thesis", "Credits": "3", "Description": "See SOCY 401.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56804", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete SOCY 300 with a minimum grade of C."}, {"Course": "SOCY 403", "Name": "Introduction to International Field Research", "Credits": "3", "Description": "The purpose of this course is to help prepare students for the increasingly sophisticated requirements of a global society, to develop an international perspective on important issues in culture, policy and practice, and to gain experience using social science field research methods. The international experience is designed to enable students to conduct field research on issues that will be of importance to the United States and Europe by studying the inter-relationships of health and social policy, science and technology, culture and life style in an international context. Students learn social science research methods and vocabulary and concepts from the disciplines of sociology, anthropology and health services research. This course includes lectures, structured exercises, field trips, site visits and discussions in the United States and Switzerland. Recommended Preparation:  Six social science credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50144", "Consent": "Department Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR)", "Same as Offered": "HAPP 403 "}, {"Course": "SOCY 406", "Name": "Social Inequality and Social Policy", "Credits": "3", "Description": "This course examines poverty and inequality in modern society. The focus is on describing the extent of poverty and inequality, examining theories that attempt to explain these phenomena and discussing the policies that have been employed to mitigate them. In addition to class inequality, the course will consider racial and sexual inequality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56805", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Sociology each course with a minimum grade of C and your academic level must be junior."}, {"Course": "SOCY 409", "Name": "Sociological Theory", "Credits": "3", "Description": "Classical and contemporary sociological theorists are studied and compared, as well as different schools of theory. Also, the course surveys and critiques different types of theory and metatheory.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56806", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology. Each course must have a minimum grade of C."}, {"Course": "SOCY 414", "Name": "The Evaluation of Educational Policy", "Credits": "3", "Description": "This course applies research findings from the sociology of education to some key issues of educational policy, focusing on primary and secondary education. Both issues of educational quality and equality are considered, including school quality, choice proposals, school desegregation, compensatory education, tracking, mainstreaming and bilingual education. The course includes an introduction to the nature of educational policy, an overview of the policy-making process at the local level and a critical assessment of policy research, with special attention given to problems of measurement and study design.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56810", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Social Science and/or Education courses each with a minimum grade of C and your academic level must be junior."}, {"Course": "SOCY 415", "Name": "Higher Education and Social Inequality", "Credits": "3", "Description": "A sociological analysis of the impact of higher education on social inequality in the United States. Topics will include a discussion of problems of attaining a representative student body, missions of different types of institutions, the development of programs for different types of students and the effects of affirmative action programs.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56811", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology or Anthropology each course with a minimum grade of C and your academic level must be junior."}, {"Course": "SOCY 416", "Name": "Cyberspace Culture", "Credits": "3", "Description": "The “information super highway,” “communications revolution” and “cyberspace” are used to describe the contemporary revolution in human communications. This course will explore the cultural and societal implications of computer-mediated communications (CMC) by addressing such topics and questions as: representations of self and self-identity in cyberspace, interactions in cyberspace, information technology and institutional change, community formation in cyberspace, democracy and collective action in cyberspace, and order and deviance in cyberspace. Throughout the course, contemporary technological advances will be compared and contrasted with the cultural and societal effects of previous technologies, such as the printing press, wireless telephone, television.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50045", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ANTH 416 ", "Prerequisite/Corequisite": " You must complete ANTH 211 or ANTH 212 or SOCY 101 or SOCY 101H and, in addition, 9 credits in Sociology and Anthropology. Each course must have a minimum grade of C."}, {"Course": "SOCY 417", "Name": "Applied Survey Techniques", "Credits": "3", "Description": "The techniques of survey research methods. Topics such as the planning of survey projects, sample design, questionnaire construction, tabulation procedures and report preparation are covered. Students participate in a survey research project.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56812", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology or Anthropology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 418", "Name": "SAS for Social Scientists", "Credits": "3", "Description": "This course introduces students to the basic principles of SAS, a widely used statistical software package. Students will learn data entry, data correction and validation, data analysis, combining data sets, rearranging data and micros.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56813", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete SOCY 301 with a minimum grade of ‘C’."}, {"Course": "SOCY 419", "Name": "Qualitative Methods in Social Research", "Credits": "3", "Description": "This course will focus on the styles of research, analysis and epistemologies associated with qualitative research in the applied social and policy sciences. As an increasingly important mode of inquiry, qualitative, multi-method approaches are particularly relevant to the study of social interaction and behavior in natural settings. Qualitative approaches involve the collection and analysis of empirical information from multiple sources, such as first-person accounts, life histories, visual/printed records, semi-structured and open-ended interviews, informal and formal observations, biographical and autobiographical materials, among others. Students in the course will learn how to design, collect and analyze qualitative information by conducting a small, semester-long study. Sections of the research project will be prepared, presented and evaluated throughout the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50048", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "ANTH 419 "}, {"Course": "SOCY 420", "Name": "Epidemiology", "Credits": "3", "Description": "This course studies health and disease in populations and compares groups within populations, including age, sex, race, and ethnic groups. The course examines the sources of data and the methods used by public health researchers. It also studies methods used in public health programs to measure and control diseases and to evaluate programs. Recommended Preparation: Research Methodology and Statistics.", "Grading": "Graded", "Course ID": "56814", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "HAPP 300 or (SOCY 300 and SOCY 301) with a grade of ‘C’ or better."}, {"Course": "SOCY 430", "Name": "Sociology of Aging", "Credits": "3", "Description": "Changing work, family and other sociological roles of the elderly; the subculture of the aged; economic, health, medical care and other social problems of the elderly.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56817", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology or Anthropology each course with a minimum grade of C and your academic level must be junior."}, {"Course": "SOCY 431", "Name": "Family and Aging in Society", "Credits": "3", "Description": "An analysis of human development and aging as they relate to the institution of the family. Using a family life cycle perspective, the course examines demographic trends, historical change in the family, stages of family life, changing family roles and intergenerational relations. Particular attention is paid to the mutual effects of changing family structure and social policy in shaping the status of the aged in society.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56818", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Sociology each course with a minimum grade of C and your academic level must be junior."}, {"Course": "SOCY 432", "Name": "Work and Retirement", "Credits": "3", "Description": "An examination of the issues and research related to work among older people and the termination of work at retirement. Specific topics addressed include the work career and aging, skill obsolescence, efficiency of older workers, age discrimination in employment, the retirement decision, differences in retirement by sex, consequences of retirement for health and economics, pension policy and implications for the future.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56819", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology or Anthropology each course with a minimum grade of “C” and your academic level must be junior."}, {"Course": "SOCY 433", "Name": "Gender, Work, and Family in Cross-Cultural Perspective", "Credits": "3", "Description": "Work and family relationships as affected by gender stratification. Topics include separation of work and family, division of household labor, gender-wage differences, occupational segregation, impact of government work, and family policies on women and men.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50121", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Same as Offered": "GWST 433 ", "Prerequisite/Corequisite": " You must complete SOCY 101 or GWST 100 and ENGL 100  or equivalent with a minimum grade of ‘C’ and your academic standing must be junior."}, {"Course": "SOCY 434", "Name": "Gender and the Life Course", "Credits": "3", "Description": "This course examines the complex interactions of two critical social constructs: gender and the life course. Material will examine how these constructs have developed over time, how they vary across cultures and historical periods and how they interact to construct very different lives for males and females in society. Specific foci of the course include demographic and biological underpinnings of gender and the life course, age stratification systems, and times of family and other life events by gender.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50107", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 434 ", "Prerequisite/Corequisite": "You must complete SOCY 101 or GWST 100 with a minimum grade of ‘C’ and your academic standing must be junior."}, {"Course": "SOCY 450", "Name": "Demographic Analysis", "Credits": "3", "Description": "Methods of processing and analyzing demographic data. Measures of mortality, fertility, migration and population projections as applied to census and vital statistics data are analyzed, and the more general applications of demographic techniques to other classes of data are illustrated.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56821", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete 9 credits of Sociology or Anthropology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 451", "Name": "Sociology of Health and Illness Behavior", "Credits": "3", "Description": "Analysis of health needs and demands of the population. Examination of health and illness behavior, utilization patterns, and taking into account socio-demographic variations and trends. Topics include mortality and morbidity, health attitudes and behavior, social psychology of illness and patient professional relationships.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56822", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI)", "Prerequisite/Corequisite": " You must complete nine credits of Sociology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 452", "Name": "Health Care Organization and Delivery", "Credits": "3", "Description": "Current issues are reviewed in health care organization, delivery and financing in the United States and the various policies and approaches that impact the changing health care delivery system. Particular emphasis is placed on the implications of technological developments and the increasingly competitive environment in alternative aspects of health care.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50139", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HAPP 452 ", "Prerequisite/Corequisite": "You must complete HAPP 100 and (HAPP 300 or SOCY 300) all with a ‘C’ or better."}, {"Course": "SOCY 454", "Name": "Comparative Health Systems", "Credits": "3", "Description": "A comparative analysis of different types of health systems in the United States and selected other nations, examining differences in financing, cost, utilization, staffing, services provided and relations with other social institutions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56823", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Sociology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 455", "Name": "Disability and Rehabilitation", "Credits": "3", "Description": "Conceptualization and measurement of disability, determinants and consequences of disabling chronic conditions, services for the disabled, and program planning and evaluation in disability and rehabilitation. The development of Social Security policy and rehabilitation will be discussed in terms of interdisciplinary approaches.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56824", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Sociology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 457", "Name": "Social History of American Medicine", "Credits": "3", "Description": "The history of American health care, hospitals and ambulatory care facilities, the role of government, public health programs, and social issues such as smoking and abortion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50156", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "HIST 450 ", "Prerequisite/Corequisite": "You must complete one Social Science, Biology, or Chemistry course and your academic standing must be junior."}, {"Course": "SOCY 458", "Name": "Sociology of Mental Health and Illness", "Credits": "3", "Description": "The course examines the social history of mental health: the concepts and treatments employed, the professional’s role, the role of social class in mental illness, social factors in psychopathology, stress, social support and coping processes, along with sociological critiques of mental health practices. More contemporaneously, to examine de-institutionalization and the community mental health movement, the relationship between mental illness and the criminal justice system, and lastly, the mental patients’ rights movement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56825", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete SOCY 351 with a minimum grade of ‘C’ and your academic standing must be junior."}, {"Course": "SOCY 459", "Name": "The Sociology of Fertility", "Credits": "3", "Description": "This course focuses on the social and economic factors that determine fertility in developed, as well as developing countries. Special attention is given to age, age at marriage, education, labor force participation, race and ethnicity, and the overall relationship between female status and fertility. Issues such as abortion, sterilization abuse, family planning, population control and teenage pregnancy also are covered in the course. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56826", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete SOCY 351 with a minimum grade of ‘C’ and your academic standing must be junior."}, {"Course": "SOCY 470", "Name": "Social Ties across the Life Course", "Credits": "3", "Description": "This course explores the nature and meaning of individuals’ ties to other members of society from childhood to old age. Specifically, the course examines social ties, networks, and roles across the life span in the context of topics such as the life course (e.g., socialization and transitions), family groups, work and social capital, and friends/leisure. We will examine these topics in light of societal change and their implications for inequality.", "Grading": "Graded", "Course ID": "102176", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " Must have completed 9 credits of upper level SOCY or ANTH courses with a minimum grade of ‘C’ and academic level must be junior or senior."}, {"Course": "SOCY 472", "Name": "Issues in Aging Policy", "Credits": "3", "Description": "This course addresses salient issues in aging policy and provides students with a context for understanding the public policy process. The course will explore theoretical models of public policy and will apply them to aging policy, examine major public-policy controversies facing the aging society, study the role of organizations in the policy process, provide tools for analyzing social policies in aging, and expose students to key literature in aging and social policy.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56828", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete nine credits of Sociology each course with a minimum grade of ‘C’ and your academic level must be junior."}, {"Course": "SOCY 496", "Name": "Internship Experience and Analysis", "Credits": "3", "Description": "Students will serve as interns, particularly in nonprofit organizations appropriate to their career interests, with supervision provided by the placement location and the internship coordinator. They will systematically analyze their internship experience in the organization in light of relevant sociological perspectives (structural-functional, interactional, conflict) and theoretical models of organizational effectiveness, applied to the functioning of their assigned work unit and their own effectiveness as interns.", "Grading": "Graded", "Course ID": "56830", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SOCY 497", "Name": "Selected Topics in Sociology", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56831", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must complete ANTH 211 or SOCY 101 and, in addition, 9 credits in Sociology or Anthropology. Each course must have a minimum grade of ‘C’."}, {"Course": "SOCY 498", "Name": "Seminar in Medical Sociology", "Credits": "3", "Description": "Current issues in medical sociology with contributions from faculty members, guest speakers and students. Topics will be published in the Schedule of Classes. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56832", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Eldercare/Welfare State, Social Organization-Work"}, {"Course": "SOCY 499", "Name": "Independent Study", "Credits": "1", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56833", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete 12 credits of Sociology with a minimum grade of ‘C’ for each class."}, {"Course": "SPAN 101", "Name": "Elementary Spanish I", "Credits": "4", "Description": "An introduction to Spanish based on real-life situations. Comprehension and basic speaking skills are emphasized. Some reading and writing is required, as well as an introduction to various aspects of Spanish speaking societies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56979", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "SPAN 102", "Name": "Elementary Spanish II", "Credits": "4", "Description": "A continuation of SPAN 101. Emphasis is on extending skills in everyday spoken Spanish.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56981", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": " You must complete SPAN 101 with a grade of C or better before taking this class or have completed 2 years of High School Spanish."}, {"Course": "SPAN 103", "Name": "Intensive Review of Elementary Spanish", "Credits": "4", "Description": "Designed for students who have completed level III in high school and who, nevertheless, are unprepared for  SPAN 201 either as a result of an interruption of at least five years since their study of the language or as a result of a weak language background. This course offers an intensive review of Elementary Spanish I and II as an opportunity to improve the student’s listening, speaking, reading and writing skills. SPAN 103 or SPAN 102, but not both, may be used toward UMBC’s GFR language/culture requirement.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56983", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)"}, {"Course": "SPAN 201", "Name": "Intermediate Spanish I", "Credits": "4", "Description": "A continuation of SPAN 101 and SPAN 102 with an increased emphasis on reading, writing and cultural knowledge. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56985", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "201 Level Language Requirement (GEP), 201-Level Foreign Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 102 or SPAN 103 with a grade of C or better before taking this class or have completed 3 years of High School Spanish."}, {"Course": "SPAN 202", "Name": "Intermediate Spanish II", "Credits": "4", "Description": "A continuation of SPAN 201 with a strong emphasis on grammar, writing, reading, listening and speaking based on authentic materials, including short films. In-class discussions in Spanish on current topics related to Hispanic societies and cultures in the framework of intercultural communicative competency. Note: This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56988", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 201 with a C or better before taking this class or have completed 4 years of high school Spanish."}, {"Course": "SPAN 300", "Name": "Special Projects in Spanish Language", "Credits": "1", "Description": "Open to students with special projects on application to the instructor who will supervise the particular project. Credits earned in SPAN 300 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of Spanish studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLL. This course is repeatable for credit. Note: All students must request permission to register and it must be in writing and must specify the number of credits sought.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56993", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "SPAN 301", "Name": "Advanced Spanish I", "Credits": "3", "Description": "An advanced Spanish language course in the four language skills (listening, reading, speaking and writing) with focus on sociocultural issues in the Spanish-speaking world. In addition to regular oral practice, the course will include such activities as formal oral presentations, intensive and extensive reading, and a fair amount of expository writing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56995", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": " You must complete SPAN 202 or SPAN 202H with a grade of C or better before taking this class."}, {"Course": "SPAN 302", "Name": "Advanced Spanish II", "Credits": "3", "Description": "A continuation of SPAN 301 with more attention devoted to the development of writing skills. A formal final expository essay is required.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56996", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 301 with a grade of C or better before taking this class."}, {"Course": "SPAN 303", "Name": "Topics in Spanish", "Credits": "3", "Description": "Advanced work in the development of language skills in Spanish. A predetermined semester topic constitutes the basis for further work in the use of spoken and written Spanish. Emphasis will be on reading and on an active use of Spanish involving carefully thought-out and expressed communication in appropriate style. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56997", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 301 or SPAN 304 with a grade of C or better before taking this class."}, {"Course": "SPAN 304", "Name": "Spanish for Heritage Spanish Speakers I", "Credits": "3", "Description": "A course specially designed for heritage speakers of Spanish with no formal training in the language on the college level. The course will focus on Spanish grammar, reading and writing, and Latino/Hispanic culture and current events in the Spanish-speaking world. Recommended Preparation:  Permission of instructor. Note: This course may be used in lieu of SPAN 301 toward the MLL major or minor with concentration in Spanish.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56998", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Language (GFR)"}, {"Course": "SPAN 305", "Name": "Spanish for Heritage Spanish Speakers II", "Credits": "3", "Description": "This course provides language instruction that is specific to the linguistic needs of heritage Spanish speakers. The focus is on vocabulary development, orthography, and grammar through reading and writing. Topics addressed include issues relating to Hispanics/Latinos in the U.S. and their cultural and historic roots in Latin America and Spain. Note: This course may be taken as a continuation of SPAN 304 or by heritage Spanish speakers who have more extensive experience with the language. It may be used in lieu of SPAN 302 toward the MLL major or minor with concentration in Spanish.", "Grading": "Graded/Pass Fail", "Course ID": "56999", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPAN 307", "Name": "España y sus Culturas I", "Credits": "3", "Description": "This course is organized around a historical focus on Spain and its diverse cultures. Through readings and discussion, the course explores aspects of the country’s history, politics, cultural achievements and current life. It also seeks to develop students’ reading, writing, speaking and listening comprehension. For non-native speakers, SPAN 302 should be taken prior to or at the same time as this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57000", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 301 or SPAN 304 with a grade of C before taking this class."}, {"Course": "SPAN 308", "Name": "Latinoamérica y sus Culturas I", "Credits": "3", "Description": "This course is organized around a historical focus on Latin America and its diverse cultures. Through readings and discussion, the course explores aspects of the region’s history, politics, cultural achievements and contemporary life. It also seeks to develop students’ reading, writing, speaking and listening comprehension. This course is repeatable for credit. Note: For non-native speakers, SPAN 302 should be taken prior to or at the same time as this course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57002", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Culture (GEP), Culture (GFR), Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 301 or SPAN 304 with a grade of C before taking this class."}, {"Course": "SPAN 309", "Name": "Business Spanish", "Credits": "3", "Description": "A course designed for students with an intermediate knowledge of Spanish who wish to study business or who wish to become acquainted with the language of business. The course introduces business terminology and concepts and covers basic letter reading and writing.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57003", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 202 or SPAN 202H with a grade of C or better before taking this class."}, {"Course": "SPAN 311", "Name": "España y sus Culturas II", "Credits": "3", "Description": "This course is organized around a literary focus on Spain and its diverse cultures. The course stresses the skill of close critical reading and the relations among literary texts, their social contexts, and other cultural manifestations. It also seeks to develop students’ reading, writing, speaking and listening comprehension.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57004", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed SPAN 302 or SPAN 305 with a grade of C or better before taking this class."}, {"Course": "SPAN 312", "Name": "Latinoamérica y sus Culturas II", "Credits": "3", "Description": "This course is organized around a literary focus on Latin America and its diverse cultures. The course stresses the skill of close critical reading and the relations among literary texts, their social contexts, and other cultural manifestations. It also seeks to develop students’ reading, writing, speaking and listening comprehension.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57006", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": " You must have completed SPAN 302 or SPAN 305 with a grade of C or better before taking this class."}, {"Course": "SPAN 319", "Name": "Spanish Translation", "Credits": "3", "Description": "Spanish translation. An introduction to the practice and techniques of translation between Spanish and English. Students work with various written materials covering many fields.", "Grading": "Graded/Audit", "Course ID": "100504", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed SPAN 302 or SPAN 305 with a grade of C or better before taking this class."}, {"Course": "SPAN 331", "Name": "The Structure of Spanish", "Credits": "3", "Description": "An investigation of the phonological, morphological, and syntactic processes of Spanish, including dialectal variation. Recommended Preparation: LING 210.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57010", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed SPAN 302 and MLL 190 with a grade of C or better."}, {"Course": "SPAN 341", "Name": "Theatre in Spanish", "Credits": "3", "Description": "The rehearsal and performance in Spanish of a full-length play (or several shorter works). Students participate as actors and/or assist in tasks of production. They also investigate areas pertinent to the play, such as the life and work of the playwright, historical and cultural milieu depicted, theories and techniques of staging.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57012", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 301 with a grade of C or better before taking this class."}, {"Course": "SPAN 400", "Name": "Special Projects in Spanish", "Credits": "1", "Description": "Open to students with special projects on application to the instructor who will supervise the particular project. Request for permission to register must be in writing and must specify the number of credits sought. Credits earned in SPAN 400 may not be used to satisfy the basic requirements for any track in the MLL major, minor or certificate of Spanish studies. Exceptions will be granted only with the written permission of an instructor and the chair of MLL. This course is repeatable for credit.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57015", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "SPAN 401", "Name": "Studies in Spanish Language", "Credits": "3", "Description": "Advanced training in oral and written communication in Spanish. This course is repeatable for credit. Note: It is recommended that majors take this course during their senior year.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57017", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Writing Intensive (WI), Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 302 or SPAN 305 and 3 additional classes from the following; SPAN 307, SPAN 308, SPAN 309, SPAN 311, SPAN 312, SPAN 319, SPAN 331, SPAN 341 and any SPAN 400 - level SPAN course all with a grade of C or better before taking this class."}, {"Course": "SPAN 421", "Name": "Studies in Hispanic Literature", "Credits": "3", "Description": "A seminar on a selected topic in Hispanic/Spanish literature. Past offerings include modern Cuban literature. Hispanic/Latino literature in the U.S., Latin American women writers, contemporary Latin American narrative, the Generations of ‘98 and ‘27, Galdos, and Don Quijote. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57018", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must complete SPAN 311 or SPAN 311H and SPAN 312 or SPAN 312H wit a grade of C or better before taking this class."}, {"Course": "SPAN 438", "Name": "Studies in Spanish Linguistics", "Credits": "3", "Description": "Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57021", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Linguistic Diversity, Studies In Spanish Ling", "Attributes": "Language (GFR)"}, {"Course": "SPAN 461", "Name": "Hispanic Language and Culture for Foreign Language Teachers I", "Credits": "3", "Description": "A reading and discussion course conducted in Spanish that examines broad aspects of contemporary life in the Spanish-speaking world through the use of authentic texts and materials including advertisements, newspaper and magazine articles, short stories and plays, poems, films and music. Weekly topics include cross-cultural values, gender roles and the family, youth and education, the individual and society. Readings on teaching foreign cultures to American students and developing lesson plans are included. Recommended Preparation:  Permission of instructor. Note: Open only to foreign language teachers.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57022", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPAN 462", "Name": "Hispanic Language and Culture for Foreign Language Teachers II", "Credits": "3", "Description": "The course seeks to enhance advanced communication skills in Spanish through study of authentic current usage. Coursework will include examining written and oral texts, film and video for examples of current linguistic practice, reading relevant articles on pedagogy and developing lesson plans for application to the teacher’s foreign-language classroom. Note: Only open to foreign-language teachers. May be taken concurrently with SPAN 461.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57023", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPAN 471", "Name": "Topics in Spanish Society", "Credits": "3", "Description": "A seminar on a selected topic in Spanish society. Past offerings include post-Franco Spain, the Spanish Civil War, modernization and tradition, nationalism and regionalism. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57024", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": " You must have completed SPAN 302 or SPAN 305, in addition you must have completed SPAN 308 and one other 300 or 400-level SPAN course all with a grade of C or better."}, {"Course": "SPAN 472", "Name": "Topics in Latin American Society", "Credits": "3", "Description": "A seminar on a selected topic in Latin-American society. Past offerings include social movements, human rights, indigenous populations, globalization, immigration and transnational families, gender relations, women in politics, contemporary Mexico, and the Latin diaspora in the U.S. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 9 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57025", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Chicano/Chicana History, 100 Yrs Cont Mexican His, Cultura Caribena Hispan, Human Rights Latin Amer, Latin Amer Women In Pol, Cont Latn Amer Soc Mov, Mexico To Beijing, Mexican Women 20Th Cent, Top Lat Am Civ:Lang Inst, Topics In Latin Amer Civ, Women & Poli In Latn Am, Topics Latn Amer Civ, Women & Latin Am Politic, Social Movement Latin Am, America Indigena, Women & Poli Latin Amer, Indigenous Latin America, Top:Chrncles Of Conquest, Women & Politics, Transnational Family, Challenges Andean Region, America Indigena, Top:U.S. & Nicaragua, Top:Lat Am Nationality, Gender Rela Latin Amer, Mexico In The 20Th Cent, Globalizacion Latn Amer, Gender/Econ Global Mex, Gender/Econ Global, Latino Immigrants in the US, Intercultural Latin America, La mujer mexicana en contexto, Socio-Environmental Conflicts, Inmigración Latina, Latin American Feminisms", "Attributes": "Language (GFR)", "Prerequisite/Corequisite": "You must have completed SPAN 302 or SPAN 305, in addition you must have completed SPAN 308 and one other 300 or 400-level SPAN course all with a grade of C or better."}, {"Course": "SPCH 100", "Name": "Public Communication", "Credits": "3", "Description": "Preparation and practice in forms of oral communication. Emphasis is upon formal speaking in small-group and public address formats. Units to include selection of materials, organization, outlining, word choice, delivery and development of simple visual aids, and listening skills.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57033", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "SPCH 100A", "Name": "Public Communication (Allied Health Students)", "Credits": "3", "Description": "Preparation and practice in forms of oral communication. Emphasis is upon formal speaking in small-group and public address formats. Units to include selection of materials, organization, outlining, word choice, delivery and development of simple visual aids and listening skills.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57034", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "SPCH 100, SPCH 100H "}, {"Course": "SPCH 100H", "Name": "Public Communication - Honors", "Credits": "3", "Description": "Preparation and practice in forms of oral communication. Emphasis is upon formal speaking in small-group and public address formats. Units to include selection of materials, organization, outlining, word choice, delivery and development of simple visual aids and listening skills.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57035", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GFR)"}, {"Course": "SPCH 210", "Name": "Interpersonal Communication", "Credits": "3", "Description": "Study in one-to-one and small group communication process and theory. Emphasis is placed on how the individual relates to others on verbal and nonverbal levels in task and social relationships. Attention is given to such units as self and personality, semantics, kinesics, proxemics, disclosure theory, conflict and group problem-solving.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57039", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPCH 210E", "Name": "Interpersonal Communication for ESL Students", "Credits": "3", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57040", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPCH 220", "Name": "Small Group Communication", "Credits": "3", "Description": "Small-group communication is designed for students wishing to strengthen communication skills in various small group situations. Theory, practice and analysis are combined as students participate in discussion and task-oriented groups. The class is interdisciplinary in focus, and topics cover a range of issues. The class involves some field work in business, community and political settings. Video taping is used to allow students to observe themselves in the group interaction.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57044", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "SPCH 301", "Name": "Methods of Teaching Speech and Drama in the Secondary School", "Credits": "3", "Description": "Class plans, units and courses of study for teaching speech, oral interpretation and drama in high school. Objectives of speech and drama education, evaluation of performances, choice of plays for high schools and methods of directing high school dramatic activities.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50068", "Consent": "Department Consent Required", "Components": "Lecture", "Same as Offered": "EDUC 423"}, {"Course": "STAT 121", "Name": "Introduction to Statistics for the Social Sciences", "Credits": "4", "Description": "Introduction to statistical methods common to social science applications. Topics include descriptive statistics, elementary probability theory, concepts of sampling and principles of statistical inference. Note: Not open to students who have passed a higher level statistics course with a grade of “C” or better. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57048", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have scored a 3, 4 or 5 on the LRC MATH placement exam or passed MATH 106 or Math 104 with a grade of ‘C’ or better to enroll in this course."}, {"Course": "STAT 290", "Name": "Special Topics in Statistics", "Credits": "1", "Description": "A special topics course covers material that is not available in a regular course, but is suitable for coverage at this level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57050", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "STAT 299", "Name": "Independent Study in Statistics", "Credits": "1", "Description": "", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57051", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "STAT 350", "Name": "Statistics with Applications in the Biological Sciences", "Credits": "4", "Description": "Organization and presentation of data, summary of descriptive measures, probability, binomial and normal distributions, sampling natural populations and the estimation of population parameters, hypothesis testing, chisquare analysis experimental designs and the analysis of variance, linear regression and correlation, and nonparametric statistics. Students will be introduced to statistical computing. All the statistical procedures will be illustrated using data from biology and the health sciences. Note: Not open to students who have passed or are concurrently taking STAT 351, STAT 355, Stat 356, STAT 453 or CMPE 320. This course does not satisfy the statistics requirement for CMSC majors and does not qualify as part of the math major or minor.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57052", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": " You must have completed one of the following with a grade of ‘C’ or better MATH 150 or MATH 151 or MATH 152 or MATH 155 or MATH 225 or MATH 251 or have placed into MATH 151 through the LRC Math exam."}, {"Course": "STAT 351", "Name": "Applied Statistics for Business and Economics", "Credits": "4", "Description": "Organization and presentation of data, summary of descriptive measures, probability, binomial, normal distributions and Pareto distribution, estimation of population parameters, sampling distributions, hypothesis testing, chi-square analysis, analysis of variance, linear regression and correlation, index numbers, time serried analysis and forecasting. Students will be introduced to statistical computing. All the statistical procedures will be illustrated using data from management, business and economics. Note: Not open to students who have passed or are concurrently taking STAT 351, STAT 355, STAT 453 , STAT 356, STAT 453 or CMPE 320. This course does not satisfy the statistics requirement for CMSC majors and does not qualify as part of the math major or minor. This course may be subject to a Course Materials Charge. The charge may vary by semester, depending on the course materials required. The Course Materials Initiative (CMI) was established to provide students with more affordable course materials, enhance the students’ experience on a common digital platform via Blackboard, and position UMBC to be ahead of the curve with digital content.  More information is available at UMBC Bookstore’s website.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57053", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Attributes": "Mathematics (GEP), Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed one of the following with a grade of ‘C’ or better MATH 150 or MATH 151 or MATH 152 or MATH 155 or MATH 225 or MATH 251 or have placed into MATH 151 through the LRC Math exam."}, {"Course": "STAT 355", "Name": "Introduction to Probability and Statistics for Scientists and Engineers", "Credits": "4", "Description": "An introduction to applied statistics designed for science majors and others with demonstrated quantitative ability. Topics include nature of statistical methods, random variables and their distribution functions, general principles of estimation and hypothesis testing. A laboratory introduces students to computer techniques in statistical analysis. Note: Not open to students who have passed with a grade of “C” or better or are currently taking STAT 350, STAT 351, STAT 355H , STAT 453 or CMPE 320 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57054", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": " STAT 355H", "Attributes": "Mathematics (GFR)", "Prerequisite/Corequisite": "You must have completed MATH 142 or MATH 152 or MATH 225 or MATH 251 with a grade of ‘C’ or better and must not have taken or be enrolled in STAT 350 , STAT 351 , STAT 355H , STAT 453 or CMPE 320 ."}, {"Course": "STAT 355H", "Name": "Introduction to Probability and Statistics for Scientists and Engineers-Honors", "Credits": "4", "Description": "An introduction to applied statistics designed for science majors and others with demonstrated quantitative ability. Topics include nature of statistical methods, random variables and their distribution functions, general principles of estimation and hypothesis testing. A laboratory introduces students to computer techniques in statistical analysis. Note: Not open to students who have passed with a grade of “C” or better or are currently taking STAT 350 , STAT 351 , STAT 355 , STAT 453 or CMPE 320 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "101986", "Consent": "No Special Consent Required", "Components": "Discussion, Lecture", "Course Equivalents": "STAT 355 ", "Prerequisite/Corequisite": "You must be admitted to the Honors College and have completed MATH 142 or MATH 152  or MATH 225  or MATH 251  with a C or better."}, {"Course": "STAT 365", "Name": "Financial Mathematics for Actuaries", "Credits": "3", "Description": "This course is an introduction to the mathematics of interest and the evaluation of interest related products including annuities with non-contingent payments, loans, bonds, general cash flows, portfolios, and immunization.  Additional topics discussed include sources of interest rates, stochastic interest rates, and financial instruments such as shorts, swaps, and options.  This material includes most of the learning objectives for the Financial Mathematics Exam (called Exam FM by the Society of Actuaries and Exam 2 by the Casualty Actuarial Society.)  Also students not necessarily interested in taking the actuarial exam are encouraged to take this course as an upper level elective.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102303", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "MATH 365 ", "Prerequisite/Corequisite": "You must complete MATH 152 with a C or better."}, {"Course": "STAT 405", "Name": "Survey Sampling", "Credits": "3", "Description": "Sampling versus total enumeration, planning of sample surveys, simple random sampling, stratified sampling, systematic sampling, cluster sampling, double and multistage sampling, variance estimation, problem of nonresponse and practical case studies.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57056", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 453 with a grade of C or better."}, {"Course": "STAT 414", "Name": "Environmental Statistics", "Credits": "3", "Description": "The purpose of this course is to study statistical methods used in environmental applications. This course includes a brief review of the basic methods of inference for percentiles, means and differences in mean with special emphasis on non-parametric methods, which are used widely in environmental applications. The course will cover the following topics: analysis of variance, estimation of components of variance and regression methodology using environmental data. Methods of analyzing data with observations that are below detection limits. Parametric and non-parametric methods of estimating trends in seasonal and auto-correlated data. Sampling methods that are particularly useful in environmental applications will be discussed.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57057", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed STAT 350 or STAT 351 or STAT 355 or STAT 451 with a grade of C or better."}, {"Course": "STAT 417", "Name": "Introduction to Time Series Data Analysis", "Credits": "3", "Description": "Concepts in time series analysis, such as stationarity; some commonly used time series models, such as autoregressive moving average models, are introduced using examples. Time series data analysis tools, namely, auto-correlation function (ACF), partial autocorrelation function (PACF), detrending, differencing and forecasting will be discussed using real data sets. Some selected topics from time series modeling, such as transfer function models and intervention models, will be discussed. Data analysis using statistical software such as SPLUS will be an integral part of the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57058", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 355 or STAT 453 with a grade of C or better."}, {"Course": "STAT 418", "Name": "Applied Multivariate Methods", "Credits": "3", "Description": "Topics include multiple regression, partial and multiple correlations, the multivariate normal distribution, statistical inference for mean vector and covariance matrix, multivariate analysis of variance, principal components, canonical correlations, discriminant analysis, factor analysis and cluster analysis use of statistical packages. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57059", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed MATH 221 and either STAT 355 or STAT 453 with a grade of “C” or better."}, {"Course": "STAT 419", "Name": "Introduction to Biostatistics", "Credits": "3", "Description": "Topics include an introduction to statistics used in epidemiologic studies and clinical trials, measures of association, logistic regression, co-variate adjustment, introductory life table analysis, Cox regression, randomization techniques, ethics in human experimentation and statistical analysis using SAS. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57060", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Intro To Biostatistics", "Prerequisite/Corequisite": " You must have completed STAT 454 with a grade of ‘C’ or better before you can take this course."}, {"Course": "STAT 420", "Name": "Statistics for Bioinformatics", "Credits": "3", "Description": "This course surveys the statistical methodology underlying current bioinformatics techniques. Topics to be covered include: dynamic programming, including the Needleman-Wunsch algorithm and Smith-Waterman algorithm; methods of inference, including maximum likelihood and Bayesian approach; Markov models, including Markov chains, hidden Markov models and inferences for these models; Monte-Carlo Markov chain methods, including Gibbs sampling and Metropolis-Hastings algorithm; extreme-value theory, including Gumbel distribution and significance of alignments; cluster analysis, including hierarchical methods, Kmeans method and determination of number of clusters; classification methods, including CART algorithm and QUEST algorithm; generalized linear models, including model types, inference and statistics for model fit; model validation, crossvalidation; and predictive assessment.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57061", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed MATH 152 and either STAT 350 or STAT 355 with a grade of “C” or better."}, {"Course": "STAT 432", "Name": "Statistical Computer Packages and Their Applications: SAS and R", "Credits": "1", "Description": "The student will become familiar with SAS and R, two widely used powerful statistical software package. They can handle most data analysis issues ranging from simple data exploration to advanced modeling. Students will learn basic modeling and programming and implement their knowledge by completing analysis projects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57062", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 350 or  STAT 351 or STAT 355 or  STAT 451  or STAT 453 with a grade of C or better."}, {"Course": "STAT 433", "Name": "Statistical Computing", "Credits": "3", "Description": "Topics include pseudo-random numbers and tests for pseudo-randomness, sampling methods, direct methods, rejection sampling, variance reduction importance sampling, stochastic simulation methods, randomization tests, and the jackknife and the bootstrap. Additional topics such as Gibbs sampling, Markov chains, Monte-Carlo and EM algorithm may be covered.", "Grading": "Graded", "Course ID": "57063", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed STAT 355 or STAT 453 with a grade of C or better."}, {"Course": "STAT 451", "Name": "Introduction to Probability Theory", "Credits": "3", "Description": "Topics include probability spaces and probability calculus, random variables and their distribution functions, the calculus of expectations, characteristic functions and large sample theory. Recommended Preparation: CMSC 203 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57064", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed MATH 251 with a grade of “C” or better before you can take this course."}, {"Course": "STAT 453", "Name": "Introduction to Mathematical Statistics", "Credits": "3", "Description": "Principles of statistical decision theory, theories of estimation and hypothesis testing, optimality, power functions, estimation by confidence intervals and decision-making.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57066", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed STAT 451 with a grade of C or better."}, {"Course": "STAT 454", "Name": "Applied Statistics", "Credits": "3", "Description": "Introduction to statistical computing and statistical computation packages: BMD and SPSS. Multiple regression and correlation analysis, analysis of variance and covariance, non-linear regression, contingency table analysis, design of experiments, and robust and non-parametric methods. Note: Approved by the Society of Actuaries to satisfy its Validation by Educational Experience (VEE) in Applied Statistical Methods.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57067", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 350 or STAT 351 or STAT 355 or STAT 453 with a grade of C or better."}, {"Course": "STAT 455", "Name": "Design of Experiments and Quality Controls", "Credits": "3", "Description": "Topics include principles of experimental design, randomized designs and analysis of variance, Latin square designs, incomplete block designs, factorial designs, control charts for variables and attributes, cusum chart, acceptance sampling, response surface methodology and the Taguchi approach to parameter designs.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57068", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed STAT 453 with a grade of C or better."}, {"Course": "STAT 470", "Name": "Probability for Actuarial Science", "Credits": "1", "Description": "This brief course is intended to prepare students to take Society of Actuaries Exam Course P/1 Probability.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57069", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": " You must have completed STAT 451 with a grade of C or better."}, {"Course": "STAT 490", "Name": "Special Topics in Statistics", "Credits": "1", "Description": "A special topics course covers material that is not available in a regular course, but is suitable for coverage at this level. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 8 credits. Recommended Preparation: STAT 355 or STAT 451 or STAT 453.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57070", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Intro To Bioinformatics, Data Mining, Special Topics In Stat, Biostatistics, Prob Theory Actuarial Sc, Statistical Data Mining, Intro To Data Mining, Math Models In Evol Biol, Bayesian Analysis, Intro To Bayesian Stat, Plan For Env Data Collec, Stochastic Methods"}, {"Course": "STAT 496", "Name": "Statistics Practicum", "Credits": "1", "Description": "Under faculty direction, students will write a report dealing with statistical concepts or techniques utilized or implemented in internships, cooperative education or in the workplace. This course is repeatable for credit. Students may complete a maximum of 16 credits or 4 attempts. Recommended Preparation:  Permission of the instructor.", "Grading": "Graded", "Course ID": "57071", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "STAT 497", "Name": "Senior Thesis", "Credits": "3", "Description": "The student will be required to prepare an exposition of either a significant area of statistics or of the results of a student research project. Typically, the former will be in connection with an upper-division course the student has completed or independent study (STAT 499). This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "57072", "Consent": "No Special Consent Required", "Components": "Thesis Research"}, {"Course": "STAT 499", "Name": "Independent Study in Statistics", "Credits": "1", "Description": "Under this heading, a student may agree to a course with a particular faculty member on a topic not covered in the regular curriculum. The arrangements with the faculty member must be made before the student registers for the course.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57073", "Consent": "No Special Consent Required", "Components": "Independent Study"}, {"Course": "THTR 100", "Name": "Stagecraft", "Credits": "3", "Description": "An introductory course in the creation of scenery for the stage. The course introduces concepts in construction procedures, production techniques, safety, properties, scenic painting, and stage lighting. Lab hours reinforce these concepts through work on specific projects that develop skills required for further study and projects on departmental productions.", "Grading": "Graded", "Course ID": "57120", "Consent": "No Special Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 104", "Name": "Costume Construction", "Credits": "3", "Description": "The course examines the costume construction process for stage starting from pattern to completed garment. Students will have a thorough introduction to garment construction techniques, safety concerns, textiles, wardrobe, and costume shop practices. Lab hours reinforce these concepts through work on specific projects that develop skills required for further study and projects on departmental productions.", "Grading": "Graded", "Course ID": "57121", "Consent": "Department Consent Required", "Components": "Laboratory, Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 110", "Name": "Introduction to Acting", "Credits": "3", "Description": "Beginning elements of the acting process. Elementary work in the use of texts and physical exploration to gain basic acting tools. This course is intended for theatre majors and minors not pursuing advanced studies in acting and non-majors.", "Grading": "Graded", "Course ID": "57122", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 120", "Name": "Introduction to Theatre: Theory and Production", "Credits": "3", "Description": "A gateway course for all theatre majors designed to increase the students’ knowledge of how theatre works. Attention is given to dramatic literature and theatre history, as well as to how live theatre is created through collaborative process including the roles of actors, directors, writers, designers, and technicians. Emphasis is placed on collaborative student projects.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57126", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "THTR 120H "}, {"Course": "THTR 120H", "Name": "Introduction to Theatre - Honors", "Credits": "3", "Description": "A course designed to increase the student’s awareness and enjoyment of theatre. Attention is given to conventional forms of drama and newer kinds of performance with attention to their sources in theatre history. The students become familiar with how theatre is made and the people who make it: actor, director, writer and designer. The nature of the audience and the relationship of theatre to society are discussed. The students read plays and see films, plays and other theatre events at UMBC and around Baltimore.", "Grading": "Graded", "Course ID": "57127", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Same as Offered": "THTR 120 "}, {"Course": "THTR 202", "Name": "Introduction to Dramatic Literature", "Credits": "3", "Description": "This course has two primary goals. The first is to familiarize students with basic methods of reading and analyzing plays. The second is to expose students to a significant number of dramatic texts. Assigned readings, while including classic works, will focus on dramatic literature from the late-19th century to the present.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57131", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)"}, {"Course": "THTR 204", "Name": "The American Musical", "Credits": "3", "Description": "This course will follow the changing form and content of the American musical. After a brief summary of early American musical plays, revues and operettas, the major part of this course will concentrate on innovations that have changed these old forms into the modern musical. These changes also will reflect changing social patterns in the United States. Some original sources will be compared with the resulting musicals. Films, recordings and live singers will be used in the class.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "57132", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "THTR 220", "Name": "Craft of Acting I", "Credits": "3", "Description": "A foundational studio course for students intending to declare the BFA Acting major.  Students engage in exercises designed to strengthen concentration, focus, sense and emotional memory, and access to the unconscious. Individual and group work develop sensitivity to impulses, gesture, and rhythm.", "Grading": "Graded", "Course ID": "57136", "Consent": "Department Consent Required", "Components": "Lecture"}, {"Course": "THTR 221", "Name": "Craft of Acting II", "Credits": "3", "Description": "Continuation of THTR 220, moving the elements of craft toward specific ideas of performance, the basic act toward the concept of dramatic action. Defining motives for acting: act how? For whom? Under what circumstances? To what end?", "Grading": "Graded", "Course ID": "57137", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete THTR 220 and THTR 222 with a grade of “C” or higher."}, {"Course": "THTR 222", "Name": "Vocal Training for the Actor I", "Credits": "3", "Description": "A gateway course for students intending to declare the Acting, B.F.A. Exercises that focus on breathing, releasing muscular tension throughout the body, and finding the organic connection between feeling and sound production expand the vocal range, power and imagination of the actor. Students learn the rudiments of anatomy and physiology in relation to vocal production. Acting improvisations and poetry direct the actor to greater expression. This course is repeatable for credit. Students may complete a maximum of 6 credits.", "Grading": "Graded", "Course ID": "57138", "Consent": "No Special Consent Required", "Components": "Lecture"}]