[{"Course": "PHIL 355", "Name": "Political Philosophy", "Credits": "3", "Description": "A critical examination of selected philosophical theories aimed at addressing such questions as: What is the extent of political authority, and what (if any) legitimate forms can it take? Can coercion by the state be justified? What are the obligations of citizens? What is the nature of law, and can the rule of law extend to states? What understanding of human nature and human needs underlies the various particular answers to such questions? Readings may be drawn from historical as well as contemporary sources. ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56043", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP), Arts and Humanities (GFR)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 356", "Name": "Philosophy of Law", "Credits": "3", "Description": "What is the rule of law, and why is it a good thing? This course addresses these foundational questions and attempts to connect them with practical issues that confront contemporary society. Students will have the opportunity to study various accounts of Constitutional interpretation and judicial review through the examination of landmark and recent Supreme Court decisions. The course will occasionally focus on a special topic such as: race and American law, feminist jurisprudence and International criminal tribunals.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56044", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a grade of ‘C’ or better."}, {"Course": "PHIL 357", "Name": "Philosophy and Human Rights", "Credits": "3", "Description": "A philosophical survey of foundational issues about the existence, nature, and origin of human rights, looking at both classic historical as well as contemporary discussions. Topics to be addressed include: competing accounts of the source of human rights; the connection between human rights and the state; the identification and proliferation of specific human rights; the relationship between human rights and social justice; and the role of human rights claims in discussions of pressing global problems such as poverty, economic development, climate change, humanitarian intervention, and obligations to future generations. Recommended Preparation: PHIL 150  or PHIL 152  or PHIL 355  or PHIL 356  ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102624", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 358", "Name": "Bioethics", "Credits": "3", "Description": "A survey of the ethical constraints on the practice of medicine, biomedical research using human and nonhuman animals, and the delivery of health care. Specific topics will include doctor-patient confidentiality; autonomy, competence, and medical decision-making; ethical issues at the beginning and end of human life; and controversial biomedical technologies such as cloning and stem cell research. Recommended Preparation: PHIL 150 , PHIL 152 ,HAPP 350 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50142", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 358H ", "Attributes": "Arts and Humanities (GEP)", "Same as Offered": "HAPP 358 ", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better"}, {"Course": "PHIL 358H", "Name": "Bioethics", "Credits": "3", "Description": "A survey of the ethical constraints on the practice of medicine, on biomedical research using human and nonhuman animals, and on the delivery of health care. Specific topics will include doctor-patient confidentiality; autonomy, competence and medical decision-making; ethical issues at the beginning and end of human life; and controversial biomedical technologies such as cloning and stem cell research Recommended Preparation: PHIL 150 , PHIL 152 , HAPP 350 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100017", "Consent": "Department Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 358 ", "Same as Offered": "HAPP 358 ", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better."}, {"Course": "PHIL 359", "Name": "Ethics, Integrity and Scientific Research", "Credits": "3", "Description": "This course is a survey of topics concerning the ethical responsibilities of scientists in a variety of contexts, emphasizing issues arising in the context of designing and engaging in scientific research. Students will investigate the key features of different fundamental ethical theories, and then use this background to engage with topics such as: data acquisition and management, conflict of interests and scientific objectivity, misconduct in research and publication, the use of human and other animal subjects in research, the social responsibility of scientists. Recommended Preparation: PHIL 150 and PHIL 152.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102724", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)"}, {"Course": "PHIL 368", "Name": "Aesthetics", "Credits": "3", "Description": "An exploration of central philosophical issues concerning art and art criticism. Topics to be discussed may include the nature of beauty, aesthetic evaluations, the identity of works of art, the relation of art to morality, the relation between art and nature, the status of aesthetic experience and perception. Readings will be drawn from historical and contemporary sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56046", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 369", "Name": "Philosophy of Humor", "Credits": "3", "Description": "A survey of issues related to the question of whether and how humor can be defined and understood. A variety of psychological and philosophical theories of humor and the causes of laughter will be examined. Examples from different media, including stand-up comedy, podcasts, television, and film, will be used to test competing theories. Special attention will be paid to the ethical implications of offensive humor. Readings will be drawn from historical and contemporary sources. Recommended Preparation: PHIL 100 or PHIL 150 or PHIL 152 ", "Grading": "Graded", "Course ID": "102566", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 370", "Name": "Philosophy and Parapsychology", "Credits": "3", "Description": "A survey of experimental and anecdotal evidence for paranormal phenomena and the philosophical issues that arise from their consideration. Topics include ESP, psycho-kinesis, poltergeists, apparitions, survival of death, mind-body identity theories, the nature of scientific explanation and the nature of causality.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56047", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 371", "Name": "Epistemology", "Credits": "3", "Description": "A survey of central issues concerning knowledge, belief and justification. Topics to be covered may include: a priori knowledge, perception, skepticism, the problem of other minds, self-knowledge, coherence and correspondence theories of knowledge and truth, internalist and externalist accounts of justification, foundationalism, naturalism and transcendental arguments. Readings will be drawn from historical and contemporary sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56048", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 372", "Name": "Philosophy of Science", "Credits": "3", "Description": "What is the exact nature of science? This course considers answers given by different philosophical schools. We examine how these schools explicate central scientific terms such as laws, explanations, theories, models, confirmation, justification, scientific progress and scientific revolutions.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56049", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 372H ", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 372H", "Name": "Philosophy of Science - Honors", "Credits": "3", "Description": "What is the exact nature of science? This course considers answers given by different philosophical schools. We examine how these schools explicate central scientific terms such as laws, explanations, theories, models, confirmation, justification, scientific progress and scientific revolutions, and how they account for the nature of the history of science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "100227", "Consent": "No Special Consent Required", "Components": "Lecture", "Course Equivalents": "PHIL 372 ", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better before taking any 300-level PHIL course. You must also be admitted to the Honors College."}, {"Course": "PHIL 373", "Name": "Metaphysics", "Credits": "3", "Description": "A survey of central metaphysical concepts and themes in the Western philosophical tradition. Topics to be covered may include: identity, personal identity, causation, free will, the mind-body problem, properties, laws of nature, necessity, essentialism, realism and antirealism, and the existence of God. Readings will be drawn from historical and contemporary sources.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56050", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 380", "Name": "Philosophy of Mind", "Credits": "3", "Description": "A survey of central issues about the nature of mind and its relation to the physical world. Topics to be discussed may include: the nature of belief, intention, desire, action, emotion, pain; special problems raised by consciousness; competing accounts of personal identity; competing conceptions of the relation between mental and physical states and events, the possibility of psychological laws, and how mental phenomena can play a casual/explanatory role in the physical world.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56073", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Arts and Humanities (GEP)", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 390", "Name": "Philosophy of Sport", "Credits": "3", "Description": "An examination of the nature and significance of sport to determine the relation sport bears to the basic concerns of humankind. Topics include the relationship between human embodiment, the self and sport; the existential aspects of sport and play; the morality of hunting and ethical issues in sport.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56054", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 391", "Name": "The Philosophy of Sex", "Credits": "3", "Description": "An examination of the philosophical aspects of human sexuality. Topics include theories of sexual desire and sexual activity; the concept of sexual perversion; the moral evaluation of sex acts; feminist analysis of the sexual relations between men and women; and the moral status of homosexuality, adultery, pornography and abortion.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50122", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 391"}, {"Course": "PHIL 394", "Name": "Philosophy of Biology", "Credits": "3", "Description": "An examination of biology from a philosophical point of view. Some of the philosophical problems considered are the tautological character of the principle of natural selection, genic vs. group selection, the definition of fitness, the nature of biological species, the statistical character of evolutionary theory, and the reduction of biological laws to laws in physics and chemistry.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56056", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 395", "Name": "Philosophy of Physics", "Credits": "3", "Description": "This course is a survey of central issues in the philosophical foundations of physics. We consider some of the major theories in the history of physics, such as Newtonian mechanics, relativity theory, and quantum mechanics. A special emphasis will be given to the consideration of central concepts in these theories, such as time, space, cause, matter, motion, force, field, geometry and probability, as well as scientific paradoxes arising concerning some of these concepts. No familiarity with physics is required. Recommended Preparation: PHIL 372, PHIL 373.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56057", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHIL 399", "Name": "Topics in Philosophy", "Credits": "3", "Description": "An examination of a central topic, movement or figure in either the history of philosophy or contemporary philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56062", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 399B", "Name": "Topics in Philosophy", "Credits": "3", "Description": "An examination of a central topic, movement or figure in either the history of philosophy or contemporary philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56062", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 400", "Name": "Independent Study in Philosophy", "Credits": "1", "Description": "Independent study on an approved topic in philosophy. Limited to and required of departmental honors candidates. This course is repeatable for credit. Students may complete a maximum of 3 credits.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56063", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete (2) PHIL courses (at least one 300 level), with a grade of “C” or better to take this class."}, {"Course": "PHIL 405", "Name": "Honors Independent Study in Philosophy", "Credits": "3", "Description": "Independent study on an approved topic in philosophy. Note: Limited to and required of departmental honors candidates. (Fall)", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56064", "Consent": "Department Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must earn admission into the departmental honors program to take this course."}, {"Course": "PHIL 406", "Name": "Honors Independent Studies in Philosophy", "Credits": "3", "Description": "See PHIL 405 for course description and prerequisite. Note: Admission into the department Honors Program required.", "Grading": "Graded", "Course ID": "100098", "Consent": "No Special Consent Required", "Components": "Independent Study", "Prerequisite/Corequisite": "You must complete (2) PHIL courses (at least one 300 level), with a grade of C or better to take this class."}, {"Course": "PHIL 420", "Name": "Advanced Topics in 19th and 20th Century European Philosophy", "Credits": "3", "Description": "A study of a major movement, theme, or figure in the development of European philosophy since Kant. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: One 300 level course in philosophy with a grade of C or better, especially PHIL 322.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56065", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 430", "Name": "Decision Theory", "Credits": "3", "Description": "This course is a philosophical examination of decision theory, which attempts to give an account of how we should make decisions whose outcomes depend upon facts about which we are uncertain. Part of the course focuses on puzzle cases where competing approaches to decision making yield different results. Other topics to be considered include whether our best approaches to decision making are psychologically feasible, and whether and how decision theory should accommodate our different attitudes towards risk.  Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 346, PHIL 371, PHIL 372, or PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102682", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better."}, {"Course": "PHIL 432", "Name": "Philosophy of Logic", "Credits": "3", "Description": "This course looks at the philosophical questions that arise when we think about logic as an object of study rather than as a system of symbols that we use. We will consider questions like: What is the logical truth? How do we know the truths of logic? Is there more than one correct logic? What is the relation between logic and reasoning?  We will also explore extensions and alternatives to classical logic and use formal techniques to prove certain things about these logical systems.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102862", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete PHIL 346 or equivalent, with a grade of C or better"}, {"Course": "PHIL 450", "Name": "Metaethics", "Credits": "3", "Description": "A close study of the nature of ethical discourse and its relations to the mind and the world. Topics to be considered include: whether there are ethical facts; naturalism vs. non-naturalism about ethical facts; the relationship between ethical judgments and personal attitudes; whether ethical judgments are inherently motivating; whether ethical judgments can be true or false; moral relativism; moral skepticism. Readings will be drawn from historical and contemporary sources. Recommended Preparation: One 300 level course in philosophy with a grade of C or better, especially PHIL 350 , PHIL 353 , PHIL 380 ", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102570", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 451", "Name": "Consequentialism and its Critics", "Credits": "3", "Description": "According to Consequentialism, the rightness or wrongness of an action, law, or institution is determined by the value of its consequences.  While typically taken for granted in public policy debates, it is often rejected as an adequate moral theory, because it is too demanding in what it requires of moral agents and deviates too far from commonsense morality.  This course starts with its classical formulation - Utilitarianism - and then looks at contemporary variants developed in response to these and other criticisms.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102690", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed one Philosophy course with a grade of ‘C’ or better."}, {"Course": "PHIL 452", "Name": "Advanced Topics in Ethics", "Credits": "3", "Description": "An advanced examination of a topic, figure or movement in the history of ethics or contemporary ethics. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: One 300 level course in philosophy with a grade of C or better, especially PHIL 350, PHIL 355.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56068", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 453", "Name": "The Ethics of Aggregation", "Credits": "3", "Description": "This course looks closely at ethical decisions involving trade-offs, where each decision has a cost, as in the case of a runaway trolley that is going to kill people no matter what you do, but you can decide how many. In such cases should we always do the thing that saves the most lives, or is it unfair to think that the numbers alone determine the ethical issue? Are all lives worth the same, and does this force us to think that only the numbers count? Recommended Preparation: PHIL 150, PHIL 152, PHIL 350, or PHIL 355.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102868", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better."}, {"Course": "PHIL 455", "Name": "Applied Ethics", "Credits": "3", "Description": "An examination of applied and professional ethics, including their relationship to ethical theory, the attempt to codify ethical rules for different professions, the use of case studies as a method of moral reasoning and the dilemmas faced by moral agents who also are acting in a professional role.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56070", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete (2) PHIL courses (at least one 300 level), with a grade of C or better to take this class."}, {"Course": "PHIL 458", "Name": "Advanced Topics in Feminist Philosophy", "Credits": "3", "Description": "A detailed examination of some single field of feminist philosophy. Topics will vary from year to year but are likely to include the following: feminist ethics, feminist epistemology and feminist aesthetics. In each case, the class will focus on the theoretical and practical impact of feminist thinking on these traditional areas of philosophy. We will critically discuss the relevance of women’s lived experience for philosophical theorizing. Recommended Preparation: Two of the following PHIL 258, PHIL 350, PHIL 368, PHIL 371, PHIL 373, PHIL 372, GWST 480  or permission of the instructor", "Grading": "Graded/Pass Fail/Audit", "Course ID": "50120", "Consent": "No Special Consent Required", "Components": "Lecture", "Same as Offered": "GWST 458 "}, {"Course": "PHIL 471", "Name": "Freedom, Determinism, and Responsibility", "Credits": "3", "Description": "A survey of different conceptions of human freedom, moral responsibility, and how they relate to deterministic and indeterministic pictures of the natural world. Topics to be considered may include: the compatibility of freedom and moral responsibility with determinism, the relation between choice and personal identity, the conceivability of life without freedom or responsibility, and competing conceptions of punishment. Readings will be drawn from historical and contemporary sources.  Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 380, PHIL 350, PHIL 371, or PHIL 373.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "056074", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 472", "Name": "Advanced Topics in the Philosophy of Science", "Credits": "3", "Description": "An advanced examination of a topic in the philosophy of science, biology, physics, or probability. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: One 300 level course in philosophy with a grade of C or better, especially PHIL 372, PHIL 394, PHIL 395, or a background in some particular science.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56075", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 473", "Name": "Self-Knowledge", "Credits": "3", "Description": "We seem to know the contents of our own minds – our sensations, thoughts, beliefs, meanings, intentions, emotions – in a way quite different from, and far more secure than, our knowledge of the external world. Some philosophers have concluded that self-knowledge does not depend on either knowledge or the existence of the external world. This course looks at attempts to account for this peculiar feature of the mind as well as its relation to the external world.  Recommended Preparation: One 300-level course in philosophy, especially PHIL 371, PHIL 373, or PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102509", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 474", "Name": "Possible Worlds", "Credits": "3", "Description": "There are numerous ways the world might have been different. Possible worlds provide a way of making sense of this. For every way the world might be there is purported to be a possible world that is that way. Possible worlds have been introduced primarily to deal with modal notions, such as necessity and possibility, but they have also proved fruitful in dealing with a number of other philosophical issues, such as the nature of properties, propositions, causation, laws, and counterfactuals. This course will look at various accounts of what possible worlds are and how they can be used to address various philosophical issues. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 346, PHIL 371, PHIL 372, PHIL 373, or PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102512", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 475", "Name": "Irrationality", "Credits": "3", "Description": "This course looks at problems in understanding irrational mental phenomena - instances where one acts or believes contrary to one’s own best judgment or intention concerning what one should do or think. Topics to be covered include the nature of rationality and irrationality, the possibility and structure of weakness of will, wishful thinking, and self-deception. The bearing of irrational phenomena on questions concerning responsibility and freedom will also be addressed.  Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 353, PHIL 371, PHIL 373, PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102513", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 477", "Name": "Minds, Machines, and Logic", "Credits": "3", "Description": "This course looks closely at the computational theory of mind, which holds that the human mind is a mechanical device that translates experience into representations and then operates on these representations according to their mechanical properties in order to produce thought and behavior. Topics to be considered in evaluating this theory include: the nature of intentionality and representation, the nature and limits of models, the coherence of self-reference, the ambiguity of rules, and the social dimension of concepts. Recommended Preparation: One 300-level course in philosophy, especially PHIL 371, PHIL 373, or PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102591", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 478", "Name": "Philosophy and Evolution", "Credits": "3", "Description": "An examination of central philosophical debates about the theory of evolution, including foundational issues and broader implications of the theory. Topics may include: What is natural selection and ‘survival of the fittest’? In what sense are organisms adapted to their environments? Can we make sense of the idea of ‘human nature’? What does evolutionary theory imply about groupings of individuals? Can evolutionary theory be used to explain social, ethical, or psychological phenomena? Prior knowledge of evolutionary theory is not required. Recommended Preparation: One 300 level course in philosophy, especially PHIL 372 ,PHIL 394 .", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102571", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 479", "Name": "Paradoxes", "Credits": "3", "Description": "The course will examine some of the central paradoxes that have and continue to puzzle philosophers. A classic example of a paradox is the liar’s paradox: ‘This sentence is false.’ If it is true, then it is false; if it’s false, then it’s true. Paradoxes have not only led to puzzlement, but also to revolutions in thought about various philosophical issues, such as the nature of truth, meaning, metaphysics, knowledge, and space and time. Amongst the paradoxes the course will consider are logical paradoxes (such as the liar’s paradox), paradoxes of space and time, paradoxes of meaning, and paradoxes of knowledge. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 346, PHIL 371, PHIL 372, PHIL 373, or PHIL 380.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102514", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 481", "Name": "Advanced Topics in Ancient Philosophy", "Credits": "3", "Description": "An advanced examination of one or more figures, movements, or issues in ancient Greek and Roman philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 6 credits. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 321.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56076", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Ancient Epistemology, Hellenistic Philosophy, Plato’s ‘Republic’", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 482", "Name": "Aristotle’s Ethics", "Credits": "3", "Description": "Aristotle’s ethical theory has exerted a profound influence on the history of Western Philosophy, increasingly so in the last half century. In this course we will aim to gain a comprehensive understanding of his ethics, focusing on his presentation of it in the Nicomachean Ethics. Central notions we will examine include happiness, virtue, friendship, and pleasure. We will also delve into some of the scholarly interpretative debates, as well as the recent literature that takes inspiration from Aristotle.  Recommended Preparation: One 300-level course in philosophy, especially PHIL 321.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102510", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 483", "Name": "Plato’s Republic", "Credits": "3", "Description": "The aim of this course is to develop a detailed and comprehensive understanding of Plato’s Republic, from the first page to the last. The book will serve as a springboard to discuss fundamental philosophical questions such as: What is the best life for human beings to live? What is the best political organization? What is the nature of the human soul? What is the fundamental structure of reality?  What can be known and how can it be known?   Recommended Preparation: One 300-level course in philosophy, especially PHIL 321.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102511", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 484", "Name": "Kant’s Theoretical Philosophy", "Credits": "3", "Description": "A close reading of central parts of Kant’s Critique of Pure Reason, focusing on Kant’s revolutionary views about human knowledge and the possibility of engaging in metaphysics.Specific topics include: Kant’s novel theory of space and time; his account of a priori concepts and their necessary role in human knowledge; his criticisms of traditional philosophical theories of God, freedom, and the soul; and Kant’s responses to his predecessors, including Descartes and Hume. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 322.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56077", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 485", "Name": "Nietzsche", "Credits": "3", "Description": "A close study of Nietzsche’s central ideas, especially with a view toward their relevance for contemporary philosophy and culture. Topics may include: naturalism; nihilism; the will to truth and the will to power; drive psychology; perspectivism; the nature of philosophy and its relationship to art; Nietzsche’s critique of morality and re-evaluation of values. Readings will be drawn from key texts such as Beyond Good and Evil, Thus Spoke Zarathustra, The Genealogy of Morals, Daybreak, The Gay Science. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 350, PHIL 353, or PHIL 322.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102515", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 486", "Name": "Kant’s Moral and Political Philosophy", "Credits": "3", "Description": "A close study of Kant’s moral, political, and legal thought as it develops across major writings, focusing on Kant’s views about freedom and practical reason in morality, rational religion, and politics. Topics include: Kant’s theory of moral autonomy and free will; the ‘moral’ arguments for freedom of the will and the existence of God; Kant’s theory of property, the social contract, and international justice; and his arguments for the rationality of hope for historical progress in political life.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102572", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 487", "Name": "Hegel and Marx", "Credits": "3", "Description": "A close study of the social and political thought of Hegel and the early Marx, exploring key ideas such as recognition, alienation, the critique of capitalism, exploitation, and historical materialism, with an eye toward their relevance for contemporary political philosophy and critical social theory.  Classical texts from Hegel and Marx will be supplemented by readings from more recent authors working in the Hegelian and Marxian traditions, in order to give students a sense of the continuing influence and development of Hegel’s and Marx’s thought. Recommended Preparation: One 300-level course in philosophy with a grade of C or better, especially PHIL 322, PHIL 355, or PHIL 486.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "102648", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must have completed one course in PHIL with a grade of ‘C’ or better."}, {"Course": "PHIL 498", "Name": "Advanced Topics in Philosophy", "Credits": "3", "Description": "An advanced examination of a central topic, movement or figure in either the history of philosophy or contemporary philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts. Recommended Preparation: One 300 level course in philosophy with a grade of C or better.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56079", "Consent": "Instructor Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHIL 499", "Name": "Advanced Topics in Philosophy", "Credits": "3", "Description": "An advanced examination of a central topic, movement or figure in either the history of philosophy or contemporary philosophy. Topics will be published in the Schedule of Classes. This course is repeatable for credit with different topic. Students may complete a maximum of 12 credits or 4 attempts. Recommended Preparation: One 300 level course in philosophy with a grade of ‘C’ or better.", "Grading": "Graded/Pass Fail/Audit", "Course ID": "56080", "Consent": "No Special Consent Required", "Components": "Lecture", "Prerequisite/Corequisite": "You must complete one course in Philosophy with a ‘C’ or better."}, {"Course": "PHED 101", "Name": "Team Handball", "Credits": "1", "Description": "This course is designed to teach individual passing, dribbling and defending skills as well as team play related to the sport of team handball. Students will learn skills and strategies as well as playing the game of team handball. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "102158", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 102", "Name": "Badminton", "Credits": "1", "Description": "An introductory course activity class including basic skills, terminology, rules and courtesies, and strategy for singles and doubles in tennis and badminton. Course is divided into equal segments. Badminton is conducted in the fieldhouse. Tennis is conducted on the university tennis courts This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55919", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 103", "Name": "Team Handball", "Credits": "1", "Description": "This course is designed to teach individual passing, dribbling and defending skills as well as team play in the sport of team handball.  Students will learn skills and strategies as well as playing the game of team handball. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "102318", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHED 105", "Name": "Basketball", "Credits": "1", "Description": "This course is designed to improve basic basketball skills, knowledge of rules and strategies of play. Course meets for eight weeks. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55924", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 106", "Name": "Golf/Volleyball", "Credits": "1", "Description": "This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55925", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $45.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 109", "Name": "Jogging", "Credits": "1", "Description": "Development of fitness and conditioning, strength and endurance and different training techniques while jogging. Class will be held both indoors and outdoors on campus. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55928", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 111", "Name": "Cardio Fitness", "Credits": "1", "Description": "Designed to develop cardiovascular conditioning through the use of various aerobic activities, including cardiovascular equipment, calisthenics, dance and step (offered in certain sections). This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55931", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 112", "Name": "Beginning Swimming", "Credits": "1", "Description": "Designed to develop the necessary swimming skills so the student will feel safe and secure in, on or around the water. All basic skills are covered. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55932", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 113", "Name": "Intermediate Swimming", "Credits": "1", "Description": "Provides an opportunity to improve basic swimming skills. Information in the areas of competitive and basic swim skills from Red Cross materials will be offered. Extensive practice time is provided. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55934", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 116", "Name": "Trail Hiking", "Credits": "1", "Description": "Students in this course will have the opportunity to improve their conditioning by hiking some of the best local backcountry hiking trails in Maryland. Along the way, mini-lectures will focus on foot ware and care, trail safety, map reading, clothing selection and helpful accessories. Student must attend the first class and complete seven of the ten hikes offered. All hikes take place during scheduled meeting times. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55937", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $175.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 118", "Name": "Swim Conditioning", "Credits": "1", "Description": "Students will have the opportunity to swim and train in a very liberal setting. It will provide an opportunity to improve endurance and cardiovascular strength through swimming skills. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55939", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 121", "Name": "Physical Fitness", "Credits": "1", "Description": "This course is designed to give the student a working knowledge of weight training and aerobic conditioning programs. Students will be exposed to nautilus, free weight and universal machine training, as well as aerobic activities. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55943", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 122", "Name": "Self Defense", "Credits": "1", "Description": "This course provides practical self-defense skills including some defenses against punches and knife attacks. The majority of techniques are based in the martial arts. It is for people of all sizes, strengths and ages. (Tai Chi also may be listed under this heading.) Topics will be published in the Schedule of Classes. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55944", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Kenpo Karate, T’ai Chi Chih, Tai Chi, Kempo Karate, Wrestling, Tai Chi Chih, Self Defense, Tai Chi-Chih", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 122D", "Name": "Self Defense and Safety for Public Service Personnel", "Credits": "1", "Description": "This is an introduction to the principles and practices of basic self defense and occupational safety. The aerobic workout includes the application of Tae Kwon Do skills. The course includes readings and discussions to enhance personal safety. The course is conducted in a 15-week format and runs concurrently with the UMBC semester. Students may also receive course materials and assignments via the Internet, at the course website or in the mail. E-mail will be used as a tool for communication between students and the instructor. A discussion board and list serve will allow for asynchronous (off-line) communication. This course is repeatable. Students may complete a maximum of 3 credits or 2 attempts. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "100155", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 123", "Name": "Sports Officiating", "Credits": "1", "Description": "Course is designed to present an overview of officiating, umpiring and refereeing in a selected group of sports. There will be a combination of theoretical aspects to be covered by lecture, discussion and demonstrations, as well as practical involvement in class and during intramurals. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55945", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 124", "Name": "Outdoor Recreational Activities", "Credits": "1", "Description": "This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55946", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $200.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 125", "Name": "Volleyball", "Credits": "1", "Description": "An introduction to team volleyball. Proper skill techniques including serving, passing, setting, spiking and basic position play will be taught. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55947", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 127", "Name": "Aquatic Activities", "Credits": "1", "Description": "This class is designed so that students will have an opportunity to experience a variety of course offerings. Course offerings include: flat water kayaking, white water kayaking, organizational aquatic games and water activities. A course fee may apply. Topics will be published in the Schedule of Classes. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55949", "Consent": "No Special Consent Required", "Components": "Lecture", "Topics": "Flat Water Kayaking, Whitewater Kayaking, Whitewater Rafting, Aquatic Activities, Water Polo, Advanced Kayaking, White Water Kayaking, Intro To Kayaking, Kayaking", "Attributes": "Course Fee = $150.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 129", "Name": "Women’s Self Defense", "Credits": "1", "Description": "The goal of this course is to empower women and prevent gender-based violence. This course provides women with practical self-defense skills including verbal negotiation, releases from various grabs, rape prevention, and defense against strikes and knife attacks. The majority of techniques are based on Budo Taijutsu, which is a very practical martial art for people of all sizes, strengths and ages. The goal of this course is to empower women and to prevent violence against women. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55951", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $15.00, Exclude from Academic Credit - PHED Course"}, {"Course": "PHED 133", "Name": "Walking and Jogging", "Credits": "1", "Description": "A combination of programs that are involved with both walking and jogging that will range from low impact to advanced programs for each particular activity. Development of fitness and conditioning, strength and endurance, and different training techniques. Class will be held both indoors and outdoors on campus. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55955", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 135", "Name": "Softball", "Credits": "1", "Description": "An activity course designed to introduce and/or review skills and strategies for co-ed slowpitch softball. Students are responsible for providing their own gloves. All other equipment will be provided. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55957", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 136", "Name": "Women’s Lacrosse", "Credits": "1", "Description": "This course is designed to improve basic women’s lacrosse skills, knowledge of the rules and strategies of play. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55958", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 137", "Name": "Tennis", "Credits": "1", "Description": "An introductory activity class that includes basic skills, terminology, rules and courtesies as it relates to the game of tennis. Basic strategies for singles and doubles in tennis will be covered in the course. Course meets eight weeks. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Graded", "Course ID": "55959", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 138", "Name": "Individual Physical Education", "Credits": "1", "Description": "This course is designed for students who have medical limitations that prevent them from participating in regular activity classes. Activity will be tailored to meet the individual needs of each student. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55960", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 139", "Name": "Coed Crew", "Credits": "1", "Description": "This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55961", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $125.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 141", "Name": "Skiing", "Credits": "1", "Description": "This class will provide professional instruction for any level skier. The student will be charged a fee for lifts, lessons and transportation if available. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter)", "Grading": "Pass/Fail", "Course ID": "55963", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 143", "Name": "Bowling – Ten Pins", "Credits": "1", "Description": "An activity class designed to introduce and/or review the skills, techniques and other aspects of 10 pin bowling. If available, the department may provide transportation to a local bowling alley. There will be a slight fee for equipment rental and game charge. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55965", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 144", "Name": "Soccer (outdoor)", "Credits": "1", "Description": "An activity class covering the fundamental skills, strategies and concepts of the game of soccer. Course meets for eight weeks outdoors. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55967", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 146", "Name": "Weight Training/Physical Fitness", "Credits": "1", "Description": "This activity class will concentrate on training methods and techniques using free weights and strength training equipment. Students will develop a personal fitness program based on current physical condition and needs. There may be limited usage of cardiovascular equipment. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55970", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 146W", "Name": "Basic Winter Survival", "Credits": "1", "Description": "Lecture, discussion and outdoor experience combine to help students develop techniques for coping with adverse winter weather conditions and learning practical emergency preparedness for car, home and personal survival. A weekend trip will be scheduled to the mountains. Weather permitting, students will be able to participate in ice skating, snowshoeing and cross-country skiing. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter)", "Grading": "Pass/Fail", "Course ID": "55971", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 147", "Name": "Soccer (Indoor)", "Credits": "1", "Description": "This course will emphasize the basic skills of indoor soccer, including trapping, passing, shooting, one-on-one matchups, goaltending and use of the sideboards. This course will emphasize rules, conditioning and team play. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter)", "Grading": "Pass Fail/Audit", "Course ID": "55972", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 149", "Name": "Fundamentals of Sailing", "Credits": "1", "Description": "This course will teach the novice sailor to rig, get under way and sail a daysailer. Sailing takes place on the Patapsco River. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Summer)", "Grading": "Pass/Fail", "Course ID": "55975", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $150.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 153", "Name": "Scuba", "Credits": "1", "Description": "This course is available to those interested in obtaining the PDIC open-water scuba certification. The course will follow the national training system outline. Students may be responsible for providing their own personal gear, the instructor will provide tanks, weight belt, regulator and BC. An open-water dive will be required for certification. There is an additional fee for this course. (This course is six weeks in length.) This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55982", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $125.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 154", "Name": "Bowling", "Credits": "1", "Description": "This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55984", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 155", "Name": "Yoga", "Credits": "1", "Description": "Ashtanga Vinyasa “power” Yoga is accompanied by a powerful breathing technique called Ujjayi that calms and centers the mind while building heat in the body, strengthens the respiratory and skeletal muscles and increases VO 2 Max. The primary series is considered therapeutic and lays the foundation for more advanced postures and series, and protects against injuries. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter/Summer)", "Grading": "Pass Fail/Audit", "Course ID": "55985", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 156", "Name": "Billiards/Table Tennis", "Credits": "1", "Description": "This course provides instruction in the basic techniques and strategies of billiards. Students will be exposed to a variety of games including straight billiards, nine ball and tournament play. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter/Summer)", "Grading": "Pass/Fail", "Course ID": "55986", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $10.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 156W", "Name": "Billiards/Table Tennis", "Credits": "1", "Description": "This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55987", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 157", "Name": "Advanced Open Water Scuba", "Credits": "1", "Description": "This course will provide instruction in navigation, boat diving techniques, limited visibility diving, deep diving techniques and night diving skills. This course culminates with an open-water test for PDIC certification. There is an additional fee for this course. (This course is six weeks in length.) This course is repeatable. Recommended Preparation: PHED 153 or equivalent. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55988", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $150.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 160", "Name": "Racquetball", "Credits": "1", "Description": "This class will cover basic racquetball skills. Students will be exposed to a variety of competitive methods of play. Class will be held at Merritt Racquet Club. There is an additional fee for this course. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55991", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 161", "Name": "Ice Skating", "Credits": "1", "Description": "This class will cover the basics of ice skating techniques. The course will include group and individual instruction. There will be a nominal fee for ice time and skate rental. Transportation to the rink may be available. There is an additional fee for this course. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree. (Winter)", "Grading": "Pass/Fail", "Course ID": "55992", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 162", "Name": "Pom & Drill", "Credits": "1", "Description": "This course will emphasize the many techniques and skills needed to perform as dance squad. It will emphasize team dance routines. There will be additional sessions, as well as performances during varsity athletic events. (Tryouts will be conducted at the beginning of the course). This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55993", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 163", "Name": "Track & Field", "Credits": "1", "Description": "This course will emphasize the basic skills of track and field. Content will include training principles of sprinting and distance running. It will also introduce students to a variety of skills and techniques associated with running and field events. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55994", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 164", "Name": "Waterpolo", "Credits": "1", "Description": "This course will emphasize the basic skills of water polo, including passing, shooting, goal tending and one-on-one match-ups. Team strategies will include a variety of team offenses and defenses. There will be a strong emphasis on conditioning and rules of the game. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "55995", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 170", "Name": "Touch Football", "Credits": "1", "Description": "This course is designed for students to learn the basic principles, rules and skills of touch football. Class is non contact and eight weeks in length. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55997", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 171", "Name": "Field Hockey", "Credits": "1", "Description": "This course is designed for students to learn the basic principles, rules and skills of field hockey. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55998", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 173", "Name": "Pickleball", "Credits": "1", "Description": "This course is 1.5 credit hours. The class will focus on developing basic skills and integrating them into game situations. The skills of ball control, forehand/backhand drive, drive/lob serve, forehand/backhand lob, smash and game strategies will be covered. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "102587", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHED 175", "Name": "ROTC Training", "Credits": "1", "Description": "This course is designed for UMBC ROTC cadets who are in their junior or senior year participating in the Advanced Course. Rigorous physical training is required during this course. The course is designed to help the ROTC students meet the fitness requirement for commissioning as officers into the Armed Forces as well as instilling in each cadet an appreciation for a healthy lifestyle and lifetime fitness. This course is repeatable. Students may complete a maximum of 3 credits or 2 attempts. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "55999", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course", "Prerequisite/Corequisite": "You must have Junior or Senior standing in the ROTC program at UMBC to take this course."}, {"Course": "PHED 190", "Name": "CPR, AED, First Aid Certification", "Credits": "1", "Description": "This course prepares students to cope when emergency care is needed. Studies in accident prevention, examination procedures and first aid care for victims of accidents or sudden illness before medical assistance is available will be covered. Upon successful completion of the course, students will receive American Red Cross certification in CPR (adult, child and infant), Automated External Defibrillation, and Basic First Aid. This course is repeatable. Students may complete a maximum of 3 credits or 2 attempts. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "56000", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Course Fee = $50.00, Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 191", "Name": "T’ai Chi Chih (®)", "Credits": "1", "Description": "Tai Chi Chih practice is a series of 20 easy to learn movements that strongly circulate and balance the chi, the life force within us. It is a moving meditation that reduces stress, generates vital health and peace of mind, and enhances creativity and relaxation. This course is for students of all ages and sizes. This course is repeatable. Students may complete a maximum of 3 credits or 2 attempts. Note: Tai Chi Chih is not a martial art. Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass Fail/Audit", "Course ID": "100302", "Consent": "No Special Consent Required", "Components": "Lecture", "Attributes": "Exclude From Academic Credit - PHED Course"}, {"Course": "PHED 192", "Name": "Science of Injury Prevention & Human Performance", "Credits": "1", "Description": "This course educates students on the science of injury prevention as it relates to physical fitness and human performance. This course studies injury prevention through performing a proper warm-up, identifying tight and weak muscles by performing a functional movement screen, performing a series of exercises and drills designed to prevent injury to the ankle and knee known as a ‘performance enhancement program’, and by studying balance training and proper guidelines and lifting techniques for strength training exercises. Each class will meet once a week for 4 hours in the evening. The course will teach injury prevention through lectures, group projects, and active learning labs. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "100456", "Consent": "No Special Consent Required", "Components": "Lecture"}, {"Course": "PHED 193", "Name": "Marching and Pep Band", "Credits": "1", "Description": "This course provides the opportunity for students to develop and improve their musical and marching skills. Students will learn a large repertoire of music from various genres, while gaining experience marching and performing with a large ensemble. This course is repeatable. Note: Physical Education courses carry institutional credit which cannot count towards the 120 credits required for an undergraduate degree.", "Grading": "Pass/Fail", "Course ID": "100455", "Consent": "No Special Consent Required", "Components": "Laboratory", "Attributes": "Exclude From Academic Credit - PHED Course"}]